{"full_text": "Trump administration tries to break through lock-in effect with 'portable mortgages'NewsNewsPharmacist advises Georgians amid rising ACA healthcare costs without subsidy extensionGeorgia residents whorely on the Affordable Care Act for healthcare will soon see a spike in their premiums, with no plans to address the issue in place.Those Former massage therapist in Chattanooga sentenced for secretly filming clients undressingA former massage therapist in Chattanooga who pled guilty to taking secret videos of his clients in various states of undress has now been sentenced.KennethSpeBradley Central homecoming queen's act of kindness bridges gap between shared strugglesA simple college scholarship essay written by a senior atBradley Central High School turned into a support system for a young girl facing her own medical hurdlMarjorie Taylor Greene's exit sparks questions about future of Georgia's 14th DistrictThe reaction and questions continue after Marjorie Taylor Greene announced she would be departing from Congress in January.Her decision came in the wake of a puLocalEntertainmentNation & WorldARC CHATTANOOGAOffbeatElectionElection ResultsConnect to CongressAmazing AmericaTraffic TrackerMissing PersonsArmstrong Army StrongQuestion of the DaySpotlight on AmericaBeyond the PodiumFull Measure with Sharyl AttkissonCrisis in the ClassroomWeatherCurrent WeatherChattanoogaRain Late65F67/58Today67/58Tuesday67/56Wednesday59/34Latest WeathercastLatest WeathercastRadarHurricane TrackerStormcam 9 NetworkStormTrack 9 BlogMaps & MorePollen CountClosingsProgram Your Weather RadioFeaturesFeaturesPharmacist advises Georgians amid rising ACA healthcare costs without subsidy extensionGeorgia residents whorely on the Affordable Care Act for healthcare will soon see a spike in their premiums, with no plans to address the issue in place.Those Former massage therapist in Chattanooga sentenced for secretly filming clients undressingA former massage therapist in Chattanooga who pled guilty to taking secret videos of his clients in various states of undress has now been sentenced.KennethSpeZelle limits at top banksLooking to use Zelle for a transfer? Here are the Zelle limits at various banks.Bradley Central homecoming queen's act of kindness bridges gap between shared strugglesA simple college scholarship essay written by a senior atBradley Central High School turned into a support system for a young girl facing her own medical hurdlPay It ForwardPrice of FreedomEducator of the WeekSinclair CaresPartner SpotlightFor Pet's SakeRoad Trippin'Community SpotlightContestsBlack History HonorsTomorrow Town, TennesseeLifestyleLifestylePharmacist advises Georgians amid rising ACA healthcare costs without subsidy extensionGeorgia residents whorely on the Affordable Care Act for healthcare will soon see a spike in their premiums, with no plans to address the issue in place.Those Former massage therapist in Chattanooga sentenced for secretly filming clients undressingA former massage therapist in Chattanooga who pled guilty to taking secret videos of his clients in various states of undress has now been sentenced.KennethSpeZelle limits at top banksLooking to use Zelle for a transfer? Here are the Zelle limits at various banks.Bradley Central homecoming queen's act of kindness bridges gap between shared strugglesA simple college scholarship essay written by a senior atBradley Central High School turned into a support system for a young girl facing her own medical hurdlThis 'N ThatGame CenterGame CenterDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchWatchLiveNow65°Tue69°Wed61°SearchSearchUser IconWatchSearchNewsDown ArrowLocalEntertainmentNation & WorldARC CHATTANOOGAOffbeatElectionElection ResultsConnect to CongressAmazing AmericaTraffic TrackerMissing PersonsArmstrong Army StrongQuestion of the DaySpotlight on AmericaBeyond the PodiumFull Measure with Sharyl AttkissonCrisis in the ClassroomWeatherDown ArrowWeather HomeRadarHurricane TrackerStormcam 9 NetworkStormTrack 9 BlogMaps & MorePollen CountClosingsProgram Your Weather RadioFeaturesDown ArrowFeatures HomePay It ForwardPrice of FreedomEducator of the WeekSinclair CaresPartner SpotlightFor Pet's SakeRoad Trippin'Community SpotlightContestsBlack History HonorsTomorrow Town, TennesseeLifestyleDown ArrowLifestyle HomeThis 'N ThatGame CenterDown ArrowGame Center HomeDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchMoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsChime InSportsDown ArrowSports HomeSports HeadlinesCollegeOutdoorsFriday Night RivalsScoreboardSoccerHigh School HoopsTICKETSCity GuideSideline SpotlightNewsletter Sign UpStationDown ArrowStation HomeContactPeopleCareersWhat's on NC9WTVC LegacyGood NewsSinclair Broadcast Diversity Scholarship FundNewsletter Sign UpNextGen TVHealthAdvertise With UsMemorialsLegalDown ArrowTerms & ConditionsCopyright NoticesEEO Public File ReportFCC Online Public FileFCC ApplicationsPublic File AssistanceContactNews TeamCareersConteststwitter iconfacebook iconACCESSIBILITYArmstrong Williams Town HallArmstrong Williams takes on the news of the week and asks the questions you want answered. Don’t miss our weekly town hall!WATCHClose11Please ensure Javascript is enabled for purposes of website accessibilityTrump administration tries to break through lock-in effect with 'portable mortgages'by AUSTIN DENEAN | The National News DeskFri, November 14, 2025 at 12:47 PM4VIEW ALL PHOTOSFILE - A for sale sign stands outside a home on the market in the Alamo Placita neighborhood Tuesday, Aug. 27, 2024, in central Denver. (AP Photo/David Zalubowski, File)Comment on this story0CommentShare storySharetopics: Mortgage ratesPortable mortgagesHousing affordabilityLock-in effectHomeownershipHousing supplyMortgage-backed securitiesTariffsWASHINGTON (TNND) — The Trump administration is considering another method to bring down soaring housing costs through mortgage rates that are pricing people out of homeownership and keeping homes from coming onto the market.Federal Housing Finance Agency director Bill Pulte said the administration is “actively evaluating “portable mortgages,” which would allow homebuyers to take their mortgage rate with them when they decide to move. The proposal is a direct bid to confront the so-called “lock-in effect,” where homeowners are unwilling or unable to part with their lower mortgage rate and keeping their home off the market.Many homeowners were able to buy or refinance during the pandemic for ultra-low rates at or below 3%, which cuts hundreds of dollars off a monthly mortgage payment. Rates have been stuck between 6 to 7% for the last several years, creating a barrier for homeowners to put their homes up for sale as they don’t want to take up a new loan at higher rates. More than half of homeowners with a mortgage have a rate below 4%, according to Redfin.Homes are changing hands at the lowest rate in decades in 2025 in a market that has been in a standstill for years as mortgage rates climbed and economic uncertainty set in. A Redfin analysis found only 2.8% of homes in the U.S. have turned over to a new owner in 2025.“Buyers are walking away from deals more often, sometimes due to affordability issues and sometimes because they’re re-evaluating whether now is the right moment to commit,” Redfin head of economic research Chen Zhao said in a release. “Others aren’t even shopping, waiting instead for prices or mortgage rates to come down. On the other side, many sellers are staying put—either because they’re locked into low rates or unwilling to accept offers below expectations.”Allowing people to take their mortgage rate with them to a new property could help boost the supply of existing homes on the market if more homeowners are willing to move with their lower rate.But it could also come with higher list prices as more people enter a market with a limited pool of homes available to buy. Homeowners would also have an advantage on bidding compared to a new buyer who is working with today’s rates with more wiggle room in their budgets.“Anyone able to ‘port’ a 3% mortgage into a new purchase would effectively be bidding with cheap financing in a 6% world. That added purchasing power would push prices up, while renters and mortgage-free owners would still face today’s higher rates—only now with even higher list prices,” Jake Krimmel, a senior economist at Realtor.com, wrote in an analysis.Portable mortgages could also disrupt the U.S. mortgage system and lead to higher rates. Mortgage-backed securities, groups of mortgages that lenders sell to investors, would have their pricing models blown up and create more risk for investors as less loans are paid off early with more homeowners taking them with them when they move.Pulte has also said officials are evaluating a plan to offer 50-year mortgages and how to make mortgages assumable, where homebuyers could take over a seller’s preexisting loan. Assumable mortgages are already available in the U.S. but are rarely used because they require a large cash payment or a second mortgage at current rates.The 50-year mortgage could lower monthly payments by stretching out the term of the loan but would also likely come with higher rates and would ultimately cost buyers more in interest over the life of the loan and make it take longer to build equity.The administration’s efforts to lower housing costs come as an increasing slice of Americans are being priced out of the market altogether with elevated mortgage rates and consistently growing list prices. Home values have climbed significantly compared to before the pandemic for both new and existing homes amid a lack of sufficient supply.A shortage of homes is widely seen as the biggest issue when it comes to tackling housing affordability in the United States. Construction cratered in the aftermath of the 2008 financial crisis and has struggled to recover to a sufficient level to meet the demand.Housing starts have slumped in 2025 as builders confront cost challenges and a stalled market. Higher rates are also a challenge for construction, which is also impacted by the rising cost of labor and materials.Tariffs have been a double blow for builders, as the uncertainty around them has chilled activity in the housing market and broader economy. Import taxes have also increased the cost of materials used to build homes, making it more expensive for builders to start and complete projects.Tariffs that went into effect last month imposed a 10% tax on all timber and lumber imports, along with a 25% tariff on kitchen cabinet and furniture. The U.S. imports about one-third of its lumber, primarily from Canada, that are also subject to further tariffs.Trending8 inmates face charges after 2 inmates attacked at Hamilton County JailSeveral inmates at the Hamilton County Jail have been charged after a stabbing incident that left two men hospitalized.Affidavits we obtained says deputies wereConfined dog shot, killed in Bradley County; Woman charged with aggravated animal crueltyA woman in Bradley County faces charges after deputies say she shot and killed a dog at a home on Sunday.Deputies responded to the home in the northeast part oMan charged with killing a deer illegally in ChattanoogaA Chattanooga man faces charges after a state game warden says he found evidence that he illegally shot and killed a deer over the weekend.An affidavit says autReport: Hamilton County deputies shot suspect who sped towards them with stolen vehicleWe're learning more from an affidavit about what led to 2 Hamilton County deputies shooting a suspectat a Chattanooga gas station early Saturday morning.The inFormer Tennessee lawmaker Robin Smith learns where she'll serve her prison sentenceFormer Hixson state lawmaker Robin Smith has learned where she will serve her federal prison sentence, even as her attorneys work to get her a pardon from PresiNEWS IN PHOTOS:\"Local\"5Pharmacist advises Georgians amid rising ACA healthcare costs without subsidy extension6Bradley Central homecoming queen's act of kindness bridges gap between shared struggles6Marjorie Taylor Greene's exit sparks questions about future of Georgia's 14th District3Judge denies new trial for Chattanooga man convicted in Market Street murder caseACCESSIBILITYDownload Our Mobile Apps:Terms & ConditionsCopyright NoticesEEO Public File ReportFCC Online Public FileFCC ApplicationsPublic File AssistanceContactNews TeamCareersContestsNewsWeatherSportsGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1758, "success": true}