{"full_text": "Salinas kicks off Housing Month with urgent call to tackle affordability crisis\nAt the city’s first Regional Housing Summit, leaders, developers and experts laid out plans to boost affordable housing in Salinas, citing the need to retain future homebuyers and create opportunities for families across all income levels.\nSalinas kicks off Housing Month with urgent call to tackle affordability crisis\nAt the city’s first Regional Housing Summit, leaders, developers and experts laid out plans to boost affordable housing in Salinas, citing the need to retain future homebuyers and create opportunities for families across all income levels.\nTHE SERIES AIMED AT TACKLING THE CITY'S BIGGEST HOUSING CHALLENGES AND EXPLORING SOLUTIONS.\n<THIS IS HOW WE PLANT THE SEEDS FOR FUTURE GROWTH. AND HOW CAN WE BE, AGAIN, INNOVATIVE IN THAT SPACE. SO I REALLY HOPE THAT WE WALK OUT OF HERE WITH SOME SOLUTIONS, WITH PARTNERSHIPS. WELL, PEOPLE ROLLING UP THEIR SLEEVES AND SAYING, YEAH, WE CAN DO THIS HERE IN SALINAS\">\nTHAT'S WHAT WEDNESDAY'S REGIONAL HOUSING SUMMIT AT THE STEINBECK CENTER WAS ALL ABOUT.\nATTENDEES OUTLINING PLANS TO ADDRESS THE AFFORDABLE HOUSING SHORTAGE.\nTHIS IS THE FIRST OF THREE EVENTS FOR SALINAS HOUSING MONTH, IN A CITY THAT THE MAYOR SAYS HAS LONG FACED ONE OF THE HIGHEST HOUSING COST TO LOW INCOME RATIOS IN THE COUNTRY. <NOTHING'S CHANGED IN 20 YEARS. BUT BUT THERE'S A REAL SENSE OF URGENCY ABOUT ADDRESSING THIS ISSUE. AND THE GOOD NEWS IS THINGS ARE GETTING READY TO HAPPEN\">\nTHAT URGENCY CARRIED INTO A PANEL ON CALIFORNIA'S HOUSING LANDSCAPE, BREAKING DOWN STATEWIDE HOUSING GOALS AND AFFORDABILITY CHALLENGES STRONG CONCERN WITH THE ISSUE OF AFFORDABILITY AND THE DIFFICULTIES OF BUYING HOMES. THOSE CAME THROUGH IN THE QUESTIONS. AND WE TRIED TO ADDRESS THOSE ISSUES BECAUSE I THINK FUNDAMENTALLY, MOST PEOPLE WANT TO OWN A HOME SOONER OR LATER. AND RIGHT NOW THEY'RE BEING STYMIED\" >\nCITY LEADERS SAY SALINAS WANTS TO GROW WHILE MAINTAINING SOME KIND OF AFFORDABILITY. IF THEY WANT TO GROW, EXPERTS SAY THEY HAVE TO LOOK AT THE NEXT GENERATION OF HOMEBUYERS. <\"YOU MAY BE ABLE TO RETAIN THEM IN APARTMENTS FOR UNTIL THEY'RE IN THEIR LATE 20S, EARLY 30S, AND THEN THEY'RE GOING TO WANT A HOUSE. AND IF THEY CAN'T GET A HOUSE THAT A LOT OF THEM ARE GOING TO GO SOMEWHERE ELSE>\nDEVELOPERS ALSO DISCUSSED NEW HOUSING PROJECTS PLANNED FOR NORTH AND EAST SALINAS, SOME SET TO BREAK GROUND NEXT YEAR.\nTHE EVENT WRAPPED WITH A WORKFORCE HOUSING PANEL LED BY TAHRA GORAYA, EXPLORING NEW HOUSING DESIGN MODELS AND HOW CITIES CAN GET CREATIVE WHEN BUILDING HOMES. <\"WE NEED A MIX OF EVERYTHING ACROSS ALL INCOME LEVELS TO REALLY MAKE SURE THAT CENTRAL COAST, IN THE LONG RUN, CAN BE AFFORDABLE, AND ALL OF OUR FAMILIES CAN LIVE HERE FOR.\" >\nIF YOU'D LIKE TO ATTEND THE OTHER EVENTS FROM THIS SERIES, YOU CAN VISIT THE CITY OF SALINAS WEBSITE FO\nUpdated: 6:22 PM PST Nov 5, 2025\nEditorial Standards ⓘ\nJazmon DeJarnette\nReporter\nAdvertisement\nSalinas kicks off Housing Month with urgent call to tackle affordability crisis\nAt the city’s first Regional Housing Summit, leaders, developers and experts laid out plans to boost affordable housing in Salinas, citing the need to retain future homebuyers and create opportunities for families across all income levels.\nUpdated: 6:22 PM PST Nov 5, 2025\nEditorial Standards ⓘ\nJazmon DeJarnette\nReporter\nOn Wednesday, the city of Salinas held a Regional Housing Summit, the first of three events in the Salinas Housing Month series. The event was a mix of city leaders, housing developers, and other officials outlining plans to address the affordable housing shortage.The mayor says the city has long faced one of the highest housing cost to low income ratios in the country. \"Nothing's changed in 20 years. But, but there's a real sense of urgency about addressing this issue, and the good news is things are getting ready to happen,\" said Dennis Donohue, Salinas mayor.That urgency carried into a panel on California's housing landscape, breaking down statewide housing goals and affordability challenges.\"There's clearly a strong concern with the issue of affordability and the difficulties of buying homes. Those came through in the questions. And we tried to address those issues because I think fundamentally, most people want to own a home sooner or later. And right now they're being stymied,\" said Joel Kotkin, keynote speaker at the summit.City leaders say Salinas wants to grow while maintaining some kind of affordable housing.If they want to grow, experts say they have to look at the next generation of homebuyers.\"You may be able to retain them in apartments for, until they're in their late 20s, early 30s, and then they're going to want a house. And if they can't get a house that a lot of them are going to go somewhere else,\" said Kotkin. Developers also discussed new housing projects planned for North and East Salinas, some set to break ground next year. The event wrapped with a workforce housing panel led by Tahra Goraya, exploring new housing models and how cities can get creative when building homes.\"We need a mix of everything across all income levels to really make sure that Central Coast, in the long run, can be affordable, and all of our families can live here,\" said Goraya.\nSALINAS, Calif. — On Wednesday, the city of Salinas held a Regional Housing Summit, the first of three events in the Salinas Housing Month series. The event was a mix of city leaders, housing developers, and other officials outlining plans to address the affordable housing shortage.\nAdvertisement\nThe mayor says the city has long faced one of the highest housing cost to low income ratios in the country. \"Nothing's changed in 20 years. But, but there's a real sense of urgency about addressing this issue, and the good news is things are getting ready to happen,\" said Dennis Donohue, Salinas mayor.That urgency carried into a panel on California's housing landscape, breaking down statewide housing goals and affordability challenges.\"There's clearly a strong concern with the issue of affordability and the difficulties of buying homes. Those came through in the questions. And we tried to address those issues because I think fundamentally, most people want to own a home sooner or later. And right now they're being stymied,\" said Joel Kotkin, keynote speaker at the summit.\nCity leaders say Salinas wants to grow while maintaining some kind of affordable housing.\nIf they want to grow, experts say they have to look at the next generation of homebuyers.\"You may be able to retain them in apartments for, until they're in their late 20s, early 30s, and then they're going to want a house. And if they can't get a house that a lot of them are going to go somewhere else,\" said Kotkin. Developers also discussed new housing projects planned for North and East Salinas, some set to break ground next year. The event wrapped with a workforce housing panel led by Tahra Goraya, exploring new housing models and how cities can get creative when building homes.\"We need a mix of everything across all income levels to really make sure that Central Coast, in the long run, can be affordable, and all of our families can live here,\" said Goraya.\nWeather Information\nLatest Forecast\n°\nF\nFEELS LIKE\nNo weather data available\nHOURLY\nDAILY\nRADAR\nTRAFFIC\nShare\nCopy Link\nCopy\n{copyShortcut} to copy\nTop Picks\nThanksgiving Throwback: Bowling with frozen turkeys was the weirdest way people celebrated\nFlying for Thanksgiving? See which airlines, airports have the most delays this week\nJimmy Cliff, reggae legend who sang 'The Harder They Come,' dies at 81\nThanksgiving travel tips amid record airport crowds", "extraction_method": "beautifulsoup", "word_count": 1274, "success": true}