{"full_text": "Nov 21, 2025Housing affordability is declining faster in rural areasHousing everywhere is less affordable, but the affordability crisis is accelerating fastest in rural areas, according to an analysis by Redfin.\nHousingby Elizabeth TrovallPlayListen NowSaveShareDownloadZillow found that rural homebuyers need to make about $75,000 a year to be able to afford a house now — more than double the income they needed before the pandemic.Mario Tama/Getty ImagesMany Americans chasing the dream of home ownership have turned to rural areas, where it’s more affordable and you can get more space for less. But while homes everywhere are becoming less affordable, the problem is actually accelerating faster in rural areas, according to new analysis by Redfin. When Kristin Fuerstenberg bought her cabin in northern, rural Wisconsin five years ago, it was supposed to be a part-time thing. But she loved the change of scenery.“I wake up every day, I look out at a lake, and you can't beat that,” she said.Like a lot of people who bought in the area around the time of the pandemic, she stuck around. She’s a realtor there in Oneida County and said, even now, inventory is low and prices are high. Take the home she sold earlier this year: “3 bedroom, 1 bath little ranch. $350,000. And prior to 2021, that house probably would have been $170,000.” Housing everywhere is less affordable, but in rural areas — like where Fuerstenberg lives — the affordability crisis is accelerating fastest, per Chen Zhao, head of economics research at Redfin.“Rural buyers, they have to earn about $75,000 in order to afford the typical home, and that is double what they needed to earn before the pandemic,” she said. Income has only gone up 33% in rural areas. Colorado realtor Dana Cottrell is seeing this play out in communities outside big ski destinations in the Rockies.“When you get priced out of maybe the bigger resorts, you tend to look a little further afield, and then what happens to the people that are living there, to the ranches, it becomes harder and harder for people to afford their local areas,” she said.On the flip side, Cottrell said, for those who were able to get into homes five years ago, that investment is paying off.Related TopicsCollections:HousingTagged as:Housinghousing affordabilityrural areascovid-19 pandemicOur best stories, straight to your inboxSign up for the Marketplace newsletter to get stories that help you live smarter — plus analysis, explainers and our song of the week — sent to you every Friday morning.SubscribeSee TermsLatest StoriesYour Amazon return is probably going to end up on a warehouse palletAs movies struggle, U.S. theaters pivot to the events businessEconomic uncertainty is leaving a lot of people feeling stuckStories You Might LikeView AllEconomic uncertainty is leaving a lot of people feeling stuckPlaySaveLived EconomiesLow rates and wage growth bolstered housing market in OctoberPlaySaveHousingHome sales predicted to jump 14% in 2026PlaySaveHousingLatest EpisodesView All ShowsPlay Are more Americans working multiple jobs?4 hours ago25:38Play Can China spur consumer spending?11 hours ago6:27Play AI-generated \"letters to the editor\" are flooding academic publications16 hours ago9:18Play Cheers to hosting better parties this holiday season3 days ago23:17Play What are royalties, trademark and copyright?14 days ago32:45Play The things we leave behind (updated rerun)4 months ago35:26", "extraction_method": "beautifulsoup", "word_count": 531, "success": true}