{"full_text": "About\nCenters\nPress\nPresident's Page\nNational Affairs\n     \nScholars\nPolicy Areas\nProducts\nEvents\nAEIdeas\nSubscribe\nDonate\nPost\nHousing Affordability? Build, Baby, Build\n\nBy James Pethokoukis\n\nAEIdeas\n\nOctober 02, 2025\n\nFacebook\nTwitter\nLinkedIn\n\nPlain and simple (if not so easy politically): The cure for America’s housing crisis isn’t government subsidies or corporate scapegoats. It’s more homes. And this “supply and demand” solution isn’t being offered only by the new “abundance” advocates of the center left. Tobias Peter of the AEI Housing Center and economists at Goldman Sachs have both recently argued that affordability has collapsed because supply hasn’t kept up. Until policymakers face that basic, Econ 101 reality, prices and rents will remain out of reach.\n\nIn a recent podcast chat with me, Peter traces today’s housing crunch to a century of misguided rules and insular local politics. Zoning laws that restricted much land to single-family use, NIMBY activism that blocked projects, and environmental reviews that layered on costs have all constrained supply. Regulations now add about a quarter to the cost of a single-family home. \n\nWhile economics-averse critics blame institutional landlords, Peter dismisses that explanation as a distraction: Big investors own just one percent of single-family homes nationwide, never more than 10 percent in any county. The real imbalance, he says, is that years of policy choices have made it “easy to build small apartments for singles, but hard to build townhomes or modest houses for families.” His prescription is straightforward: Simplify rules, shrink minimum lot sizes, and reduce discretionary veto power. Had those reforms been in place since 2000, he estimates, the US would have nine million more homes today.\n\nGoldman Sachs reaches similar conclusions in a new report, “The State of Housing (Un)Affordability in the US.” The bank quantifies just how badly affordability has deteriorated this decade. The typical mortgage payment has jumped from less than 20 percent of income before the pandemic to more than 30 percent since 2022, “a historically high ratio.” Also: “While affordability is less of a problem in the rental market, the rent-to-income ratio is now at its highest level since 1980.”\n\nIn addition, Goldman estimates the national housing shortage at roughly three to four million units, equal to two to three percent of the current housing stock. Among specific states, California and Florida face the largest deficits. The GS analysts attribute the gaps to a “sharp slowdown” in supply growth after the 2007–09 Great Recession, which left vacancy rates well below the norms of the two prior decades.\n\nMany of the bank’s explanations echo Peter’s:\n\nRestrictive zoning rules. Most US cities limit housing with height caps, large minimum lot sizes, and strict occupancy limits. Regulations have tightened over decades, and because rules are set by thousands of small towns and cities, reforms are hard to scale. \nShrinking supply of buildable land. Empty, developable land is running out. In big metros, remaining land is mostly at the edges, where long commutes make building less practical.\nFalling construction productivity and worker shortages. The construction industry has become less efficient over the last half-century, while a lack of skilled workers slows down projects, especially apartments. \nWeaker supply response to higher prices. Housing markets are less elastic than before. Price increases now trigger far smaller boosts in new supply than in past decades.                                                       \n\nGoldman simulations suggest that reducing regulation to the level of the least restrictive metros could add 2.5 million units over the next decade, eliminating two-thirds of the shortage. Yet history shows reforms often fall short: \n\nWhile a large-scale reform could help to alleviate the housing shortage, implementing one would be challenging. Many land use reforms that were proposed by housing policy advocates and local governments over the past decade were rejected by local communities. A few reforms that were eventually passed affected only a small fraction of the land in the targeted cities.[7] As Exhibit 12 shows, academic studies found that these reforms led to only incremental increases in the housing supply that were not large enough to offset a rapid increase in local demand.\n\nBesides land use reforms, federal and local governments have also tried other policies to alleviate the affordability issue, such as providing tax credits for the construction of affordable housing or setting a cap on rents for certain segments of the housing market. The academic studies reported in Exhibit 12 found that these policies indeed helped to reduce housing costs for lower-income households, but some of them also crowded out other housing investments and were costly to implement. \n\nBoth Peter and Goldman Sachs—and the abundance folks—agree: The only real fix is building more of the right homes, faster.\n\nLearn more: AI’s Possible Endgame: Lots of Growth Without Many Workers | Walmart’s AI Bet Could Again Help Drive a US Productivity Acceleration | Robot Umps Call Time on Baseball’s Artisans Behind the Plate | Time to Build … New Us Cities\n\nJames Pethokoukis \nSenior Fellow DeWitt Wallace Chair Editor, AEIdeas Blog\nLatest Work\nNovember 21, 2025\nPost\nAmerica’s Antitrust Revival Is Running Into the Same Obstacle Every Time: American Capitalism\nNovember 19, 2025\nPost\nThe Tariff Threat to America’s AI Moment\nNovember 17, 2025\nPost\nAI’s Productivity Boost May Arrive Sooner Rather than Later\nTags:\nAffordable housing | Housing | Housing Center: Commentary | Housing Center: Policy | supply and demand\nRelated\nPost\nOctober 01, 2025\nAEIdeas\nAI’s Possible Endgame: Lots of Growth Without Many Workers\nBy James Pethokoukis\nPost\nSeptember 29, 2025\nAEIdeas\nWalmart’s AI Bet Could Again Help Drive a US Productivity Acceleration\nBy James Pethokoukis\nPost\nSeptember 25, 2025\nAEIdeas\nRobot Umps Call Time on Baseball’s Artisans Behind the Plate\nBy James Pethokoukis\nArticle\nSeptember 25, 2025\nFaster, Please!\nTime to Build … New Us Cities\nBy James Pethokoukis\nAbout\nAbout AEI\nOrganization and Purpose\nLeadership\nAnnual Report\nAEI Archive\nScholars\nFind a scholar by policy area:\nAgricultural Policy Studies\nCenter for Technology, Science, and Energy\nEconomics\nEducation\nForeign and Defense Policy\nHealth Care\nHousing\nLegal and Constitutional\nOpportunity and Social Mobility\nPolitics and Public Opinion\nSociety and Culture\nPolicy Areas\nEconomics\nForeign and Defense Policy\nHealth Care\nEducation\nPolitics and Public Opinion\nOpportunity & Social Mobility\nSociety and Culture\nTechnology and Innovation\nLegal and Constitutional Studies\nContact\nAmerican Enterprise Institute\n1789 Massachusetts Avenue,\nNW Washington, DC 20036\n\nMain telephone: 202.862.5800\nMain fax: 202.862.7177\nDonate\nSubscribe\n© 2025 American Enterprise Institute | Privacy Policy", "extraction_method": "jina", "word_count": 1056, "success": true}