{"full_text": "Trump administration tries to break through lock-in effect with 'portable mortgages'NewsNews'Violence has been normalized': Task force releases report on curbing gun violenceA new report from the Michigan Gun Violence Prevention Task Force is calling gun violence a public health emergency.'A horrific situation': MSP asks for public's help with video evidence in abduction caseGRAND TRAVERSE COUNTY, Mich,. (WPBN/WGTU) - - Michigan State Polcie are investigating an attempted abduction that occurred Sunday morning at a gas station in TrTraverse City community gathers for vigil honoring collective grief and lossTRAVERSE CITY,. (WPBN/WGTU) - - Community members came together for a &ldquo;Vigil for Grief and Loss&rdquo; to gather, honor, name, and tend to the many forms of loss membSheriff's office confirms missing man with dementia found safe in Missaukee CountyMISSAUKEE COUNTY, Mich,. (WPBN/WGTU) - - The Missaukee County Sheriff’s Office has announced that David Patrick Sherman has been found safe.\"Thank you to the coLocal Beyond The PodiumNation & WorldEntertainmentConnect To CongressOffbeatVideosElectionEconomyAmazing AmericaAuto MattersElection ResultsMichigan PoliticsArmstrong Army StrongLifestyle MattersInside Your WorldPoliticalSoarNeighborhoodSpotlight on AmericaMichigan MarijuanaTrafficHealthy HomeFull Measure with Sharyl AttkissonDid You Know?2020 ResultsAddicted MichiganCrisis in the ClassroomClosed CasesWeatherCurrent WeatherTraverse CityShowers Early48F47/41Today47/41Tuesday47/38Wednesday42/29Latest WeathercastLatest WeathercastRadarClosingsWeather CamerasMapsFish and Game ReportHurricane TrackerSnowballHotshotsUpNorthLive SkyView DroneDeals - SpotlightCommunityCommunity'Violence has been normalized': Task force releases report on curbing gun violenceA new report from the Michigan Gun Violence Prevention Task Force is calling gun violence a public health emergency.'A horrific situation': MSP asks for public's help with video evidence in abduction caseGRAND TRAVERSE COUNTY, Mich,. (WPBN/WGTU) - - Michigan State Polcie are investigating an attempted abduction that occurred Sunday morning at a gas station in TrTraverse City community gathers for vigil honoring collective grief and lossTRAVERSE CITY,. (WPBN/WGTU) - - Community members came together for a &ldquo;Vigil for Grief and Loss&rdquo; to gather, honor, name, and tend to the many forms of loss membZelle limits at top banksLooking to use Zelle for a transfer? Here are the Zelle limits at various banks.Community CalendarChime InUp North PetsExploring MichiganAsk the AttorneyYour Mental Health ConnectionMaking CentsGame CenterGame CenterDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchWatchLiveNow48°Tue47°Wed42°SearchSearchUser IconWatchSearchNewsDown ArrowLocal Beyond The PodiumNation & WorldEntertainmentConnect To CongressOffbeatVideosElectionEconomyAmazing AmericaAuto MattersElection ResultsMichigan PoliticsArmstrong Army StrongLifestyle MattersInside Your WorldPoliticalSoarNeighborhoodSpotlight on AmericaMichigan MarijuanaTrafficHealthy HomeFull Measure with Sharyl AttkissonDid You Know?2020 ResultsAddicted MichiganCrisis in the ClassroomClosed CasesWeatherDown ArrowWeather HomeRadarClosingsWeather CamerasMapsFish and Game ReportHurricane TrackerSnowballHotshotsUpNorthLive SkyView DroneDeals - SpotlightDown ArrowDeals - Spotlight HomePartner SpotlightBack to SchoolFor Pet's SakeMoneywiseTackle HungerUp North PetsCommunity CalendarMaking CentsCommunityDown ArrowCommunity HomeCommunity CalendarChime InUp North PetsExploring MichiganAsk the AttorneyYour Mental Health ConnectionMaking CentsGame CenterDown ArrowGame Center HomeDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchMoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsChime InSportsDown ArrowSports HomeHometown HighlightsOlympicsMore SportsScoreboardThe Blue PrintTICKETSCity GuideHealthDown ArrowHealth HomeHealth NewsDealsDown ArrowDeals HomeGolf CardHoliday MarketplaceNewsletter Sign UpStationDown ArrowStation HomeContact WPBN/WTOMContact WGTQ/WGTUPeopleScheduleContestsCareersEEOTermsCopyrightPrivacyCommunity CalendarVideo Request ServicesCreative ServicesSinclair CaresNewsletter Sign UpLegalDown ArrowTerms & ConditionsCopyright NoticesEEO Public File ReportWPBN FCC Info WPBN FCC ApplicationsWGTU FCC InfoWGTU FCC ApplicationsWGTQ FCC InfoWGTQ FCC ApplicationsWTOM FCC InfoWTOM FCC ApplicationsPublic File AssistanceContact WPBN/WTOMContact WGTQ/WGTUNews TeamCareersConteststwitter iconfacebook iconACCESSIBILITYArmstrong Williams Town HallArmstrong Williams takes on the news of the week and asks the questions you want answered. Don’t miss our weekly town hall!WATCHClose11Please ensure Javascript is enabled for purposes of website accessibilityTrump administration tries to break through lock-in effect with 'portable mortgages'by AUSTIN DENEAN | The National News DeskFri, November 14, 2025 at 12:47 PM4VIEW ALL PHOTOSFILE - A for sale sign stands outside a home on the market in the Alamo Placita neighborhood Tuesday, Aug. 27, 2024, in central Denver. (AP Photo/David Zalubowski, File)Comment on this story0CommentShare storySharetopics: Mortgage ratesPortable mortgagesHousing affordabilityLock-in effectHomeownershipHousing supplyMortgage-backed securitiesTariffsWASHINGTON (TNND) — The Trump administration is considering another method to bring down soaring housing costs through mortgage rates that are pricing people out of homeownership and keeping homes from coming onto the market.Federal Housing Finance Agency director Bill Pulte said the administration is “actively evaluating “portable mortgages,” which would allow homebuyers to take their mortgage rate with them when they decide to move. The proposal is a direct bid to confront the so-called “lock-in effect,” where homeowners are unwilling or unable to part with their lower mortgage rate and keeping their home off the market.Many homeowners were able to buy or refinance during the pandemic for ultra-low rates at or below 3%, which cuts hundreds of dollars off a monthly mortgage payment. Rates have been stuck between 6 to 7% for the last several years, creating a barrier for homeowners to put their homes up for sale as they don’t want to take up a new loan at higher rates. More than half of homeowners with a mortgage have a rate below 4%, according to Redfin.Homes are changing hands at the lowest rate in decades in 2025 in a market that has been in a standstill for years as mortgage rates climbed and economic uncertainty set in. A Redfin analysis found only 2.8% of homes in the U.S. have turned over to a new owner in 2025.“Buyers are walking away from deals more often, sometimes due to affordability issues and sometimes because they’re re-evaluating whether now is the right moment to commit,” Redfin head of economic research Chen Zhao said in a release. “Others aren’t even shopping, waiting instead for prices or mortgage rates to come down. On the other side, many sellers are staying put—either because they’re locked into low rates or unwilling to accept offers below expectations.”Allowing people to take their mortgage rate with them to a new property could help boost the supply of existing homes on the market if more homeowners are willing to move with their lower rate.But it could also come with higher list prices as more people enter a market with a limited pool of homes available to buy. Homeowners would also have an advantage on bidding compared to a new buyer who is working with today’s rates with more wiggle room in their budgets.“Anyone able to ‘port’ a 3% mortgage into a new purchase would effectively be bidding with cheap financing in a 6% world. That added purchasing power would push prices up, while renters and mortgage-free owners would still face today’s higher rates—only now with even higher list prices,” Jake Krimmel, a senior economist at Realtor.com, wrote in an analysis.Portable mortgages could also disrupt the U.S. mortgage system and lead to higher rates. Mortgage-backed securities, groups of mortgages that lenders sell to investors, would have their pricing models blown up and create more risk for investors as less loans are paid off early with more homeowners taking them with them when they move.Pulte has also said officials are evaluating a plan to offer 50-year mortgages and how to make mortgages assumable, where homebuyers could take over a seller’s preexisting loan. Assumable mortgages are already available in the U.S. but are rarely used because they require a large cash payment or a second mortgage at current rates.The 50-year mortgage could lower monthly payments by stretching out the term of the loan but would also likely come with higher rates and would ultimately cost buyers more in interest over the life of the loan and make it take longer to build equity.The administration’s efforts to lower housing costs come as an increasing slice of Americans are being priced out of the market altogether with elevated mortgage rates and consistently growing list prices. Home values have climbed significantly compared to before the pandemic for both new and existing homes amid a lack of sufficient supply.A shortage of homes is widely seen as the biggest issue when it comes to tackling housing affordability in the United States. Construction cratered in the aftermath of the 2008 financial crisis and has struggled to recover to a sufficient level to meet the demand.Housing starts have slumped in 2025 as builders confront cost challenges and a stalled market. Higher rates are also a challenge for construction, which is also impacted by the rising cost of labor and materials.Tariffs have been a double blow for builders, as the uncertainty around them has chilled activity in the housing market and broader economy. Import taxes have also increased the cost of materials used to build homes, making it more expensive for builders to start and complete projects.Tariffs that went into effect last month imposed a 10% tax on all timber and lumber imports, along with a 25% tariff on kitchen cabinet and furniture. The U.S. imports about one-third of its lumber, primarily from Canada, that are also subject to further tariffs.Trending51-year-old man arrested following attempted abduction at Traverse City Meijer parking lotGRAND TRAVERSE COUNTY, Mich,. (WPBN/WGTU) - - A 51-year-old Benzie County man was arrested Saturday following an attempted abduction that was reported at the MWoman, 73, dies after being hit by two cars near US-31 and Hoadley Road Sunday eveningBENZIE COUNTY, Mich., (WPBN/WGTU) -- A woman, 73 of Benzonia, is dead after being hit by two cars near US-31 and Hoadley Road Sunday evening, November 23, accorLake Michigan's water levels drop rapidly, raising concerns about climate impactGREAT LAKES, Mich., (WPBN/WGTU) -- If you’ve driven along the Lake Michigan shoreline recently, you’ve probably noticed low water levels. While we’re not at his'A horrific situation': MSP asks for public's help with video evidence in abduction caseGRAND TRAVERSE COUNTY, Mich,. (WPBN/WGTU) - - Michigan State Polcie are investigating an attempted abduction that occurred Sunday morning at a gas station in TrMSP seek publics help: Driver flees scene after plow dislodges from truck, crash on US-10The Michigan State Police Hart Post is asking for the public's assistance in identifying a driver involved in a crash on Nov. 22, 2025.Around 8:16 p.m., a whitNEWS IN PHOTOS:\"Local\"3'A horrific situation': MSP asks for public's help with video evidence in abduction case3Traverse City community gathers for vigil honoring collective grief and loss6MSP seek publics help: Driver flees scene after plow dislodges from truck, crash on US-106U.S. Coast Guard marks 50 years since Edmund Fitzgerald sinkingACCESSIBILITYDownload Our Mobile Apps:Terms & ConditionsCopyright NoticesEEO Public File ReportWPBN FCC Info WPBN FCC ApplicationsWGTU FCC InfoWGTU FCC ApplicationsWGTQ FCC InfoWGTQ FCC ApplicationsWTOM FCC InfoWTOM FCC ApplicationsPublic File AssistanceContact WPBN/WTOMContact WGTQ/WGTUNews TeamCareersContestsNewsWeatherSportsGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1668, "success": true}