{"full_text": "Stay informed \nSign up to our free newsletter to get the latest news delivered straight to your inbox. \n \n    \n  \n Sign up    \n \n \n     \n     \n  \n \n  Close   \n\nDonate \nSubscribe \nAdvertise \nSign In  \n  Search for:   \n   Search     \n\nNEWSLETTER \nARTS & ENTERTAINMENT \nBALTIMORE \nBUSINESS \nAFRO Events \nINTERNATIONAL \nNATIONAL \nPG COUNTY \nSPORTS \nWASHINGTON D.C. \n#WORDINBLACK    \n\nLatest \nNational \nInternational \nBaltimore \nWashington \nPrince George’s \nOpinion \nContact \nAFRO Events    \n\nFacebook Page \nTwitter Username \nInstagram \nLinkedin \nYouTube    \n \n  Close  \n\n\nSubscribe \nDonate \nNewsletter \nARTS & ENTERTAINMENT \nBALTIMORE \nBUSINESS \nINTERNATIONAL \nNATIONAL \nPG COUNTY \nSPORTS \nOPINION \nWASHINGTON, DC \n#WORDINBLACK \n\n\nAbout Us \nAdvertise \nAFRO Mall \nContact Us \nEvents \nFrequently Asked Questions \nJobs \nNewsletter   \n Skip to content  \n \n \n    \n  \n\nLatest \nNational \nInternational \nBaltimore \nWashington \nPrince George’s \nOpinion \nContact \nAFRO Events    \n  \n\nFacebook Page \nTwitter Username \nInstagram \nLinkedin \nYouTube      \n \n \n  \n \nAFRO American Newspapers \n The Black Media Authority    \n \n  \n\nDonate \nSubscribe \nAdvertise \nSign In    \n  Menu   Sign In    \n \n \n  \n\nNEWSLETTER \nARTS & ENTERTAINMENT \nBALTIMORE \nBUSINESS \nAFRO Events \nINTERNATIONAL \nNATIONAL \nPG COUNTY \nSPORTS \nWASHINGTON D.C. \n#WORDINBLACK    \n \n  Open Search     \n \n  Search for:   \n   Search          \n \n  \n \n  \n   \n \n \n Breaking  \n \n \nASALH leads resistance to attacks on Smithsonian and U.S. history \n August 21, 2025August 22, 2025         \n    Posted inMaryland News \n Maryland’s housing order aims to boost affordable housing, cut barriers  \n \n by Capital News ServiceOctober 17, 2025  \n\n\nShare this:\n\n\n Click to share on Facebook (Opens in new window) Facebook \n Click to share on X (Opens in new window) X \n   \n  \n \n \n \n \n \n \n \n \n         \n \n \n \n One-time  \n Monthly  \n Annually   \n   One-time  \n \n   $9   \n   $20   \n   $90   \n   Other   Donation amount  \n  $       \n   Monthly  \n \n   $7   \n   $15   \n   $30   \n   Other   Donation amount per month  \n  $       \n   Annually  \n \n   $84   \n   $180   \n   $360   \n   Other   Donation amount per year  \n  $         \n Your contribution is appreciated.  \n Donate Now    \n  \n     \n  \n \n \nBy Sandra Smith\nCapital News Service \nGov. Wes Moore signed an executive order on Sept. 3 aimed at tackling Maryland’s escalating housing affordability crisis. The Housing Starts Here initiative seeks to expedite housing development, reduce production delays and make home ownership more accessible across the state. \n\nEarning enough to buy a home? See the divide across Maryland counties. Credit: Courtesy of Capital News Service \n \n \nSign up for our Daily eBlast to get coverage on Black communities from the media company who has been doing it right for over 132 years. \n \n    \n  \n Sign up    \n \n \n      \nAccording to the Maryland Department of Housing and Community Development (DHCD), the state faces a deficit of around 96,000 housing units – a gap that has been widening over recent years.  \nThe 2025 Maryland Housing Needs Assessment, an analysis of Maryland’s housing gap conducted by DHCD and The National Center for Smart Growth, reveals significant disparities in housing availability across the state. Counties like Montgomery and Howard have median home prices exceeding $600,000, making homeownership unattainable for low- and middle-income residents.  \nConversely, areas such as Allegany and Wicomico counties report median home prices below $200,000, which indicates regional inconsistencies in the Maryland housing market.  \n\nMapping Maryland’s housing crisis. Credit: Courtesy of Capital News Service \nThe executive order will broadly target each county in Maryland in order to create more housing development throughout the state.  \n \n \n   \n \n \n   \n“ says that everybody has a piece of the housing crisis, and everybody deserves for their local and state governments to be working in concert to solve that crisis,” DHCD Secretary Jake Day said.  \nIn more than half of Maryland counties, renters are spending more than one-third of their annual income on housing costs, which is considered unaffordable by federal standards.  \nWhile Maryland’s median income is 28 percent higher than the national median, the state’s median home price is 35 percent higher, highlighting the disproportionate cost of housing.  \n“How we got here is really the post-2008 financial crisis. It was real-estate driven… that had to do with risks that the financial industry took at the time,” Secretary Day said. “It led to a collapse in the economy, in residential home values and more. The over-correction of the market meant we stopped building houses at a pace that matched population growth.”  \n \n \n   \n\nMaryland homes cost 35 percent more than the national average. Credit: Courtesy of Capital News Service \nThe Housing Starts Here Executive Order directs state agencies to identify underutilized state-owned properties suitable for transit-oriented development, aiming to increase housing density in areas with existing infrastructure.  \nTransit-oriented development is a strategy that promotes dense, mixed-use communities around transit to help increase ridership and the use of public transportation.  \n“There are a lot of benefits to it… . We want to develop state-owned land for transit-oriented development, since state-owned land is not currently taxable. There’s no revenue generation for the states or local jurisdictions. It also provides an opportunity for Marylanders to live closer to transit and use it more,” Maryland Department of Transportation’s Chief of Real Estate and Transit-Oriented Development David Zaidain said. \nAccording to Zaidain, transportation is the second biggest household budget item behind housing. It costs roughly $600 a month for Marylanders to own a car, which is pushing the state towards more transit usage.  \n \n \n   \nZaidain also noted the climate change benefits that come with transit-oriented development.  \nThe executive order directs the state to speed up timelines for housing permits and establish a state housing ombudsman, or overseer, to help projects move forward.  \nThe legislation comes on the heels of a 2024 legislative package that made housing more affordable and accessible for Marylanders struggling with construction barriers, along with creating the Office of Tenant and Landlord Affairs.  \n\nProjected housing units fall short of Maryland’s 2045 goal. Credit: Courtesy of Capital News Service \nThe Housing Starts Here order also directs agencies to track housing production progress annually, coordinate with local governments to address regional shortages and ensure accountability across jurisdictions.  \n \n \n   \nBy centralizing oversight and removing barriers, the administration aims to close the housing deficit and expand affordable options for Marylanders in the years ahead.  \n“When regulatory processes add cost, that cost has to be recouped – either with higher rents or a higher sales price. So, the more regulatory burden we place, the more likely it is that we’re just producing expensive for people to live,” Secretary Day said. “By cutting time and money out of the process, by streamlining it, we can make it easier to get to the finish line.” \n \n  \nRead what we will cover next! \n132 years ago we were covering Post-Reconstruction when a former enslaved veteran started the AFRO with $200 from his land-owning wife. In 2022 we endorsed Maryland’s first Black Governor, Wes Moore. And now we celebrate the first Black Senator from Maryland, Angela Alsobrooks! \n \nKeep Our Tradition Going  \n \n         \n \n \n \n One-time  \n Monthly  \n Annually   \n   One-time  \n  Donation amount  \n  $      \n   Monthly  \n  Donation amount per month  \n  $      \n   Annually  \n  Donation amount per year  \n  $        \n Your contribution is appreciated.  \n Donate Now       \n Tagged: Allegany County, Gov. Wes Moore, Howard County, Maryland counties, Maryland Department of Transportation, Montgomery County, Wicomico County   \n \n \n Leave a comment   \n Cancel reply\nYou must be logged in to post a comment.    \n  \n \n     \nLatest \n \n Maryland protestors say ‘Hands Off’ social security, education, federal jobs and more April 5, 2025  \n Members of the Congressional Black Caucus condemn U.S. president’s address in joint session of Congress as ‘misleading’ and ‘divisive’ March 5, 2025  \n PNC Ranked as one of America’s Best Employers For Veterans November 11, 2024  \n Gilchrist’s commitment: Bridging the gap in hospice care for minority communities November 11, 2024  \n Car Buying in 2024 – How to Prepare November 11, 2024  \n United Way’s ALICE campaign highlights challenges for working families in Maryland October 20, 2024  \n Which savings strategy works for you? October 20, 2024  \n United Way’s Women United Group Amplifies, Advances, and Advocates Change in Childcare September 23, 2024  \n Meet Germano Gomez, Managing Director of The Harbor Bank of Maryland Community Development Corporation September 23, 2024  \n 8 Tips to Stay Safe from Scams September 20, 2024  \n Demystifying Postpartum Depression April 24, 2024  \n Editorial: The right to vote is on trial… again October 22, 2025  \n Man pardoned after storming Capitol is charged with threatening to kill Democratic Leader Hakeem Jeffries October 21, 2025  \n The AFRO Named Among the Nation’s Top Black News Outlets on Two Feedspot Lists October 21, 2025  \n Funding shift boosts HBCUs but cuts support for other minority-serving colleges like the University of Baltimore October 21, 2025  \n African American sorority makes history again with first chapter in Puerto Rico October 21, 2025  \n Journalists turn in access badges, exit Pentagon rather than agree to new reporting rules October 21, 2025  \n Former NFL player Doug Martin died after struggling with officers while being detained, police say October 20, 2025  \n Why should Black radicals care about the Louisiana Supreme Court case regarding voting rights? October 20, 2025  \n Free Halloween weekend Lyft rides throughout Greater Washington prevent drunk driving October 20, 2025  \n Millions march in ‘No Kings’ protests nationwide October 20, 2025  \n Malcolm X meets Shakespeare in revisioning of ‘The Tragedy of Julius Caesar’ at D.C.’s Folger Theatre  October 20, 2025  \n Corey Jackson endorses Proposition 50 to strengthen democratic processes and protect Black representation in California October 20, 2025    \n \n      \n \n  \n \n \n   \n \n \n   \n\nFacebook Page \nTwitter Username \nInstagram \nLinkedin \nYouTube     \n \n \nAbout Us \n\nThe AFRO knows what it’s like to endure challenging times. John H. Murphy, Sr., a former enslaved man founded the AFRO in 1892 with $200 from his wife, Martha Howard Murphy. Together they created a platform to offer images and stories of hope to advance their community. The AFRO provides readers with good news about the Black community not otherwise found. \nLearn More  \nContact \n\nBaltimore, MD Office\n 233 E. Redwood Street Suite 600G\n Baltimore, MD 21202 \nWashington, DC Office\n Uline Arena Building\n 1140 3rd St., 2nd Flr, NE\n Washington, DC 20002 \nVoice: 410-554-8200 \nEmail: customerservice@afro.com  \nMore\n\n\nAbout Us \nContact Us \nAdvertise \nPolicies \nSubscribe \nMy Account \nFAQs \nAFRO Mall    \n \n © 2025 The Black Media Authority  Powered by Newspack        \n \n \n \n \nSign in \n Close    \n \n \n    \n   \n  \n \n \n \n  Sign in with Google  \n Or       \n Enter the code sent to your email.  \n \n Email address    \n   \n Enter your password   \n \n   \n Sign in by entering the code we sent to , or clicking the magic link in the email.  \nContinue \nResend code \nEmail me a one-time code instead Forgot password \nCreate an account \nSign in to an existing account \nGo back  Continue Set a password (optional)   \n \n By signing up, you agree to our Terms and Conditions. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.        \n                                                                                          \n \n \n  \nComplete your transaction \n Close", "extraction_method": "jina", "word_count": 1664, "success": true}