{"full_text": "City of Reno launches new housing dashboard to track local needs and affordability gaps | Local News | 2news.com\nSkip to main content\nYou have permission to edit this article.\nEdit\nClose\nSite search\nSearch\nHome\nAbout Us\nContact Us\nDigital FAQ\nClosed Caption Concerns\nDo Not Sell My Information\nKTVN EEO Report\nFCC Public Inspection File - KTVN\nWatch\nTop Videos\nLatest Newscast\nLatest Forecast\nNews\nSubmit News\nNews Links\nLocal News\nNevada News\nNevada Legislature\nHomeless Nevada\nCalifornia News\nNational News\nWorld News\nCampaign 2024\nMeet The Team\nWeather\n2 Plus You Nevada\nCommunity\nEntertainment\nFamily\nFood\nPlus You\nLocal Events\nSports\nHigh School Sports\nReno Aces\nWolf Pack Football\nWolf Pack Baseball\nWolf Pack Basketball\nWolf Pack Softball\nJ K Metzker\nFeatures\nHealth Watch\nAsk the Doctor\nSomeone 2 Know\nFace the State\nYour 2 Cents\nAdventures with Jeff\nNevada Backroads\nWhat the Tech\nPie Champion Awards\nContests\nBusiness Directory\nWhat's On\nJoin Our Team!\nPhoto Galleries\nFacebook\nTwitter\nLinkedIn\nYouTube\nInstagram\niOS App\nAndroid App\nMeet The Team\nBusiness Directory\nContact Us\nNews Links\nJoin Our Team\nSubmit News\nFacebook\nTwitter\nLinkedIn\nYouTube\nInstagram\nMobile Apps\niOS App\nAndroid App\nMenu\nSearch\nOpen user controls\nLog In Using Your Account\nLog In\nDon't have an account? Sign Up Today\nMy Account\nDashboard\nProfile\nSaved items\nLogout\nSite search\nSearch\n44°\nNews\nWatch\nWeather\nSports\nHealth Watch\nThings 2 Do\nFeatures\n2 Plus You Nevada\nShare This\nFacebook\nTwitter\nWhatsApp\nSMS\nEmail\nSHARE YOUR CHRISTMAS 19 DAYS TO GO...\nFeatured Top Story\nCity of Reno launches new housing dashboard to track local needs and affordability gaps\n2 News Nevada Digital Team\nOct 1, 2025\nOct 1, 2025\nUpdated\nOct 1, 2025\nFacebook\nTwitter\nWhatsApp\nSMS\nEmail\nCity of Reno launches housing dashboard website\nThe new dashboard has a new interactive tool that provides data on Reno's housing needs both now and over the next 10 years.\nShow more\nShow less\n0:42\nFacebook\nTwitter\nWhatsApp\nSMS\nEmail\nPrint\nCopy article link\nSave\nFacebook\nTwitter\nWhatsApp\nSMS\nEmail\nPrint\nCopy article link\nSave\nThe City of Reno has launched a new interactive housing dashboard aimed at providing residents and decision-makers with up-to-date information on housing needs, affordability, and trends.Unveiled during Housing America Month, the tool is part of the Reno City Council’s broader effort to address the region’s ongoing housing challenges.“I hear from residents every day about how challenging the housing market has become, and that’s why this dashboard is such an important tool,” said Reno Mayor Hillary Schieve. “Our Council is looking forward to using these new insights to make meaningful decisions to help address our community’s housing needs.”The dashboard reflects data from the recently completed 2025 Housing Needs Assessment and will be updated regularly. It highlights how many homes are needed, what types of housing are being built, and includes benchmarks for both renters and homeowners.It also features demographic insights, including household income, household size, and preferences for housing types like apartments, condos, townhomes, or single-family homes.Reno City Manager Jackie Bryant and Housing Manager Elaine Wiseman explain the tool’s features in a new informational video available on the City’s website and social media pages.“We’re excited to launch this new housing dashboard, which gives our team a clearer, more accurate picture of Reno’s housing market across all income levels and the gaps that exist,” said Bryant. “This dashboard represents a significant step forward in the City’s ongoing commitment to working with our partners to expand housing opportunities for the Biggest Little City.”Since 2016, home prices in Reno have increased by 93 percent. According to the dashboard, at least 15,000 new homes are needed over the next 10 years, including 9,000 units considered affordable for households earning below 80 percent of the area median income.Currently, a household earning $50,000 annually can afford a monthly rent of around $1,250. The dashboard also shows a growing need for home ownership opportunities with monthly mortgages ranging from $2,500 to $3,750.The City encourages residents, housing partners, and stakeholders to explore the dashboard, which is available on the Housing and Neighborhood Development section of the City of Reno’s website.\nNews Nevada Top stories\nMulti-car crash slows cars during morning commute on I-80 east in Sparks\nIncident slowing traffic on I-580 southbound near East Moana Lane\nCalmer weather with above average temps this holiday week\nFacebook\nTwitter\nWhatsApp\nSMS\nEmail\nPrint\nCopy article link\nSave\nTags\nDashboard (computing)\nSocial Issues\nEconomy\nHousing\nResidential Buildings\nPolitics\nUrban, Rural, And Regional Economics\nWatch 2 News\nMost Popular\nArticles\nVideos\nArticlesMulti-car crash slows cars during morning commute on I-80 east in SparksReno coffee shop celebrates first anniversaryOne dead, several injured in Sunday crash on U.S. 50 near Camp SacramentoWhat trends Reno shoppers are noticing while shopping for ThanksgivingPalisades Tahoe delays season openingTraffic slows on US-395 northbound near Golden Valley as crews respond to incidentMan who went missing last week found safe, Reno Police sayInvestigation underway after two cars caught fire on Kietzke LanePolice response on Bella Court leads to unexpected turn inside a Reno homeIncident slowing traffic on I-580 southbound near East Moana Lane\nVideos\nSections\nHome\nNews\nSports\nLive Stream\nWeather\nMeet The Team\nContests\nBusiness Directory\nThings 2 Do\nOnline Features\nRequest a Copy of a News Story\nServices\nPay My Bill\nFCC Public Inspection File\nFCC Applications\nKTVN Advertising Terms & Conditions\nKTVN EEO Report\nFCC Public File Help\nDo Not Sell or Share My Info\nDigital FAQ\nClosed Caption\nSearch\nPrivacy Policy\nTerms of Use\nContact Information\n2News.com\n4925 Energy Way\nReno, NV 89502\nPhone: 775-858-2222\nEmail: Producers@ktvn.com\nFacebook\nTwitter\nLinkedIn\nYouTube\nInstagram\nMobile Apps\niOS App\nAndroid App\n×\nBrowser Compatibility\nYour browser is out of date and potentially vulnerable to security risks.We recommend switching to one of the following browsers:\nMicrosoft Edge\nGoogle Chrome\nFirefox\n© Copyright 2025\nKTVN\n4925 Energy Way, Reno, NV\n| Terms of Use\n| Privacy Policy\nPowered by BLOX Content Management System from BLOX Digital.\nNotifications\nSettings\nYou don't have any notifications.\nGet up-to-the-minute news sent straight to your device.\nTopics\nBreaking News\nSubscribe", "extraction_method": "beautifulsoup", "word_count": 1007, "success": true}