{"full_text": "Zillow, Redfin sued by Washington over alleged rental listing monopoly dealNewsNewsWhy did BP's detection system fail to identify the pipeline leak promptly?Two weeks after an oil pipeline leak was first discovered, neither its operators nor regulators say they’re any closer to figuring out what caused it or how bigChanging weather conditions will impact Cascade mountain pass travel through ThanksgivingAs Thanksgiving travel gets underway, drivers should prepare for changing weather conditions over the mountain passes.Patchy morning fog and snowy conditions aPipeline leak disrupts SEA Airport travel as Thanksgiving rush beginsCrews are racing to repair a leaking oil pipeline that supplies jet fuel to SEA Airport, just as Thanksgiving travel reaches its peak. Gov. Ferguson appoints civil rights attorney Colleen Melody to state Supreme CourtFerguson made the announcement on Monday at the Temple of Justice.LocalBusinessOffbeatVideosTechQuestion of the DayProject SeattleConnect to CongressOperation Crime & JusticePoliticsAmazing AmericaInside Your WorldArmstrong Army StrongConsumerEric's HeroesDon't MissFor Pet's SakeEarthquakeSinclair CaresBeyond the PodiumNation & WorldEntertainmentSpotlight on AmericaFull Measure with Sharyl AttkissonCrisis in the ClassroomElectionsKOMO AnniversaryHelping Kids in CrisisHome of the BraveARC SeattleMy IndiaBack to SchoolWeatherCurrent WeatherSeattleShowers Late45F43/39Today43/39Tuesday43/42Wednesday49/46Latest WeathercastLatest WeathercastRadarSatelliteMapsSchool DelaysWeather FAQKOMO CamsHurricane TrackerSeattle Weather HistoryRefinedRefinedWhy did BP's detection system fail to identify the pipeline leak promptly?Two weeks after an oil pipeline leak was first discovered, neither its operators nor regulators say they’re any closer to figuring out what caused it or how bigChanging weather conditions will impact Cascade mountain pass travel through ThanksgivingAs Thanksgiving travel gets underway, drivers should prepare for changing weather conditions over the mountain passes.Patchy morning fog and snowy conditions aPipeline leak disrupts SEA Airport travel as Thanksgiving rush beginsCrews are racing to repair a leaking oil pipeline that supplies jet fuel to SEA Airport, just as Thanksgiving travel reaches its peak. Gov. Ferguson appoints civil rights attorney Colleen Melody to state Supreme CourtFerguson made the announcement on Monday at the Temple of Justice.Game CenterGame CenterDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchChime InWatchLiveNow45°Tue43°Wed49°SearchSearchUser IconWatchSearchNewsDown ArrowLocalBusinessOffbeatVideosTechQuestion of the DayProject SeattleConnect to CongressOperation Crime & JusticePoliticsAmazing AmericaInside Your WorldArmstrong Army StrongConsumerEric's HeroesDon't MissFor Pet's SakeEarthquakeSinclair CaresBeyond the PodiumNation & WorldEntertainmentSpotlight on AmericaFull Measure with Sharyl AttkissonCrisis in the ClassroomElectionsKOMO AnniversaryHelping Kids in CrisisHome of the BraveARC SeattleMy IndiaBack to SchoolWeatherDown ArrowWeather HomeRadarSatelliteMapsSchool DelaysWeather FAQKOMO CamsHurricane TrackerSeattle Weather HistoryRefinedGame CenterDown ArrowGame Center HomeDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchChime InMoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsTrafficDown ArrowTraffic HomeTraffic MapPodcastsDown ArrowInside The ArenaThe End ZoneHard TurnNewsletter Sign UpTVDown ArrowTV HomeContact KOMO NewsWhat's On TVPeopleContests & Community EventsHotlinksEQC Puzzle of the NightCareersRules ArchiveSTEMPartner SpotlightHealth BreakNextGen TVLiveDown ArrowLive HomeKOMO 4 NewsHealthworksObituariesSports Down ArrowSports\nHomeSeahawksMarinersSoundersStormHuskiesCollegeSeattle KrakenTorrentTICKETSNiko's Sports ZoneCity GuideSend a TipLegalDown ArrowTerms & ConditionsCopyright NoticesEEO Public File ReportFCC Info (KOMO-TV)FCC Applications (KOMO-TV)FCC Info KUNSFCC Applications KUNSPublic File AssistanceContact KOMO NewsNews TeamCareersConteststwitter iconfacebook iconACCESSIBILITYArmstrong Williams Town HallArmstrong Williams takes on the news of the week and asks the questions you want answered. Don’t miss our weekly town hall!WATCHClose11Please ensure Javascript is enabled for purposes of website accessibilityZillow, Redfin sued by Washington over alleged rental listing monopoly dealby KOMO News StaffWed, October 1, 2025 at 3:57 PM3VIEW ALL PHOTOSA Redfin real estate yard sign is pictured in front of a house on October 31, 2017 in Seattle, Washington. (Photo by Stephen Brashear/Getty Images for Redfin)Comment on this story10CommentShare storySharetopics: ZillowRedfinLawsuitAntitrustRental listingsCompetitionHousing crisisAttorneys generalSEATTLE, Wash. — Attorneys general in Washington and four other states filed an antitrust lawsuit Wednesday, accusing real estate giants Zillow and Redfin of illegally colluding to dominate the online rental advertising market, potentially harming renters amid a growing housing crisis.The lawsuit alleges the companies violated federal antitrust laws by striking a $100 million deal earlier this year that effectively removed Redfin as a competitor in the online listings market for multifamily rental properties.SEE ALSO | Here's how much you need to make to 'comfortably afford' a Seattle home“Amid a housing crisis in Washington, ensuring robust competition in rental advertising is vital,” Washington Attorney General Nick Brown said in a statement. “Enforcing our antitrust laws to keep the marketplace fair, protect consumers, and prevent companies from building monopolies is a priority for our office.”According to the complaint, Seattle-based Zillow paid Redfin, also headquartered in Seattle, $100 million to exit the rental listings business for properties with 25 or more units. Redfin agreed to transition clients to Zillow, incentivize its own sales staff to do the same, and display only Zillow's listings for large rental properties on its platforms.Prosecutors say this deal allowed Zillow to solidify its position as the dominant player in the multifamily rental listings market—at the expense of competition and consumer choice. Shortly after the agreement, Redfin reportedly laid off around 450 employees and shut down its rental listing operations.Attorneys general from Arizona, Connecticut, New York, and Virginia joined Washington in filing the suit. They allege the companies violated both the Sherman Antitrust Act and the Clayton Act by unlawfully eliminating competition and engaging in an anti-competitive acquisition.SEE ALSO | Amid housing affordability troubles, nearly 60% of young adults are 'rent burdened'The lawsuit seeks a court order to unwind the agreement and restore competition in the online rental marketplace.The Federal Trade Commission also filed a related complaint against Zillow and Redfin in the same court.According to the lawsuit, Zillow began building its rental listings platform in the 2010s and expanded aggressively through acquisitions of rival platforms like HotPads and Trulia. Redfin, which entered the rental listing market in 2021 by acquiring RentPath—owner of Rent.com, ApartmentGuide.com, and Rentals.com—had competed fiercely until the two companies struck the deal in early 2025.Comment with BubblesREAD THE COMMENTS (10)As of Wednesday, neither Zillow nor Redfin had issued a public response to the lawsuits.TrendingWashington state crackdown uncovers 41 unlicensed contractors in two-day operationIn a sweeping two-day enforcement operation, the Washington State Department of Labor & Industries (L&I) uncovered 41 cases of unlicensed contractors. Teen out on bond arrested for car thefts using cloned key fobAn 18-year-old Tacoma man was arrested by the Renton Police Department for several charges surrounding two car thefts.Washington State AG secures legal win over Trump plan to dismantle key federal agenciesIn a significant legal victory, the Washington State Attorney General's Office has successfully protected four federal agencies from elimination. Seattle teen arrested for violent attack on 80-year-old man during graffiti confrontationSeattle police have arrested a 17-year-old boy in connection with the assault of an elderly man who confronted him during an incident of graffiti vandalism.Olympic Pipeline shutdown hits day 6, crews race to find leak source amid holiday travelIt's been six days since the Olympic Pipeline in Snohomish County shut down, and crews are still working around the clock to determine a source of the leak.NearNEWS IN PHOTOS:\"Local\"9Why did BP's detection system fail to identify the pipeline leak promptly?7Changing weather conditions will impact Cascade mountain pass travel through Thanksgiving9Pipeline leak disrupts SEA Airport travel as Thanksgiving rush begins3Gov. Ferguson appoints civil rights attorney Colleen Melody to state Supreme CourtACCESSIBILITYDownload Our Mobile Apps:Terms & ConditionsCopyright NoticesEEO Public File ReportFCC Info (KOMO-TV)FCC Applications (KOMO-TV)FCC Info KUNSFCC Applications KUNSPublic File AssistanceContact KOMO NewsNews TeamCareersContestsNewsWeatherSportsHealthWorksTrafficLiveGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1168, "success": true}