{"full_text": "Small lot development can help solve the housing affordability crisis\nBy\nEdward J. Pinto\nFacebookTwitterEmailPrint\nNovember 12, 2025 10:23 am\nFacebookTwitterEmailPrint\nThe United States has an estimated 33,338 zoning jurisdictions, each of which has the power to constrain housing supply and drive up costs. Their authority flows from the states, which, under the 10th Amendment, have the power to enact zoning and land-use regulations. By contrast, the federal government’s power over state and local zoning and land use actions is limited under the Constitution.\nMuch of what the federal government does is in the form of housing subsidies and bureaucracy. The Department of Housing and Urban Development’s fiscal 2026 budget is $89 billion, with the Low-Income Housing Tax Credit costing another $15 billion annually. Since HUD was established in 1965, it has spent trillions, yet housing remains scarce and unaffordable.\nRecommended Stories\nMamdani is a warning for Western civilizationWhat everyone got wrong about Bill Gates's climate memoTrump can make Big Tech great again\nIt is a common misconception that developers prefer building big homes on large lots because they yield higher profits. In reality, local zoning codes and minimum lot size requirements largely dictate the size of a house and the size of the lot it sits on, not market preferences.\nMEDIAN AGE OF US HOMEBUYER RISES TO 40, A RECORD\nThe American Enterprise Institute Housing Center examined the nearly 11 million single-family detached and 1.1 million single-family attached homes built in new residential subdivisions across the nation from 2000 to 2024 and found that the SFD and SFA lot sizes averaged about 8,000 square feet and 1,900 square feet, respectively. Then we asked a simple question: what if we changed one variable and made those lots smaller? If SFD and SFA lot sizes averaged roughly 5,000 square feet and 1,900 square feet, respectively, and 20% of the SFD lots were used instead for SFA homes, the same amount of land would have yielded 400,000 more homes annually, and the median sales price would have been $66,000 lower.\nOur conclusion is simple: The three most important things for housing supply and affordability are smaller lots, smaller lots, smaller lots. To get all 50 states on board, we suggest repurposing 10% or $8.9 billion of HUD’s annual budget as a bounty for small lot single-family construction. This would be enough to provide bounties averaging $35,000 per lot on 250,000 small lot single-family homes per year. The states would be paid for performance — the laboratory of the states would determine how to accomplish this. The private sector would be happy to build on these smaller lots, and the households needing more affordable homes to grow families would benefit. The “Not in My Backyard” generation would have the opportunity to have grandchildren.\nHere’s how it might work. A $25,000 bounty would be paid for each new style of home that meets the square feet requirement and is platted or subdivided on or after January 2026 — SFD homes on 5,000 square feet or less, SFA homes on 2,000 square feet or less, and duplex, triplex, or quadplex built on a new lot of 6,000 square feet, 8,000 square feet, and 10,000 square feet or less respectively.\nSHOULD THE FEDERAL GOVERNMENT GRADE EVERY STATE AND CITY ON ITS ZONING RULES?\nFor new lots within 5 miles of a new manufacturing site certified by the U.S. Department of Commerce to create 500 or more jobs from 2025 to 2030, another $25,000 would be paid on each new SFD or attached home that meets the above requirements. An additional $25,000 bounty to be paid for each new SFD or attached home meeting the above requirements and built on land purchased from the federal government. A maximum of two bounties should be paid per lot.This program would enlist the combined efforts of all levels of government to “Make Starter Homes Great Again.” Economic development needs these homes — they are where jobs go to sleep at night.\nEdward J. Pinto is a senior fellow and codirector of the American Enterprise Institute’s Housing Center, where he focuses on housing risk and mortgage markets.\nTagsAmerican Enterprise InstituteCommerce DepartmentConstructionDepartment of Housing and Urban DevelopmentHousingSubsidiesThink Tanks\nRelated Content\nDemocrats just want men for their votes\nDemocrats should be wary of the redistribution rabbit hole\nAfghan service of US reaches back to Civil War\nMamdani is a warning for Western civilization\nIndoctrination is systemic in America’s universities\nWhat everyone got wrong about Bill Gates’s climate memo\nTrump can make Big Tech great again\nLife over death: One baby’s story resurfaces a cultural divide\nRelated Content\nWashington Commanders select lead architect for stadium design\nNews\nCentrist Democrats warn against rise of partisanship in Congress after backing deal to end shutdown\nHouse\nReturn to normal? What happens now that longest-ever government shutdown is over\nNews\nTrump shifts on economy to ‘We feel your pain’\nWashington Secrets\nAT&T class action lawsuit: How to receive your share of the $177 million settlement\nNews", "extraction_method": "beautifulsoup", "word_count": 828, "success": true}