{"full_text": "Median age of US homebuyer rises to 40, a record\nBy\nZach Halaschak\nNovember 4, 2025 11:44 am\nFacebookTwitterEmailPrint\nAdd Washington Examiner on Google\nFacebookTwitterEmailPrint\nThe median age of first-time homebuyers has risen to 40, the highest it has ever been, a sign of the growing problem the United States has with housing affordability.\nNot only has the age of first-time homebuyers broken records, but the share of first-time home buyers dropped to a record low of 21%, the National Association of Realtors reported, based on a survey of transactions from July 2024 through June.\nSHOULD THE FEDERAL GOVERNMENT GRADE EVERY STATE AND CITY ON ITS ZONING RULES?\nThe data released on Monday shows how challenging it has become for younger people to purchase a home and take on a mortgage.\n“The historically low share of first-time buyers underscores the real-world consequences of a housing market starved for affordable inventory,” said Jessica Lautz, NAR’s deputy chief economist and vice president of research. “The share of first-time buyers in the market has contracted by 50% since 2007 – right before the Great Recession.”\nLautz described the implications for the housing market as “staggering,” as today’s first-time homebuyers will be building less housing wealth over their lifetimes and will likely have fewer housing moves as a result.\nThe Tuesday report also found that the median age for all homebuyers is 59 — near the retirement age.\nThe housing market and troubles with housing affordability and supply have been a top economic issue, particularly after inflation surged following the pandemic and caused the Federal Reserve to hike interest rates, which caused mortgage rates to soar.\nAs of Tuesday morning, the average rate on a 30-year, fixed-rate mortgage was 6.17%, according to Freddie Mac, which tracks rate changes. That is down from a peak above 7% around the start of the year, but is much higher than the ultra-low levels notched in the pandemic.\nNotably, there hasn’t been a release on the state of new home sales since September because the government shutdown has halted the release of Census Bureau data. But there was an uptick in sales in August, which is a bit of welcome news for the real estate industry.\nNew home sales rose 20.5% in August to an 800,000 annual rate, according to the most recent report from the Census Bureau. The number of new home sales is 15.4% higher than in August 2024.\nAlso, existing home sales rose 1.5% in September, according to the most recent report by the NAR.\nHomebuyers have confronted a difficult reality over the past few years. That is because the median sales price of homes has remained high even as mortgage rates rose, representing a double whammy for housing affordability.\nLawmakers have pushed for action on the housing front. For instance, last month, the Senate passed bipartisan housing legislation authored by Senate Banking Committee Chairman Tim Scott (R-SC) and the top Democrat on the panel, Massachusetts Sen. Elizabeth Warren (D-MA).The bill, the ROAD to Housing Act of 2025, would rework the federal government’s role in housing and focus on building out the housing supply, which would help with affordability.\nThe Fed has begun to lower interest rates, which has been another source of relief for homebuyers.\nFED RATE CUTS COULD BRING HOUSING RELIEF SOUGHT BY TRUMP\nPresident Donald Trump has frequently criticized Fed Chairman Jerome Powell for holding interest rates so high because the higher rates can make it more expensive to buy a home or finance a car.\nIn July, Trump criticized Powell for keeping interest rates high, making it “difficult for people, especially the young, to buy a house.”\nTagsBusinessEconomyFederal ReserveHousingPricesReal EstateTrump Administration\nRelated Content\nImmigration US Catholic bishops chide Trump’s immigration policies: ‘Climate of fear’\nForeign Policy Colombia’s Petro amplifies quarrel over drugs with ‘barbarian’ Trump after halting intel sharing with US\nInfrastructure Noem unveils $10,000 bonus paychecks for TSA agents who stuck out shutdown\nEquality, Not Elitism Democrats want school choice for themselves, not everyone else\nJustice DOJ searching for suspect who attacked Alina Habba’s office, Bondi says", "extraction_method": "beautifulsoup", "word_count": 677, "success": true}