{"full_text": "The Trump Administration is working to introduce 50-year mortgages for home buyers—a plan that has drawn criticism even from some of the President’s allies, and that experts warn could come with potentially major drawbacks.President Donald Trump suggested that his Administration would introduce 50-year mortgages in a Truth Social post over the weekend. Soon after, Federal Housing Finance Agency Director Bill Pulte posted on X: “Thanks to President Trump, we are indeed working on The 50 year Mortgage—a complete game changer.”The 50-year mortgage would mark a significant extension on the most common type of mortgage in the U.S., a 30-year fixed mortgage, in which the loan is amortized—or paid off—over a 30-year period.Several right-wing commentators and lawmakers were quick to voice opposition to the idea, which Rep. Marjorie Taylor Greene said in a post on X would “ultimately reward the banks, mortgage lenders. and home builders while people pay far more in interest over time and die before they ever pay off their home.”The Trump Administration’s proposal also generated criticism from housing experts, who say that the benefits to home buyers would be minimal. Here’s what a 50-year mortgage would mean for prospective home buyers.What are the benefits?The monthly payments for a 50-year mortgage would be lower than those for a 30-year mortgage, according to Alex Schwartz, professor of urban policy at The New School. AdvertisementImagine, for instance, that a person is purchasing a $500,000 home with a 30-year mortgage. The current average interest rate for a 30-year fixed mortgage is about 6.22%, according to Freddie Mac. That means if the home buyer put down a down payment of 20%, their monthly payment of the principal and interest would be $2,455, according to Fannie Mae’s mortgage calculator. But if they took out a 50-year mortgage, again with a down payment of 20%, then their monthly payment of principal and interest—assuming that the interest rate is the same—would be $2,171, according to Fannie Mae. That’s a little under $300 less than the monthly payment for a 30-year mortgage.“It’s a reduction, but it’s not dramatic,” Schwartz says of the difference between monthly payments for 30- and 50-year mortgages.He also notes that the interest rate for a 50-year mortgage likely wouldn’t be the same as that for a 30-year mortgage, which could reduce the potential savings. A higher interest rate is just one of a few possible drawbacks to a 50-year mortgage, he says.AdvertisementWhat are the drawbacks?One drawback of a 50-year mortgage is that it would take home buyers longer to pay off their debt.“If you were 30 years old and bought a home with a 30-year mortgage, it would be owned free and clear at age 60, so you’d only have to pay property taxes and maintenance on the home, no longer having to pay a mortgage during your older years or retirement,” Schwartz says. “If you were now paying a loan for a 50-year mortgage, and you’re 30, the mortgage wouldn’t end until you’re 80, and so you would have a period of time, most likely during retirement, where you have to pay the debt service costs on top of the property taxes and maintenance,” he continues.The other issue, Schwartz says, is that homeowners wouldn’t build equity as quickly with a 50-year mortgage as they would with a 30-year mortgage. For the first several years of a mortgage, a homeowner is primarily paying interest; it takes several years before they actually start reducing their debt. Buyers with a 50-year mortgage would be paying down their debt much more slowly compared to a 30-year mortgage.AdvertisementIf housing prices go down, Schwartz fears that people with a 50-year mortgage may then have negative equity, meaning they would owe more on their mortgage than their home is worth.Schwartz also says that, most likely, the interest rate for a 50-year mortgage would be higher than that of a 30-year mortgage. Currently, interest rates for 30-year mortgages are higher than those of 15-year mortgages.“There are major trade-offs here,” Schwartz says. “Your monthly payment is somewhat reduced, [but] it will take a lot longer to build equity in your home, it would take longer to actually retire the mortgage so that when you’re older your housing affordability problems would be greater when you’re out of the workforce than they would be if you have a 30-year mortgage, and you are at greater risk of having negative equity.”Would a 50-year mortgage help address housing affordability?According to Schwartz, not in any significant way. For people who are “squeezed” on their current mortgage, if they chose to refinance for a 50-year mortgage, their monthly payments would become more affordable, Schwartz says. But he warns that a longer-term mortgage would carry significant risks.Advertisement“Is this going to make home ownership more accessible for first-time home buyers? I don’t think so,” he says.Amid criticism over the proposal, Pulte acknowledged in a post on X on Sunday, “We hear you. We are laser focused on ensuring the American Dream for YOUNG PEOPLE and that can only happen on the economic level of homebuying. A 50 Year Mortgage is simply a potential weapon in a WIDE arsenal of solutions that we are developing right now. STAY TUNED!”The President also responded to criticism over the idea. In an interview with Fox News that aired on Monday, he said a 50-year mortgage is “not even a big deal.”“All it means is you pay less per month,” Trump said. “You pay it over a longer period of time. It’s not like a big factor. It might help a little bit.”", "extraction_method": "beautifulsoup", "word_count": 920, "success": true}