{"full_text": "El Paso ranks #1 city in U.S. for housing affordability, study findsNewsNewsMother allegedly attacked deputies to prevent arrest of daughter in CanutilloA 64-year-old mother allegedly attacked deputies trying to stop them from arresting her daughter during a domestic assault call in Canutillo.El Paso's downtown deck plaza project advances with $25M recommendationThe plan to build a downtown deck plaza over Interstate 10 in El Paso has taken a step forward as the Metropolitan Planning Organization's Transportation PolicyMan arrested for smuggling out 1,285 machine gun magazines at Santa Teresa borderOne man was arrested after he was reportedly caught trying to smuggle over 1,000 machine gun magazines to Mexico through the Santa Teresa border crossing.Sunland Park annexation proposal raises concerns from Dona Ana CountyA proposal to annex over 2,600 acres of land into the City of Sunland Park is stirring debate in Dona Ana County.LocalNation & WorldEntertainmentOffbeatGuns, Violence & the Road to a Safer TexasEl Paso ShootingElectionVideosConnect to CongressAmazing AmericaCBS4 Special ReportsNews LinksBack to SchoolArmstrong Army StrongInside Your WorldSoarBeyond The PodiumQuestion of the DayImmigrationSpotlight on AmericaNewsletter Sign UpFull Measure with Sharyl AttkissonDid You Know?Addicted AmericaCrisis in the ClassroomLinks MentionedWeatherCurrent WeatherEl PasoClear52F68/39Today68/39Tuesday68/40Wednesday66/37Latest WeathercastLatest WeathercastRadarMapsLive Weather CamerasCommunityCommunityMother allegedly attacked deputies to prevent arrest of daughter in CanutilloA 64-year-old mother allegedly attacked deputies trying to stop them from arresting her daughter during a domestic assault call in Canutillo.El Paso's downtown deck plaza project advances with $25M recommendationThe plan to build a downtown deck plaza over Interstate 10 in El Paso has taken a step forward as the Metropolitan Planning Organization's Transportation PolicyMan arrested for smuggling out 1,285 machine gun magazines at Santa Teresa borderOne man was arrested after he was reportedly caught trying to smuggle over 1,000 machine gun magazines to Mexico through the Santa Teresa border crossing.Sunland Park annexation proposal raises concerns from Dona Ana CountyA proposal to annex over 2,600 acres of land into the City of Sunland Park is stirring debate in Dona Ana County.Call 4 ServiceJust 4 FunSinclair CaresEvan ExplainsPartner SpotlightProblem SolversSenior Healthy LivingWellness WatchFaculty SpotlightARC El PasoStationStationHOLIDAY TRIVIA OFFICIAL CONTEST RULESHOLIDAY TRIVIA OFFICIAL CONTEST RULESContest: HOLIDAY TRIVIAMarket(s)/Station(s): Abilene, TX (KTXS), Albany/Schenectady/Troy, NY (WCWN,WRGB), Amarillo, TX (KVITrick or Treat TriviaTRICK OR TREAT TRIVIA OFFICIAL CONTEST RULESContest: TRICK OR TREAT TRIVIAMarket(s)/Station(s): Abilene, TX (KTXS), Albany/Schenectady/Troy, NY (WCWN,WRGB), AmaFrequently Asked QuestionsFrequently Asked QuestionsFrequently Asked QuestionsFrequently Asked QuestionsContactPeopleCareersScheduleContestsNewsletter Sign UpFollow Us On SocialGame CenterGame CenterDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord Search WatchLiveNow52°Tue67°Wed67°SearchSearchUser IconWatchSearchNewsDown ArrowLocalNation & WorldEntertainmentOffbeatGuns, Violence & the Road to a Safer TexasEl Paso ShootingElectionVideosConnect to CongressAmazing AmericaCBS4 Special ReportsNews LinksBack to SchoolArmstrong Army StrongInside Your WorldSoarBeyond The PodiumQuestion of the DayImmigrationSpotlight on AmericaNewsletter Sign UpFull Measure with Sharyl AttkissonDid You Know?Addicted AmericaCrisis in the ClassroomLinks MentionedWeatherDown ArrowWeather HomeRadarMapsLive Weather CamerasCommunityDown ArrowCommunity HomeCall 4 ServiceJust 4 FunSinclair CaresEvan ExplainsPartner SpotlightProblem SolversSenior Healthy LivingWellness WatchFaculty SpotlightARC El PasoStationDown ArrowStation HomeContactPeopleCareersScheduleContestsNewsletter Sign UpFollow Us On SocialGame CenterDown ArrowGame Center HomeDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord Search MoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsChime InNewsletter Sign UpTrafficDown ArrowTraffic HomeEl Paso Bridge TimesGas TrackerRed ZoneSportsDown ArrowSports HomeSports HeadlinesEl Paso ChihuahuasMore SportsEl Paso RhinosLocomotiveTICKETSCity GuideLegalDown ArrowTerms & ConditionsCopyright NoticesEEO Public File ReportFCC InfoKDBC - FCC ApplicationsKCWF - FCC ApplicationsPublic File AssistanceContactNews TeamCareersConteststwitter iconfacebook iconACCESSIBILITYArmstrong Williams Town HallArmstrong Williams takes on the news of the week and asks the questions you want answered. Don’t miss our weekly town hall!WATCHClose11Please ensure Javascript is enabled for purposes of website accessibilityEl Paso ranks #1 city in U.S. for housing affordability, study findsby Erika EsquivelThu, October 2, 2025 at 8:33 AMUpdated Thu, October 2, 2025 at 8:34 AMSan AntonioTexas suburban housing development neighborhood - aerial view with houses in rows in middle-class neighborhoodComment on this story0CommentShare storySharetopics: El PasoHousing affordabilityMedian incomeRentersHomeownersSmartAssetHousing costsMiamiEL PASO, Texas (KFOX14/CBS4) — El Paso was ranked as the number one city in the U.S. for housing affordability, according to a study. SmartAsset’s latest study ranked U.S. cities based on housing costs as a portion of the local median income, with costs broken out for both renters and homeowners.El Paso ranked no. 1 overall, with 20.35% of household median income going to putting roofs over heads. According to the study, just 20.35% of household income goes to housing costs in El Paso, where the average monthly cost across both renters and homeowners is $1,016. Renters pay a median $985 per month compared to homeowners at $1,066, with a $59,932 median income across all households. Residents in Louisville, KY (20.38%); Albuquerque, NM (20.38%); Mesa, AZ (20.54%); and Indianapolis, IN (21.82%) also pay some of the lowest portions of their incomes to housing.For Miami residents, more than 36% of gross income goes to housing costs. Miami is the most expensive city for housing studywide, with homeowners paying a median of $2,025 in monthly costs and renters paying $1,975, compared to a median household income of $66,337. Costs for homeowners actually decreased year over year, but rent increases overshadowed this since two thirds of households in Miami rent.Below is the list of the cities with the highest house affordability. Miami, FL Los Angeles, CA Long Beach, CA New York, NY Oakland, CA Boston, MA Detroit, MI Baltimore, MD Tampa, FL San Diego, CA Memphis, TN Houston, TX Atlanta, GA Dallas, TX Austin, TXSee the full study here.RECOMMENDED: El Paso city council reviews progress on 'Envision El Paso' plan for future developmentSign up to receive the top interesting stories from in and around our community once daily in your inbox.TrendingErika Kirk opens up about wishing for pregnancy after husband's tragic assassinationKirk joined Megyn Kelly for a live interview on the last stop of Kelly's Sirius XM tour in Glendale, Arizona. Family displaced after mobile home fire in Anthony, New MexicoA Doña Ana County family is displaced after a mobile home fire on Saturday.Fabens man arrested for alleged sexual assault of teen near veterans parkA 34-year-old man from Fabens was arrested Saturday night after he allegedly sexually assaulted a 16-year-old near Fabens Veterans Park.Department of Government Efficiency was dissolved, according to federal officialsThe Department of Government Efficiency (DOGE) has been dissolved, according to federal officials.U.S. Border Patrol hands over drug suspect to Mexican authorities at El Paso crossingThe U.S. Border Patrol in El Paso took to social media Sunday to announce that it had handed a suspect wanted on drug-related charges to Mexican authorities...NEWS IN PHOTOS:\"Local\"3Mother allegedly attacked deputies to prevent arrest of daughter in Canutillo6El Paso's downtown deck plaza project advances with $25M recommendation11El Paso Children's Hospital host annual celebration day for young patients3Man arrested in connection with West El Paso shooting ACCESSIBILITYDownload Our Mobile Apps:Terms & ConditionsCopyright NoticesEEO Public File ReportFCC InfoKDBC - FCC ApplicationsKCWF - FCC ApplicationsPublic File AssistanceContactNews TeamCareersContestsNewsWeatherSportsTrafficJust 4 FunGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1109, "success": true}