{"full_text": "Fact Check Team: Will Trump's 50-year mortgage idea solve or worsen housing affordability?NewsNewsGreen Bay police seek witnesses after hit-and-run leaves man injured; suspect in custodyOfficers were dispatched to the 100 block of S. Fisk Street around 4 p.m. for a report of a black SUV that crashed into several garages and drove away.Bids for coal pile relocation in Green Bay come in under projectionsThe project was expected to cost $50 million or more, but the five base bids submitted by the Nov. 18 deadline ranged from $41.8 million to $47.6 million. Driver accused of hitting Appleton officer with vehicle to face trialThe motorist accused of striking an Appleton police officer with a vehicle while having a blood alcohol level of .218 was ordered Monday to stand trial.Door County invests in accessibility partnership to empower travelers with disabilitiesAt least 40 businesses in Door County are voluntarily undergoing an analysis of their accessibility and allowing that information to be published for the publicLocalStateFOX 11 Food ProjectSKYFOXBeyond The PodiumTown Hall NewsNation & WorldEntertainmentOffbeatAmazing AmericaObituariesConnect To CongressVideosLivestreamArmstrong Army StrongQuestion of the DaySpotlight on AmericaFull Measure with Sharyl AttkissonProject EducationTrafficWeatherCurrent WeatherGreen BayCloudy51F52/41Today52/41Tuesday48/33Wednesday35/22Latest WeathercastLatest WeathercastRadarMapsBoater and Marine MapsCamerasClosingsFOX 11 Weather AppWeather Study GuidesWeather StoriesHistoric Weather EventsSevere Weather GalleriesTrafficSportsSportsBadgers fall out of AP Top 25 after loss to BYUPurdue remained at No. 1 in The Associated Press men’s college basketball poll.Zayne Anderson's special teams heroics lift Packers past VikingsGREEN BAY (WLUK) -- Since the Week 2 win over the Commanders, head coach Matt LaFleur has been itching for a complete game from all three phases. Packers welcome NFC North rival for the first time since Week 1GREEN BAY (WLUK) -- Sunday, a rivalry was renewed when the Packers and Vikings met for the first time in 2025.Packers dominate Vikings en route to 23-6 victoryGREEN BAY, Wis. (AP) &mdash; Emanuel Wilson rushed for a career-high 107 yards and two touchdowns in his first career start and the Green Bay Packers defeated the MinPackers And NFLBrewers And MLBBucks And NBALocal SportsOutdoorsCollegeHigh School GametimeTICKETSCity GuideDeer HuntThe TundraCommunityCommunitySuamico neighborhood lights up with luminaries to collect toy donations for Giving TreeThere's an opportunity this weekend to enjoy the holiday season while making a difference in our community.Appleton Public Library's new 'No Questions Asked' collection for addiction, mental healthThe library said the goal of the section is to reduce the stigma around asking for help, with books and resources free to take and keep.Packers players make a statement with custom cleats supporting various causesPlayers collaborated with cleat manufacturers, designers and local artists to create their custom-designed cleats displaying their selected cause.COMMENTARY: Thank you for making this year's FOX 11 Food Project the best we've ever hadOver the course of the week, 64,120 pounds of food and more than $19,500 was donated by people from across our Northeast Wisconsin community.Making A DifferenceFOX 11 Community CaresGolden Apple AwardsBest of the ClassSinclair CaresCommunity CalendarJob FinderSuicide PreventionGame CenterGame CenterDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchWatchLiveNow51°Tue48°Wed35°SearchSearchUser IconWatchSearchNewsDown ArrowLocalStateWisconsin BudgetFOX 11 Food ProjectSKYFOXBeyond The PodiumTown Hall NewsNation & WorldEntertainmentOffbeatAmazing AmericaObituariesConnect To CongressVideosLivestreamArmstrong Army StrongQuestion of the DaySpotlight on AmericaFull Measure with Sharyl AttkissonProject EducationTrafficWeatherDown ArrowWeather HomeRadarMapsBoater and Marine MapsCamerasClosingsFOX 11 Weather AppWeather Study GuidesWeather StoriesHistoric Weather EventsSevere Weather GalleriesTrafficSportsDown ArrowSports HomePackers And NFLBrewers And MLBBucks And NBALocal SportsOutdoorsCollegeHigh School GametimeTICKETSCity GuideDeer HuntThe TundraCommunityDown ArrowCommunity HomeMaking A DifferenceFOX 11 Community CaresGolden Apple AwardsBest of the ClassSinclair CaresCommunity CalendarWeekend FunJob FinderSuicide PreventionGame CenterDown ArrowGame Center HomeDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchMoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsChime In Good Day WIDown ArrowGood Day WI HomeFox 11 Field HouseLivingDown ArrowLiving HomeRecipesFeatured SegmentsBig Night OutFor Pet's SakeAward Winning CheesesLocal Home Selling & Buying TipsStock SistersNewsletter Sign UpOn Fox 11Down ArrowOn Fox 11 HomeContactCareersContestsStream FOX 11TV ScheduleFOX 11 APPSPeoplePartner SpotlightNewsletter Sign UpFOX 11 Social DirectoryLegalDown ArrowContact UsTerms And ConditionsFCC Public ProfileEEO ReportFCC ApplicationsPublic File AssistanceCopyrightCareers Conteststwitter iconfacebook iconACCESSIBILITYPlease ensure Javascript is enabled for purposes of website accessibilityFact Check Team: Will Trump's 50-year mortgage idea solve or worsen housing affordability?by EMMA WITHROW | Fact Check TeamTue, November 18, 2025 at 6:37 PMUpdated Tue, November 18, 2025 at 9:59 PM4VIEW ALL PHOTOSWASHINGTON, DC - NOVEMBER 17: U.S. President Donald Trump delivers remarks during a meeting of the White House Task Force on the FIFA World Cup 2026 in the Oval Office of the White House on November 17, 2025 in Washington, DC. The task force was created to oversee security, logistics, and federal government support for the 2025 Club World Cup and the 2026 FIFA World Cup, jointly hosted by the United States. (Photo by Win McNamee/Getty Images)Comment on this story0CommentShare storySharetopics: MortgageHousing affordabilityUnderwater mortgagesHomebuildersInterest ratesDonald Trump50-year mortgageNegative equity WASHINGTON (TNND) — The Federal Reserve signaled this week that aspiring home buyers expecting more interest-rate relief may have to keep waiting. And that delay is exposing a deeper problem in the housing market: hundreds of thousands of Americans who bought newly built homes over the last few years are already underwater on their mortgages.It’s a trend analysts say didn’t happen by accident, and the lending practices behind it mirror warning signs from the early 2000s. (TNND)It’s a trend analysts say didn’t happen by accident, and the lending practices behind it mirror warning signs from the early 2000s.How Builders Helped Create a Wave of Underwater MortgagesBeing “underwater” on a mortgage simply means you owe more than your home is currently worth. As Bankrate’s chief financial analyst Greg McBride explains, “you owe more than the current value the asset is worth less than the amount you borrowed”.But according to a new analysis first reported by The Wall Street Journal, many homeowners who purchased newly built houses in 2022–2024 landed in that position almost immediately. That’s because large homebuilders have been offering artificially low mortgage rates, often far below market levels — in exchange for higher home prices.Here’s what WSJ found, based on data from analyst John Comiskey:27% of Lennar’s FHA loans from 2022–2024 are now underwater.18% of D.R. Horton’s FHA loans are underwater.10% of Quicken Loans’ FHA loans (a non-builder lender) are underwater.The playbook works like this: builders advertise mortgage rates around 3.99%, even while the broader market hovered closer to 6.3%. But to make the numbers work, they keep sale prices above what the property might otherwise be worth. Buyers get a lower monthly payment, but at the cost of taking out a loan that’s already near, or above, the home’s actual value.When prices stopped rising, many borrowers slid into negative equity almost immediately.What Happens When You’re Underwater?For homeowners, the consequences are severe, and in some cases, financially immobilizing.You can’t easily sell your home. Selling requires bringing cash to the closing table to cover the gap between the loan balance and the sale price. That can mean writing a check for tens of thousands of dollars.You can’t refinance. Lenders require equity to approve a refi. Without it, homeowners are effectively locked into their existing rates.The risk of default rises. When people owe far more than their home is worth, they’re more likely to walk away, a dynamic that played a major role in the 2008 housing crash, according to Bankrate.It becomes a systemic risk. Large pockets of underwater loans strain lenders, federal backstops, and local housing markets.In short, underwater mortgages trap households and can reverberate far beyond a single borrower.Is a 50-Year Mortgage a Solution, or Another Risk?Into this climate stepped former President Donald Trump, who floated a new idea on Truth Social: 50-year mortgages.Supporters call it an affordability boost. Critics are calling it a “lifetime mortgage.”The Upside: Lower PaymentsLower payments could help more people qualify, especially first-time buyers who fail debt-to-income checks. (TNND)A 50-year mortgage would spread repayment over two extra decades, meaning lower monthly payments.A New York Times analysis found that on a $500,000 home, a borrower could save about $250–$300 a month, around $4,000 a year, with a 50-year loan versus a standard 30-year mortgage.Lower payments could help more people qualify, especially first-time buyers who fail debt-to-income checks.The Downsides: Higher Costs and Bigger RisksThere would be enormous lifetime interest. Using the same NYT example: 30-year mortgage interest: ~$500,00050-year mortgage interest: nearly $900,000You’d pay almost twice the price of the home in interest alone.The National Association of Realtors says the median age of a first-time buyer used to be 36 but is now 40. Add 50 years and they’d be 86 by the time the loan matures.The Bottom LineBuilder-backed mortgages helped more Americans buy homes in a tough market, but often at the cost of pushing them into inflated prices and negative equity. Now, with underwater mortgages spreading across multiple major homebuilders, policymakers are starting to ask whether the industry’s lending incentives need a closer look.Comment with BubblesBE THE FIRST TO COMMENTMeanwhile, Trump’s 50-year mortgage proposal aims to boost affordability but could introduce new long-term risks: massive interest payments, slower equity, and more households vulnerable to downturns.TrendingWoman convicted in Slender Man stabbing taken into custody in IllinoisGeyser was found at a truck stop in Posen, Illinois, the Posen Police Department said early Monday.Cousin says neglected, malnourished Oneida teen is recovering, but has long way to goRelatives of a 14-year-old girl who was found weighing only 35 pounds want the community to know she is now safe and in good hands.Lomira man found dead near tree standTOWN OF OAKFIELD (WLUK) -- The Fond du Lac County Sheriff's Office and the WisconsinDepartment of Natural Resources are investigating the death of a 24-year-olWoman convicted in Slender Man stabbing cuts off ankle bracelet, flees group homeMADISON (WLUK) - Madison officers are searching to locate Morgan Geyser's whereabouts after leaving her group home Saturday night.Geyser, one of the two people 5 ejected, zero arrests during Packers-Vikings game at Lambeau FieldFive people were ejected during the Green Bay Packers' 23-6 victory over the Minnesota Vikings on Sunday afternoon.NEWS IN PHOTOS:\"Local\"6Bids for coal pile relocation in Green Bay come in under projections4Driver accused of hitting Appleton officer with vehicle to face trial4Opening of new lodge helps kick off 50th season at Nordic Mountain6Green Bay gets into the holiday spirit with 41st annual downtown paradeACCESSIBILITYDownload Our Mobile Apps:Contact UsTerms And ConditionsFCC Public ProfileEEO ReportFCC ApplicationsPublic File AssistanceCopyrightCareers ContestsNewsWeatherSportsCommunityOn FOX 11Good Day WILivingGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1690, "success": true}