{"full_text": "Housing numbers point to strong buyer's market. There's a catchSkip NavigationMarketsPre-MarketsU.S. MarketsCurrenciesCryptocurrencyFutures & CommoditiesBondsFunds & ETFsBusinessEconomyFinanceHealth & ScienceMediaReal EstateEnergyClimateTransportationIndustrialsRetailWealthSportsLifeSmall BusinessInvestingPersonal FinanceFintechFinancial AdvisorsOptions ActionETF StreetBuffett ArchiveEarningsTrader TalkTechCybersecurityAIEnterpriseInternetMediaMobileSocial MediaCNBC Disruptor 50Tech GuidePoliticsWhite HousePolicyDefenseCongressExpanding OpportunityVideoLatest VideoFull EpisodesLivestreamLive AudioLive TV ScheduleCNBC PodcastsCEO InterviewsCNBC DocumentariesDigital OriginalsWatchlistInvesting ClubTrust PortfolioAnalysisTrade AlertsMeeting VideosHomestretchJim's ColumnsEducationSubscribePROPro NewsJosh BrownMike SantoliCalls of the DayMy PortfolioLivestreamFull EpisodesStock ScreenerMarket ForecastOptions InvestingChart InvestingSubscribeLivestreamMenuMake ItselectUSAINTLLivestreamSearch quotes, news & videosLivestreamWatchlistSIGN INCreate free accountMarketsBusinessInvestingTechPoliticsVideoWatchlistInvesting ClubPROLivestreamMenuReal EstateHousing numbers point to an unusually strong buyer's market. There's a catchPublished Wed, Nov 19 202511:47 AM ESTUpdated Wed, Nov 19 20251:23 PM ESTDiana Olick@in/dianaolick@DianaOlickCNBC@DianaOlickWATCH LIVEKey PointsThere were an estimated 36.8% more home sellers than buyers in October.Real estate firms cite housing affordability as the biggest challenge to their business.Home prices in September were 1.2% higher year over year.A home is shown for sale in The Heights in Houston, Monday, Oct. 27, 2025. Kirk Sides | Houston Chronicle | Getty ImagesThis is the strongest buyer's market in housing in more than a decade. That's the headline on a new report from Redfin, a real estate brokerage owned by Rocket Cos. The report points to specific data on the supply of homes for sale and the number of buyers actively looking. There were an estimated 36.8% more sellers than buyers in October, according to Redfin, the largest gap in records dating back to 2013. Redfin defines a buyer's market as one with at least 10% more sellers than buyers. Economists at the brokerage estimate that the last time there was a stronger buyer's market was in the years following the 2008 financial crisis, when home prices plummeted across the nation. \"Of course, it's only a buyer's market for those who can afford to buy—many Americans have been priced out of the housing market as affordability has eroded,\" Redfin researchers noted. And that's the crux of the problem. Is it really a buyer's market, if so many buyers are still priced out and therefore not even looking?Real estate firms cite housing affordability as the biggest challenge to their business, according to a new report from the National Association of Realtors. It far outweighs other challenges, including industry costs.\"Real estate firms are on the frontlines of the industry and are seeing firsthand how housing affordability and local economic conditions are impacting their clients,\" said Jessica Lautz, NAR deputy chief economist.Home prices continue to weaken but, nationally at least, were still 1.2% higher in September from the year before, according to Cotality. Prices are roughly 50% higher nationally than they were just five years ago, pre-pandemic.\"Much like the K-shaped trend seen in overall consumer spending—driven largely by higher income groups—lower-income potential homebuyers are facing challenges due to an uncertain job market, sluggish wage growth, and worsening financial conditions. This is leading to weaker demand for homes and downward pressure on prices,\" said Selma Hepp, Cotality's chief economist. Get Property Play directly to your inboxCNBC's Property Play with Diana Olick covers new and evolving opportunities for the real estate investor, delivered weekly to your inbox.Subscribe here to get access today.Mortgage rates have come off their recent highs, but are still roughly twice what they were in the first years of the pandemic, when it fast became a seller's market.Cost remains the primary obstacle to homebuying, with about 75 of the top 100 housing markets still considered overvalued, according to Cotality. In Washington, D.C., which was hardest hit by the recent government shutdown, potential buyers — largely those who were unaffected by the shutdown — are discovering it is easier to get good deals. \"They are figuring out they have leverage and are finding they can seek price concessions and repairs,\" said Paul Legere, a buyer's agent with the Joel Nelson Group of Keller Williams, adding it \"feels like it might be a short moment in time.\"The shutdown may be over, but consumer sentiment is not pointing to a surge in homebuying. In its November sentiment survey, that National Association of Home Builders reported a drop in builder sales expectations over the next six months. \"We continue to see demand-side weakness as a softening labor market and stretched consumer finances are contributing to a difficult sales environment,\" said NAHB Chief Economist Robert Dietz. Subscribe to CNBC PROSubscribe to Investing ClubLicensing & ReprintsCNBC CouncilsSelect Personal FinanceCNBC on PeacockJoin the CNBC PanelSupply Chain ValuesClosed CaptioningDigital ProductsNews ReleasesInternshipsCorrectionsAbout CNBCAd ChoicesSite MapPodcastsCareersHelpContactNews TipsGot a confidential news tip? We want to hear from you.Get In TouchCNBC NewslettersSign up for free newsletters and get more CNBC delivered to your inboxSign Up NowGet this delivered to your inbox, and more info about our products and services.Advertise With UsPlease Contact UsPrivacy PolicyYour Privacy ChoicesCA NoticeTerms of Service© 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal\nData is a real-time snapshot *Data is delayed at least 15 minutes.\nGlobal Business and Financial News, Stock Quotes, and Market Data\nand Analysis.\nMarket Data Terms of Use and DisclaimersData also provided by", "extraction_method": "beautifulsoup", "word_count": 814, "success": true}