{"full_text": "Trump administration tries to break through lock-in effect with 'portable mortgages'NewsNewsSpringfield man arrested for possession of child sexual abuse materialsA Springfield man, Merle E. Monroe, 68, has been arrested for possession of child sexual abuse materials.The Illinois State Police (ISP) Division of Criminal IIDOT, Illinois State Police urge safe driving and outline Thanksgiving travel safety planThanksgiving is just three days away, and millions of Illinoisans are expected to travel to see friends and family and feast on holiday favorites.Man found shot in vehicle after crash in Springfield, later diesA 19-year-old man was found shot in a vehicle after crashing into a garage in Springfield.Springfield police responded to a call on Nov. 21 at approximately 10:Pastor suspects arson in church fire, Champaign Police seek public help with investigationMt. Calvary Missionary Baptist Church in Champaign’s Garden Hills neighborhood is working to recover after a fire damaged its sanctuary earlier this week.ServicLocalProject IllinoisNation & WorldEntertainmentOffbeatVideosConnect to CongressLivestream SpringfieldElectionAmazing AmericaElection ResultsFox Illinois News AppArmstrong Army StrongInside Your WorldBeyond The PodiumSpotlight on AmericaAddicted IllinoisFull Measure with Sharyl AttkissonBack to SchoolDid You Know?Crisis in the ClassroomBliefnick Murder TrialIllinois State FairWeatherCurrent WeatherSpringfieldRain48F56/48Today56/48Tuesday56/33Wednesday40/23Latest WeathercastLatest WeathercastRadarMapsChampaign Local ForecastSpringfield Local ForecastClosingsWeather GuaranteeTower CamsStorm Team Weather AppFeaturesFeaturesAg In an Instant: 40M turkeys raised for the holiday & Thanksgiving dinner costing lessAs families across the country gather for Thanksgiving, it's not just a celebration of food and family, but also a tribute to American agriculture...Wellness Wednesday: The Holiday Season and the FluWellness Wednesday: The Holiday Season and the FluSinclair Cares: Fill the Food BanksSinclair is partnering with Feeding America this holiday season for Sinclair Cares: Fill the Food Banks to help provide meals to families across the U.S. Ag In a Instant: Beef prices remain high, bringing attention to Capitol HillWe begin this week's Ag In an Instant with some news that may be hard to swallow. Beef prices are not expected to decrease soon, according to Tyson Foods...AgricultureLive GuestsPump PatrolContestsHealth MattersSinclair CaresPet of the WeekPartner SpotlightQuestion of the DayMoney CentsIn the KitchenSoarLifestyle MattersFor Pet's SakeMotivate Your MondayOur School PrideJoy of SharingOops! All GamesWellness WednesdayCommunityCommunitySpringfield man arrested for possession of child sexual abuse materialsA Springfield man, Merle E. Monroe, 68, has been arrested for possession of child sexual abuse materials.The Illinois State Police (ISP) Division of Criminal IIDOT, Illinois State Police urge safe driving and outline Thanksgiving travel safety planThanksgiving is just three days away, and millions of Illinoisans are expected to travel to see friends and family and feast on holiday favorites.Zelle limits at top banksLooking to use Zelle for a transfer? Here are the Zelle limits at various banks.Is there price-fixing in the beef industry?Beef prices aren't likely to move much after Tyson Foods announced the closure of one of its plants, according to an agricultural economist.EventsGame CenterGame CenterDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchWatchLiveNow48°Tue56°Wed42°SearchSearchUser IconWatchSearchNewsDown ArrowLocalProject IllinoisNation & WorldEntertainmentOffbeatVideosConnect to CongressLivestream SpringfieldElectionAmazing AmericaElection ResultsFox Illinois News AppArmstrong Army StrongInside Your WorldBeyond The PodiumSpotlight on AmericaAddicted IllinoisFull Measure with Sharyl AttkissonBack to SchoolDid You Know?Crisis in the ClassroomBliefnick Murder TrialIllinois State FairWeatherDown ArrowWeather HomeRadarMapsChampaign Local ForecastSpringfield Local ForecastClosingsWeather GuaranteeTower CamsStorm Team Weather AppFeaturesDown ArrowFeatures HomeAgricultureLive GuestsPump PatrolContestsHealth MattersSinclair CaresPet of the WeekPartner SpotlightQuestion of the DayMoney CentsIn the KitchenSoarLifestyle MattersFor Pet's SakeMotivate Your MondayOur School PrideJoy of SharingOops! All GamesWellness WednesdayCommunityDown ArrowCommunity HomeEventsGame CenterDown ArrowGame Center HomeDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchMoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsChime InNewsletter Sign UpStationDown ArrowStation HomeContact WCCUContact WRSPPeopleScheduleCareersFCC Info - WCCUFCC Info - WRSPSign up for AlertsNewsletter Sign UpATSC 3.0SportsDown ArrowSports HomeLocalFighting IlliniFox Sports Go AppTICKETSCity GuideChicago BearsFriday Night Show DownLegalDown ArrowTerms & ConditionsCopyright NoticesEEO Public File ReportWRSP FCC InfoWRSP FCC ApplicationsWCCU FCC InfoWCCU FCC ApplicationsPublic File AssistanceContactNews TeamConteststwitter iconfacebook iconACCESSIBILITYArmstrong Williams Town HallArmstrong Williams takes on the news of the week and asks the questions you want answered. Don’t miss our weekly town hall!WATCHClose11Please ensure Javascript is enabled for purposes of website accessibilityTrump administration tries to break through lock-in effect with 'portable mortgages'by AUSTIN DENEAN | The National News DeskFri, November 14, 2025 at 11:47 AM4VIEW ALL PHOTOSFILE - A for sale sign stands outside a home on the market in the Alamo Placita neighborhood Tuesday, Aug. 27, 2024, in central Denver. (AP Photo/David Zalubowski, File)Comment on this story0CommentShare storySharetopics: Mortgage ratesPortable mortgagesHousing affordabilityLock-in effectHomeownershipHousing supplyMortgage-backed securitiesTariffsWASHINGTON (TNND) — The Trump administration is considering another method to bring down soaring housing costs through mortgage rates that are pricing people out of homeownership and keeping homes from coming onto the market.Federal Housing Finance Agency director Bill Pulte said the administration is “actively evaluating “portable mortgages,” which would allow homebuyers to take their mortgage rate with them when they decide to move. The proposal is a direct bid to confront the so-called “lock-in effect,” where homeowners are unwilling or unable to part with their lower mortgage rate and keeping their home off the market.Many homeowners were able to buy or refinance during the pandemic for ultra-low rates at or below 3%, which cuts hundreds of dollars off a monthly mortgage payment. Rates have been stuck between 6 to 7% for the last several years, creating a barrier for homeowners to put their homes up for sale as they don’t want to take up a new loan at higher rates. More than half of homeowners with a mortgage have a rate below 4%, according to Redfin.Homes are changing hands at the lowest rate in decades in 2025 in a market that has been in a standstill for years as mortgage rates climbed and economic uncertainty set in. A Redfin analysis found only 2.8% of homes in the U.S. have turned over to a new owner in 2025.“Buyers are walking away from deals more often, sometimes due to affordability issues and sometimes because they’re re-evaluating whether now is the right moment to commit,” Redfin head of economic research Chen Zhao said in a release. “Others aren’t even shopping, waiting instead for prices or mortgage rates to come down. On the other side, many sellers are staying put—either because they’re locked into low rates or unwilling to accept offers below expectations.”Allowing people to take their mortgage rate with them to a new property could help boost the supply of existing homes on the market if more homeowners are willing to move with their lower rate.But it could also come with higher list prices as more people enter a market with a limited pool of homes available to buy. Homeowners would also have an advantage on bidding compared to a new buyer who is working with today’s rates with more wiggle room in their budgets.“Anyone able to ‘port’ a 3% mortgage into a new purchase would effectively be bidding with cheap financing in a 6% world. That added purchasing power would push prices up, while renters and mortgage-free owners would still face today’s higher rates—only now with even higher list prices,” Jake Krimmel, a senior economist at Realtor.com, wrote in an analysis.Portable mortgages could also disrupt the U.S. mortgage system and lead to higher rates. Mortgage-backed securities, groups of mortgages that lenders sell to investors, would have their pricing models blown up and create more risk for investors as less loans are paid off early with more homeowners taking them with them when they move.Pulte has also said officials are evaluating a plan to offer 50-year mortgages and how to make mortgages assumable, where homebuyers could take over a seller’s preexisting loan. Assumable mortgages are already available in the U.S. but are rarely used because they require a large cash payment or a second mortgage at current rates.The 50-year mortgage could lower monthly payments by stretching out the term of the loan but would also likely come with higher rates and would ultimately cost buyers more in interest over the life of the loan and make it take longer to build equity.The administration’s efforts to lower housing costs come as an increasing slice of Americans are being priced out of the market altogether with elevated mortgage rates and consistently growing list prices. Home values have climbed significantly compared to before the pandemic for both new and existing homes amid a lack of sufficient supply.A shortage of homes is widely seen as the biggest issue when it comes to tackling housing affordability in the United States. Construction cratered in the aftermath of the 2008 financial crisis and has struggled to recover to a sufficient level to meet the demand.Housing starts have slumped in 2025 as builders confront cost challenges and a stalled market. Higher rates are also a challenge for construction, which is also impacted by the rising cost of labor and materials.Tariffs have been a double blow for builders, as the uncertainty around them has chilled activity in the housing market and broader economy. Import taxes have also increased the cost of materials used to build homes, making it more expensive for builders to start and complete projects.Tariffs that went into effect last month imposed a 10% tax on all timber and lumber imports, along with a 25% tariff on kitchen cabinet and furniture. The U.S. imports about one-third of its lumber, primarily from Canada, that are also subject to further tariffs.TrendingChampaign County coroner identifies victim in fatal crashChampaign County Coroner Laurie Brauer has identified the individual who died from injuries sustained in a motor vehicle crash near 468 CR 160 N in Champaign, oMinor pleads guilty to first degree murder, stolen vehicle chargesDremone Patterson, 17, has plead guilty to two counts in the case of the death of Keyon Day.Illinois State Police investigating deadly plane crash in Pike CountyOne person is dead after a plane crash in Pike County Sunday night.Edge-Scott Firefighters battling fire at a local residenceEdge-Scott Firefighters are battling a fire at a residence located at106 Dewey St. in Urbana.Champaign police seek public's help in aggravated battery caseChampaign County Crime Stoppers is asking for the public's assistance in an aggravated battery investigation following a shooting on Nov. 17.RELATED:At approxNEWS IN PHOTOS:\"Local\"3Pastor suspects arson in church fire, Champaign Police seek public help with investigation3Illinois State Police investigating deadly plane crash in Pike County3Champaign authorities seek public help to uncover cause of church fire3Vandalia community mourns the tragic loss of 14-year-old Kylie TobermanACCESSIBILITYDownload Our Mobile Apps:Terms & ConditionsCopyright NoticesEEO Public File ReportWRSP FCC InfoWRSP FCC ApplicationsWCCU FCC InfoWCCU FCC ApplicationsPublic File AssistanceContactNews TeamContestsNewsWeatherSportsGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1717, "success": true}