{"full_text": "Skip to main content\nWBUR\nLISTEN LIVE: Fresh Air\nDONATE\n\nSUPPORT WBUR\n\nHomeLocal Coverage\nReport: Affordability gap grows for those seeking starter homes in Greater Boston\nNovember 13, 2025\nKatie Castellani, State House News Service\n\nWhile housing construction is up and home prices have stabilized, researchers expect home buyers and renters will continue to face affordability headwinds in Massachusetts.\n\nHome prices and rents have flattened in 2025 but are still “historically” high, according to a 108-page Greater Boston Housing Report Card 2025 released by The Boston Foundation and Boston Indicators on Wednesday.\n\n“It’s easy to get lost in the numbers of units, permits, and cost burdens, but we must remind ourselves that at the end of the day, we are talking about real homes, families and communities,” Lee Pelton, CEO and president of the foundation, said in a statement.\n\nWhile the gap between who can afford to live in the Greater Boston area and who can’t continues to widen, “these trends are not inevitable,” Pelton said during an event Wednesday where the report was unveiled.\n\n“They reflect choices, policy choices, investment choices and collective priorities that we have the power to change,” he said.\n\nSUPPORT WBUR\n\nThe annual income a household needs to afford an “entry-level” home rose from about $98,000 in 2021 to more than $162,000 in 2025, assuming a 3.5% down payment, according to the report. This trend is squeezing renters out of making the leap to home ownership. Just 15% of renter households can afford an “entry-level” home – down from 30% in 2021.\n\n“The data show just how much work we have to do if we are to expand opportunities and unfreeze the market,” Luc Schuster, executive director of Boston Indicators, TBF’s research arm, said in a statement.\n\nRenters continue to face stiff prices.\n\nThe Greater Boston area has the fifth most expensive rental market in the country in 2025, according to the report, which cited the Zillow Observed Rent Index that tracks changes in market rents across housing types.\n\nNew York, San Jose, San Francisco and San Diego were the only four markets with higher rental prices than Boston. In September 2025, the ZORI found rent for the Boston area was almost $3,000 per month, not including other housing costs like heat, electricity and water.\n\nRents across all neighborhoods within Boston metro core communities have risen since 2022, but increases slowed in some areas since 2024. Also, more than half of renters in Greater Boston are “cost-burdened,” meaning they spend more than 30% of their income on housing. More than one-quarter of renters spend more than 50% of their income on rent, meaning they are considered “severely cost-burdened.” Renters of color are cost burdened at higher levels, according to the report.\n\nThe report also noted that the rates of “cost-burdened” and “severely cost-burdened” may be overstated because the estimates – based on American Community Survey data – might inflate the cost burden for those in subsidized housing. Still, many in the region face affordability pressures.\n\nA shortage of rental units in Boston is one of the main drivers for the city’s high rent prices. While vacancy rates across most major U.S. cities have fallen in the past two decades, Boston’s was particularly low – just 3% in 2024. However, the report noted there are early indicators that vacancy rates may be rising in some neighborhoods with more students, likely because of a drop in international student enrollment under President Trump’s immigration policies.\n\nCensus Address Counts, a dataset from the Census Bureau tracking a list of addresses, show that the Greater Boston area created more than 70,000 homes since 2020, marking a steady increase, according to the report.\n\nSUPPORT WBUR\n\nBut, the best available data on new construction permits, which are seen as a key indicator for future housing construction, have dropped. As of July 2025, the number of new permits issued are 44% below the levels for the same period in 2021. High construction costs and interest rates have made funding projects more difficult and are a key cause of the slowdown, especially when compounded with existing barriers like restrictive zoning, costly building code requirements and lengthy approval processes, according to the report.\n\nThe report noted that declining permitting doesn’t bode well for Gov. Maura Healey’s goal of constructing 220,000 additional homes in the state between 2025 and 2035. Since Healey took office in 2023, 90,400 homes have been “completed, started construction, or proposed,” according to the Executive Office of Housing and Livable Communities.\n\nWhile it looks like the state is making progress on its goal, most of the 90,400 homes were built or permitted before 2025. If the pace of completions between 2023 and 2025 is kept up, Massachusetts would be on track to meet its goal of building 220,000 homes by 2035. But at the current pace of permitting, it’s unlikely the state will meet its construction goal.\n\nMany of the homes recently completed were projects that were likely financed with “historically low” interest rates in the 2010s and 2020s, according to the report. Now, with more tariffs on building materials, workforce challenges and higher borrowing costs, getting projects financed is more difficult.\n\nThere are a lot of “intractable” challenges within government, but housing shouldn’t be one of them, said Lt. Gov. Kimberley Driscoll, during an event Wednesday where the report was unveiled.\n\n”It should not be as hard as it is,\" she said, adding that it’s important for local and state officials as well as housing developers and communities to work together.\n\nDriscoll added the state’s goal of building 220,000 units by 2035 is reachable.\n\nHomelessness hit record high levels in 2024 and dipped slightly in early 2025. However, the report noted that most recent available data was collected in January and may not reflect more recent shifts. Also, emergency assistance caseloads have dropped “dramatically” in 2025 – falling by almost half from January to July, according to the report, which said questions remain about whether those who exited shelters secured permanent housing or fell back into homelessness.\n\nThe report noted several moves by state leaders that contributed to this drop, including capping the shelter system to 4,000 families in July, a move which will take effect Dec. 31. On Aug. 1, the governor also ended the state of emergency she declared in 2023 and closed all remaining hotel shelters.\n\nSUPPORT WBUR\n\nThe report also included a section with research by the Boston University Initiative on Cities on what communities have done to meet requirements outlined in the MBTA Communities Act. The section also includes a case study on how Lexington, Needham and Wellesley responded to the law.\n\nThe act requires 177 cities and towns in the MBTA service area to change their zoning and land use policies to allow for construction of more housing – without requiring more housing to get built. The law has received a lot of media attention over controversy surrounding communities working on creating compliant plans.\n\nEach community has had its own approach to complying with the law, and each faced many options. In 2025, the Executive Office of Housing and Livable Communities has approved plans for 106 municipalities. Another 56 communities are in conditional or interim compliance – meaning their processes are in progress or submissions are under review. Also, 15 communities with deadlines in July 2025 were not compliant as of Sept. 5. and 27 communities have deadlines in December, according to the report.\n\nIndeed, Driscoll said the law has been a “source of inspiration and at times a source of frustration.”\n\nSUPPORT WBUR\n\nSUPPORT WBUR\n\nResume\nLISTEN LIVE\nFresh Air\nContact Us\n(617) 353-0909\ninfo@wbur.org\n890 Commonwealth Ave.\nBoston, MA 02215\nMore ways to get in touch.\nAbout WBUR\nWho We Are\nInside WBUR\nDiversity, Equity And Inclusion\nBoard Of Directors\nCommunity Advisory Board\nCPB Transparency\nCareers\nWBUR Staff\nEthics Guide\nLicensing WBUR Content\nSupport WBUR\nMake A Donation\nVolunteer\nMember Services\nBecome A Member\nDonate Your Car\nJoin The Murrow Society\nBecome A Sponsor\nFollow\nFacebook\nInstagram\nYouTube\nLinkedin\nSubscribe to our weekday newsletter\n\nAdd WBUR to your morning routine\n\nLocal news in one concise, fun and informative email. Explore more WBUR newsletters.\n© Copyright WBUR 2025\nWBUR Privacy Policy\nSyndication\nFCC Applications\nFCC Public File\nWBUR EEO Reports\nPublic File Assistance\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.", "extraction_method": "jina", "word_count": 1395, "success": true}