{"full_text": "Breadcrumb Trail LinksHomeBusinessLocal BusinessReal EstateNewsLocal News\nShare this Story : Housing affordability improving across Canada, but Vancouver remains least affordable: RBC report\nCopy Link\nEmail\nX\nReddit\nPinterest\nLinkedIn\nTumblr Housing affordability improving across Canada, but Vancouver remains least affordable: RBC reportLower interest rates, flat prices and sustained household income gains helping. Further easing likely but at slower paceAuthor of the article:By Gordon Hoekstra Published Oct 12, 2025Last updated Oct 12, 20253 minute read\nJoin the conversation\nYou can save this article by registering for free here. Or sign-in if you have an account.A house for sale in Vancouver. Photo by Arlen Redekop /PNGArticle contentHousing affordability is improving across Canada, including in B.C., but the Vancouver area remains the least-affordable market, according to a report from RBC, Canada’s largest bank.THIS CONTENT IS RESERVED FOR SUBSCRIBERS ONLYSubscribe now to read the latest news in your city and across Canada.Unlimited online access to articles from across Canada with one account.Get exclusive access to the Vancouver Sun ePaper, an electronic replica of the print edition that you can share, download and comment on.Enjoy insights and behind-the-scenes analysis from our award-winning journalists.Support local journalists and the next generation of journalists.Daily puzzles including the New York Times Crossword.SUBSCRIBE TO UNLOCK MORE ARTICLESSubscribe now to read the latest news in your city and across Canada.Unlimited online access to articles from across Canada with one account.Get exclusive access to the Vancouver Sun ePaper, an electronic replica of the print edition that you can share, download and comment on.Enjoy insights and behind-the-scenes analysis from our award-winning journalists.Support local journalists and the next generation of journalists.Daily puzzles including the New York Times Crossword.REGISTER / SIGN IN TO UNLOCK MORE ARTICLESCreate an account or sign in to continue with your reading experience.Access articles from across Canada with one account.Share your thoughts and join the conversation in the comments.Enjoy additional articles per month.Get email updates from your favourite authors.THIS ARTICLE IS FREE TO READ REGISTER TO UNLOCK.Create an account or sign in to continue with your reading experience.Access articles from across Canada with one accountShare your thoughts and join the conversation in the commentsEnjoy additional articles per monthGet email updates from your favourite authorsSign In or Create an AccountEmail AddressContinueor View more offersIf you are a Home delivery print subscriber, online access is included in your subscription.\nActivate your Online Access NowArticle contentThe report says housing affordability is improving because of lower interest rates, flat prices and sustained household income gains.Article contentWe apologize, but this video has failed to load.Try refreshing your browser, ortap here to see other videos from our team.Housing affordability improving across Canada, but Vancouver remains least affordable: RBC report Back to video Article contentHowever, while further improvement in housing affordability is expected, the speed of improvement is likely to slow as the effect of earlier interest rate cuts fade, according to the report by the bank’s assistant chief economist, Robert Hogue.Article contentArticle contentThe improving picture means that a Canadian household earning the median income of $85,400 needed to spend 53.6 per cent of that to cover the costs of owning a home in the last three months of 2025, down from a peak of 63.5 per cent at the end of 2023 but still high by historical standards.Article contentWestcoast HomesStay on top of the latest real estate news and home design trends.There was an error, please provide a valid email address.Sign UpBy signing up you consent to receive the above newsletter from Postmedia Network Inc.Thanks for signing up!A welcome email is on its way. If you don't see it, please check your junk folder.The next issue of Westcoast Homes will soon be in your inbox.We encountered an issue signing you up. Please try againInterested in more newsletters? Browse here.Article contentThat picture is improving in B.C. as well, but the proportion of household income eaten up by housing costs remains high.Article contentIt’s at 89.2 per cent for Vancouver, down from more than 100 per cent in 2024. In Victoria, the affordability measure rose slightly to 69 per cent, but is down from a high of 80 per cent in 2024.Article contentThat’s much higher than in places like Calgary (40.9 per cent), Edmonton (32.2 per cent), Montreal (48.4 per cent) and Ottawa (43.9 per cent). Toronto is at 66.4 per cent.Article contentA decade ago, less than 40 per cent of median income was needed to cover housing. In the early 2000s, it was in the low 30 per cent range.Article contentArticle content“For your average British Columbian, and especially for a household in Vancouver, it is still not an affordable housing market,” Hogue said.Article contentRead More\nLast week's duelling letters on B.C. housing crisis put 5 major issues in spotlight\n'It's practical common sense': Metro Vancouver can't solve cost-of-living crisis without addressing the cost of getting around Advertisement 1Story continues belowThis advertisement has not loaded yet, but your article continues below.Article contentRBC’s housing affordability index shows the proportion of median pre-tax income that would be needed to cover mortgage payments with a 20 per cent down payment, property taxes and utilities based.Article contentHousing affordability is worse for single detached homes.Article contentIn the latest figures for Vancouver, 125.9 per cent of the median household income would be needed to cover housing costs. It is 78.7 per cent in Victoria.Article contentIn B.C., and particularly in the Lower Mainland, housing affordability has been a significant concern for years. The provincial government has taken steps to try to cool housing prices, including introducing measures such as a foreign buyers’ tax and an empty homes tax.Article contentPremier David Eby’s NDP government has also taken control of municipal zoning, done away with public consultation on approved projects and will allow several units to be built on land previously designated for single family use in an effort to increase housing supply.Advertisement 1This advertisement has not loaded yet.Trending Saskatchewan firm's plan to export through Washington state instead of B.C. has David Eby fuming\nColumnists\nVancouver couple's Dungeons and Dragons invention hits viral success\nNews\nAdvertisement 2Story continues belowThis advertisement has not loaded yet, but your article continues below. Two bears captured as search for three bears involved in Bella Coola field trip attack continues\nNews\n'Shocked and sad': B.C. man issues warning after dad scammed out of more than $40,000 in life savings\nNews\nCanadian actor Spencer Lofranco dies in B.C. at age 33\nNews\nAdvertisement 2AdvertisementThis advertisement has not loaded yet, but your article continues below.Article contentHogue said some of these policy measures have seen some success.Article contentBut he noted that while there has also been a genuine effort to grow the housing supply, it is not anywhere strong enough to satisfy demand.Article content“This is going to take a very long time to address,” noted Hogue. “And, so, we urge all policymakers to keep at it and to continue to explore various ways to reduce construction costs.”Article contentHe said the federal government’s new Build Canada program could be helpful if it focuses on much-needed “deeply” affordable housing units.Article contentPrime Minister Mark Carney’s Liberal government announced that a new federal agency will be tasked with building more affordable homes with an initial budget of $13 billion, meant to offer financial incentives, bulk permitting and access to federal lands.Article contentThomas Davidoff, an economics professor at the University of B.C.’s Sauder School of Business, said even with housing affordability improving,  affordability remains “pretty” terrible.Article contentArticle contentThat’s led to a bid-ask spread between listing prices and what buyers are willing and able to pay, said Davidoff, director of the UBC centre for urban economics and real estate.Article content“And so we’ve got very, very slow transactions,” he said.Article contentDavidoff said policies enacted in B.C., including stricter regulations on Airbnb rentals, have helped cool housing prices.Article contentBut there is possibly more that could be done such as finding a way to tax high-value homes that have occupants not paying any income tax, he said.Article contentThat would also put pressure to have those homes come on the market and potentially be re-developed at higher densities, noted Davidoff.Article contentghoekstra@postmedia.comArticle contentx.com/gordon_hoekstraArticle contentShare this article in your social network\nShare this Story : Housing affordability improving across Canada, but Vancouver remains least affordable: RBC report\nCopy Link\nEmail\nX\nReddit\nPinterest\nLinkedIn\nTumblr CommentsYou must be logged in to join the discussion or read more comments.Create an AccountSign in\nJoin the Conversation Postmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information.Featured Local Savings", "extraction_method": "beautifulsoup", "word_count": 1451, "success": true}