{"full_text": "The Trump administration is moving forward with a plan to introduce a 50-year fixed-rate mortgage, a reform officials believe could make homeownership more feasible for millions of Americans amid soaring prices and mounting affordability concerns.​Recommended Video“Thanks to President Trump, we are indeed working on The 50-year Mortgage – a complete game changer,” Federal Housing Finance Agency Director Bill Pulte said Saturday in a statement released on social media. His announcement came after Trump shared a graphic online comparing his proposal to the 30-year mortgage policies championed by President Franklin D. Roosevelt during the New Deal.​With 30-year fixed rates remaining stuck above 6% for more than three years, high homeownership costs have kept many would-be homebuyers out of the market. According to Redfin data, the median U.S. household is currently spending approximately 39% of its monthly income on mortgage repayments—well above long-term affordability benchmarks.​Meanwhile, the “lock-in effect” has prevented many prospective sellers from putting their homes on the market because they don’t want to give up the ultra-low rates they secured before borrowing costs jumped in 2022. The result has been housing market gridlock that’s putting ownership out of reach for younger Americans and worsening overall affordability. As buyers seek alternatives amid elevated rates and unprecedented home values, adjustable-rate mortgages are in more demand and now account for 10% or more of mortgage applications, the highest since 2021, according to the Mortgage Bankers Association.Pulte has blamed Federal Reserve Chairman Jerome Powell, who hiked interest rates to curb inflation but has since resumed easing cautiously, saying on X.com that he is keeping rates “artificially high.”He also said the administration is “laser focused on ensuring the American Dream for YOUNG PEOPLE and that can only happen on the economic level of homebuying. A 50 Year Mortgage is simply a potential weapon in a WIDE arsenal of solutions that we are developing right now. STAY TUNED!” How a 50-year mortgage would work—or notAt its core, the proposed 50-year loan product targets lower monthly payments by extending the standard amortization period. For instance, Fannie Mae’s calculator estimates that, for a $400,000 home at a 6.575% interest rate with 20% down, the monthly principal and interest would be $2,788 on a 30-year fixed, $2,640 for 40 years, and $2,572 for 50 years. ​But critics warn the risks are significant. Extending mortgages to 50 years would increase total interest paid and slow the buildup of home equity, potentially trapping borrowers in debt for a lifetime. Economist Tyler ​Cowen, of the influential blog Marginal Revolution, put the idea into GPT-5 and came back with the takeaway that a government‑backed 50‑year mortgage would “likely lower monthly payments but raise house prices, slow equity build‑up (and raise default risk in downturns), and increase interest‑rate risk in the financial system.” In the short run, this would see sellers and incumbent owners capturing much of the benefit while first‑time buyers face higher entry prices.The situation now is far from optimal, though. The average age of the first-time homebuyer keeps being pushed higher amid the turbulent housing market of the last several years. Recently, the National Association of Realtors found that it was 40 years old in 2025, the highest ever. As ResiClub’s Lance Lambert noted in a statement to Fortune, that means the typical first-time homebuyer is just as close to collecting Social Security as they are to graduating from high school.Pulte floats Fannie, Freddie buying stocksThe 50-year mortgage proposal came amid a flurry of posts from Pulte, a member of one of America’s most prominent homebuilding families, who was fresh off a Friday appearance at ResiDay, a residential real estate conference hosted by ResiClub. Pulte said, without disclosing details, that Fannie Mae and Freddie Mac would seek to take equity stakes in private-sector companies in a manner similar to the unprecedented deal with Intel months earlier.“We hold all the cards,” Pulte told ResiClub about Fannie and Freddie, which have been under government conservatorship since the Great Financial Crisis of 2008. “[We] will probably take ownership in different companies by virtue of companies offering them equity in exchange for Fannie and Freddie doing smart business constructs with them,” he said, likening it to Intel.", "extraction_method": "beautifulsoup", "word_count": 692, "success": true}