{"full_text": "Skip to Content  \n \n \n \n \n  \n \n\n\nStaff Applications \nContact \nAbout \n \nBoard of Directors \nStaff Training \nCode of Ethics \nStandards   \nDonate \nAdvertising \nPrint Edition \nTips \nArchive \nPress \n \nSemester in Review   \nMeet our Staff  \n \n More \n         \n \n \n \n \n  \n  \n  \n \nThe Daily Free Press     \n \n    \n \n \n \n \n \n  \n  Facebook    \n  Instagram    \n  X      \n \n \n The Independent Student Newspaper at Boston University.    \n \n \n \n \n Search this site  \nSubmit Search        \n \n \n \n \n  \n \n\n\nNews \n \nCampus \nCity   \nFeatures \n \nArts & Entertainment \nCommunity \nBusiness & Tech \nScience   \nSports \n \nBoston Hockey Blog \nBasketball \nClub Sports \nColumnists \nCross Country \nField Hockey \nLacrosse \nSoccer \nSoftball \nTrack and Field   \nOpinion \n \nColumns \nEditorial \nLetter from the Editor \nLetters to Editor \nOp-Ed   \nLifestyle \n \nAsk Abby   \nVisuals \n \nPhoto \nMultimedia   \nInvestigative \n \nUpdates   \nGames \n \nCrossword \nMini Crossword \nNews Quiz    \n \n More \n       \n\n\n\n\n\nBU students rally outside Gilliam’s house, demand sanctuary campus\nNovember 24, 2025\n\n\n\n‘The community is here for us’: Amid federal immigration crackdown, Allston-Brighton locals speak out for immigrant-owned restaurants, grocers\nNovember 20, 2025\n\n\n\nBoston’s housing crisis deepens as costs rise, relief stalls\nNovember 20, 2025\n\n\n\n‘The crisis is not over’: Boston food pantries gear up to provide Thanksgiving meals to families in need\nNovember 20, 2025\n\n\n\nBU administration to replace CGS professors abroad with adjuncts\nNovember 20, 2025\n\n\n\n\nBU students rally outside Gilliam’s house, demand sanctuary campus\nNovember 24, 2025\n\n\n\nBU administration to replace CGS professors abroad with adjuncts\nNovember 20, 2025\n\n\n\nBU School of Law temporarily transitions to a 24-hour swipe access\nNovember 20, 2025\n\n\n\nBBYDSA launches community defense program to verify ICE sightings\nNovember 19, 2025\n\n\n\nRev. Warnock preaches social equity and resilience at Marsh Chapel’s 75th anniversary service\nNovember 19, 2025\n\n\n\n\n‘The community is here for us’: Amid federal immigration crackdown, Allston-Brighton locals speak out for immigrant-owned restaurants, grocers\nNovember 20, 2025\n\n\n\nBoston’s housing crisis deepens as costs rise, relief stalls\nNovember 20, 2025\n\n\n\n‘The crisis is not over’: Boston food pantries gear up to provide Thanksgiving meals to families in need\nNovember 20, 2025\n\n\n\nCity Council recognizes Transgender Day of Remembrance, addresses closures of CVS and Walgreens\nNovember 19, 2025\n\n\n\nGreater Boston Collaborative Food Access Hub celebrates first year amid federal neglect\nNovember 18, 2025\n\n\n\n\nMore than a meme: Who is Angel Wiley?\nNovember 18, 2025\n\n\n\nBrookline food organizations step up to help families impacted by SNAP cuts\nNovember 18, 2025\n\n\n\nStudents Rally for Light, Truth, Courage demonstration urges Boston students to fight for protection of higher education\nNovember 18, 2025\n\n\n\nNew York Times guest speaker encourages journalism students to pursue passion despite industry changes at COM talk\nNovember 18, 2025\n\n\n\nThings to do this week in Boston: Nov. 17-23\nNovember 16, 2025\n\n\n\n\nREVIEW: Katseye was aptly beautiful, but chaotic at their third tour stop\nNovember 20, 2025\n\n\n\nFirst-ever Cambridge Record Fair aims to make vinyl collecting accessible to all\nNovember 20, 2025\n\n\n\nalmost monday brings sunny sounds to Boston\nNovember 20, 2025\n\n\n\n‘An ode’ to Penn Station: BU COM professor premieres latest film ‘The Petal Pusher’\nNovember 15, 2025\n\n\n\nCFA exhibition ‘Hidden in the Layers’ conveys meaning beneath material form\nNovember 12, 2025\n\n\n\n\nThe penny is dead. Local businesses, customers weigh in on the coin’s value.\nNovember 24, 2025\n\n\n\nBU researcher examines economic effects of legalized gambling, students reflect\nNovember 18, 2025\n\n\n\nLooking back at efforts from Boston businesses, nonprofits to aid SNAP recipients amid government shutdown\nNovember 14, 2025\n\n\n\n‘We need better communication’: MISI summit tackles climate communication crisis, marks center’s opening\nNovember 9, 2025\n\n\n\nWhy are brands becoming more ‘casual’ on social media? BU students, faculty weigh in.\nNovember 7, 2025\n\n\n\n\nBU alum gives insight into founding mental health practice, making resources accessible to communities of color\nNovember 24, 2025\n\n\n\nBU researchers hit the road, traveling along coast to study oysters, engage local communities\nNovember 18, 2025\n\n\n\nMental health study co-led by BU professor finds college student mental health improves for third year in a row\nNovember 14, 2025\n\n\n\nHigh school student teams up with BU professor to lift the weight off students’ shoulders\nNovember 12, 2025\n\n\n\nBU professor develops affordable, flexible wireless MRI coils, named among TIME’s ‘Best Inventions of 2025’\nNovember 11, 2025\n\n\n\n\nGALLERY: A rivalry showdown — BU claims victory over Northeastern\nNovember 23, 2025\n\n\n\nThe Heat Check: The Legacy of Nico Harrison\nNovember 19, 2025\n\n\n\nPound-for-Pound: Wrestling is in and here to stay — whether you like it or not\nNovember 19, 2025\n\n\n\nThe Extra Point: We might be witnessing more than a Legion of Boom revival\nNovember 19, 2025\n\n\n\n19 point deficit proved too steep a mountain to climb in Men’s Basketball’s 49-54 loss to Columbia\nNovember 19, 2025\n\n\n\n\nThe Heat Check: The Legacy of Nico Harrison\nNovember 19, 2025\n\n\n\nFull Court Press: The future is now for the Philadelphia 76ers\nNovember 10, 2025\n\n\n\nThe Heat Check + Full Court Press: The casino-sized elephant in the room\nOctober 30, 2025\n\n\n\nCeltics inaugurate 2025-26 season, fans reflect on tight loss to Philadelphia in TD Garden opener\nOctober 28, 2025\n\n\n\nThe Heat Check: West is best this season, and it’s not close\nOctober 21, 2025\n\n\n\n\nMen’s club soccer gears up for fifth semi-annual Beanpot Tournament as defending champions\nMarch 21, 2025\n\n\n\nClub sports create community at BU\nJune 7, 2023\n\n\n\nFigure skating looks to win sixth Intercollegiate National Championship, placed first in season opening competition\nNovember 29, 2022\n\n\n\nBU Flag Football club grows community with DREAM collaboration\nOctober 26, 2022\n\n\n\nClub sports teams embrace return to normalcy\nSeptember 21, 2021\n\n\n\n\nThe Heat Check: The Legacy of Nico Harrison\nNovember 19, 2025\n\n\n\nPound-for-Pound: Wrestling is in and here to stay — whether you like it or not\nNovember 19, 2025\n\n\n\nThe Extra Point: We might be witnessing more than a Legion of Boom revival\nNovember 19, 2025\n\n\n\nPayoff Pitch: These outside-the-box offseason trade ideas might just make sense\nNovember 18, 2025\n\n\n\nThe Brake Point: Rookie revolution — how fresh faces are shaking up the grid\nNovember 11, 2025\n\n\n\n\n‘Part of a team’: BU cross country stars from Sweden, Poland reflect on American sports culture\nDecember 6, 2024\n\n\n\nMixed results as Terriers return to action\nSeptember 14, 2023\n\n\n\nCross country teams poised to outrun competition in 2023\nSeptember 6, 2023\n\n\n\nCross Country teams fall short at Regionals meet, look forward to track and field\nNovember 18, 2022\n\n\n\nCross country teams fall short in Patriot League Championship, prepare for Regionals\nNovember 7, 2022\n\n\n\n\nField hockey gets first Patriot League win of the season against turnpike rivals Holy Cross\nSeptember 29, 2025\n\n\n\nField hockey falls to Cornell 2-1, looks to PL Semifinal after regular season finale\nNovember 4, 2024\n\n\n\nField hockey defeats Colgate 3-1, clinches spot in Patriot League Tournament\nOctober 20, 2024\n\n\n\nField hockey falls to crosstown rival Northeastern in 4-2 loss\nOctober 16, 2024\n\n\n\nField hockey’s two-game win streak snapped by 2-1 loss to Harvard\nOctober 7, 2024\n\n\n\n\nTerriers defeat Lafayette Leopards 12-10 in thrilling conference semifinal\nMay 6, 2025\n\n\n\nWomen’s Lacrosse falls on the road to Colgate, extending losing streak to four games\nApril 16, 2025\n\n\n\nWomen’s lacrosse celebrates seniors, loses third consecutive game\nApril 13, 2025\n\n\n\nCrosse-Eyed: Boston dominates professional lacrosse with some hometown help\nMarch 31, 2025\n\n\n\nMen’s lacrosse holds Holy Cross scoreless for more than three quarters in 16-4 win\nMarch 30, 2025\n\n\n\n\nWomen’s soccer rakes in season awards, thrives in conference play despite loss in final\nNovember 14, 2025\n\n\n\nDespite Saadat’s penalty save, men’s soccer drops out of Patriot League tournament in semifinal\nNovember 12, 2025\n\n\n\nWomen’s soccer unable to get past final hurdle, loses in Patriot League final to Army West Point\nNovember 10, 2025\n\n\n\nChasing Points: The fall of a champion — what’s going on with Liverpool FC?\nNovember 10, 2025\n\n\n\n‘Job’s not done’: Five-point game from Bonnington sends men’s soccer to fourth-straight semifinal\nNovember 9, 2025\n\n\n\n\n‘In the end, it was a lot sweeter’: BU Softball ends year in Patriot League threepeat\nJune 6, 2025\n\n\n\nSoftball head coach Ashley Waters celebrates 10 years at BU, reflects on decade of titles, awards, positive influence\nApril 4, 2025\n\n\n\nSoftball looks ahead to third consecutive conference title, this time with a roster of newcomers\nFebruary 3, 2025\n\n\n\nSoftball sweeps Bucknell in defensive clinic, extends win streak to 13\nApril 22, 2024\n\n\n\nSoftball extends their winning streak to five over UMass in 2-0 pitcher’s duel\nApril 11, 2024\n\n\n\n\nRaising the bar: Alli Lofquist breaks two pole vaulting records, looks forward to Outdoor Championships\nMay 2, 2025\n\n\n\nRunning around the world: Sjöberg and Malleck to compete at World Indoor Athletic Championships\nMarch 21, 2025\n\n\n\nMen’s track and field finishes top three, women’s takes title in Patriot League Indoor Championships for first time in nine years\nMarch 3, 2025\n\n\n\nGrant Cartwright promoted to BU track and field, cross country director\nJuly 2, 2024\n\n\n\nBU hosts DMR races, University of Washington sets new collegiate record\nFebruary 6, 2023\n\n\n\n\nIt’s not called “Thanksgiving.” | The Anti-Imperialist Club\nNovember 24, 2025\n\n\n\nWhen hashtags turn into high stakes: lessons from Nepal’s streets | Zoomed In\nNovember 24, 2025\n\n\n\nThe STEM vs. humanities debate | Thinking Out Loud\nNovember 23, 2025\n\n\n\nThe Plan B after Plan B | Data Driven\nNovember 23, 2025\n\n\n\nNot endorsing Chi Ossé is a worrying sign for the Zohran mayoralty and anti-blackness within the NY-DSA | The Dissenting Opinion\nNovember 23, 2025\n\n\n\n\nIt’s not called “Thanksgiving.” | The Anti-Imperialist Club\nNovember 24, 2025\n\n\n\nWhen hashtags turn into high stakes: lessons from Nepal’s streets | Zoomed In\nNovember 24, 2025\n\n\n\nThe STEM vs. humanities debate | Thinking Out Loud\nNovember 23, 2025\n\n\n\nThe Plan B after Plan B | Data Driven\nNovember 23, 2025\n\n\n\nNot endorsing Chi Ossé is a worrying sign for the Zohran mayoralty and anti-blackness within the NY-DSA | The Dissenting Opinion\nNovember 23, 2025\n\n\n\n\nPolitics or performative professionalism? | Editorial\nNovember 14, 2025\n\n\n\nPopular leftist politics are here. Democrats will do anything to stop them. | Editorial\nOctober 24, 2025\n\n\n\nComplicity is neutrality’s long shadow | Editorial\nOctober 7, 2025\n\n\n\nWhat can the rising price of higher education actually buy? | Editorial\nSeptember 19, 2025\n\n\n\nBU admin’s silencing of student protest isn’t rare — it’s routine | Editorial\nSeptember 11, 2025\n\n\n\n\nVideo: MLK Antiwar Sermon Public Reading 5-2-23\nMay 8, 2023\n\n\n\nVideo: March for Our Lives Rally 4-4-23\nApril 18, 2023\n\n\n\nVideo: BU Worker’s Rally 10-18-18\nOctober 20, 2018\n\n\n\nHUBweek 2018 Silent Disco\nOctober 14, 2018\n\n\n\n\nLetter to the Editor: Faculty letter to President Brown regarding BU professor’s denied tenure\nMay 1, 2023\n\n\n\nLetter to the Editor: President Brown’s State of the University message left out most of BU’s faculty\nNovember 15, 2022\n\n\n\nLetter to the Editor: An open letter on Boston University’s climate for LGBTQIA+ students\nNovember 11, 2022\n\n\n\nLetter to the Editor: Response to ‘A Letter to Dean Bizup’\nAugust 13, 2020\n\n\n\nLetter to the Editor: An open apology from some random kid in a frat\nApril 20, 2018\n\n\n\n\nOP-ED: An open letter to the Boston University community from the captains of the BU Cross Country team\nNovember 21, 2025\n\n\n\nOP-ED: We deserve a better bike lane in front of Warren Towers\nOctober 7, 2025\n\n\n\nOP-ED: You should skip class\nSeptember 2, 2025\n\n\n\nOP-ED: Family first, or America last\nApril 30, 2025\n\n\n\nOP-ED: BU hockey’s reputation alone isn’t enough to sustain a community\nApril 21, 2024\n\n\n\n\nThe archetype of the shy bride: an analysis of bridal expectations in the Indian subcontinent\nNovember 24, 2025\n\n\n\nDo we really not deserve what happens to us?\nNovember 22, 2025\n\n\n\nA stressed girl’s guide to a phone-free weekend\nNovember 20, 2025\n\n\n\nThe dos and don’ts of Friendsgiving | Kit’s Kitchen\nNovember 20, 2025\n\n\n\nWhen I grow up | Thought Daughters\nNovember 19, 2025\n\n\n\n\nImpressing the parents: A neighborhood guide to the best restaurants in Boston\nOctober 17, 2024\n\n\n\nHot sauce: The secret ingredient to a familial bond\nApril 14, 2024\n\n\n\nYour topical guide to East Boston’s food scene\nApril 2, 2024\n\n\n\nTurning the tables on American table-turning food culture\nMarch 27, 2024\n\n\n\nYour gluten-free guide for a no wheat Boston sweet\nFebruary 15, 2024\n\n\n\n\nGALLERY: Modest Mouse return to Boston for 2025 fall tour\nOctober 21, 2025\n\n\n\nThe Daily Free Pod: Orientation Special S1 E1\nSeptember 23, 2024\n\n\n\nTerrier Hockey Talk: May 12, 2023\nMay 12, 2023\n\n\n\nVideo: MLK Antiwar Sermon Public Reading 5-2-23\nMay 8, 2023\n\n\n\nUnmasked: how do you unwind?\nMay 4, 2023\n\n\n\n\nGALLERY: A rivalry showdown — BU claims victory over Northeastern\nNovember 23, 2025\n\n\n\nREVIEW: Katseye was aptly beautiful, but chaotic at their third tour stop\nNovember 20, 2025\n\n\n\nalmost monday brings sunny sounds to Boston\nNovember 20, 2025\n\n\n\nGALLERY: Wombats rock the House of Blues\nNovember 17, 2025\n\n\n\nGALLERY: Fall sports through our lens.\nNovember 14, 2025\n\n\n\n\nBoston Police Dept. continually hamstrung by systemic failures, investigation shows\nNovember 14, 2025\n\n\n\nBU faculty resist University directives to remove public-facing pride flags\nSeptember 19, 2025\n\n\n\nPursuing the truth: A look back at the essential work of The Daily Free Press investigative team\nJune 6, 2025\n\n\n\n‘The silence is deafening’: Boston University community reacts to DEI changes, national pressure\nMay 2, 2025\n\n\n\nBU is suffering from ‘unsustainable’ budget practices, University officials say\nMay 2, 2025    \n \n \n \n \n \n \n \n \n \n November 14‘I don’t want him on my campus’: BU community demands administrative action after BUCR president says he called ICE to raid Allston Car Wash          \n  \n \n \n \n \n \n \n  Open Navigation Menu    \n  \n \n \n   \n The Daily Free Press   \n\n\nAbout \nContact \nAdvertising \nTerms of Use \nJoin Our Staff! \nDonate \nBoard of Directors  \n \n More \n       \n  \n \n \nThe Daily Free Press     \n \n \n \n  Open Search Bar    \n \n \n \n Search this site  \nSubmit Search        \n  \n \n \n \n \n \n \n  Open Navigation Menu    \n  \n \n \n   \n The Daily Free Press   \n\n\nAbout \nContact \nAdvertising \nTerms of Use \nJoin Our Staff! \nDonate \nBoard of Directors  \n \n More \n       \n  \n \n \nThe Daily Free Press     \n \n \n \n  Open Search Bar    \n \n \n \n Search this site  \nSubmit Search        \n     \n \n \n \n Categories:  \n\nCity\nNews  \n Boston city councilors propose measures to tackle housing affordability crisis ahead of local elections \n \n By Grace Whinnery • November 3, 2025    \n \n \nBoston City Council members have proposed numerous ways to address the housing affordability crisis, which has been identified as a key issue for voters in the upcoming municipal election. \n\nApartment buildings on Park Drive in Fenway, located in Boston’s District 8. City Councilor Sharon Durkan for District 8 is working with other councilors on PLAN: Downtown to bring more affordable housing to the area. (ANNIKA MORRIS) \nThe average rent in Boston for a one-bedroom apartment is $3,452 a month, compared to the national average of $1,631 a month, according to Apartments.com The price of an average single-family home in Massachusetts increased 74% from 2016 to 2024, according to the Federal Reserve Bank of Boston. \n“The cost of housing is rising in our neighborhoods,” said City Councilor Sharon Durkan, who represents district 8, which includes Boston University. “It’s something that I hear from residents every day at my office hours, residents are being priced out.” \n12% of Boston voters believe housing affordability is the most important issue facing the United States, according to Emerson College polling. \nDurkan said the council has been taking “bold steps” to allow for the development of more housing.  \nSome of the steps Durkan emphasized included amending the zoning code to make housing an allowed use in the Bullfinch Triangle, an area in Boston nestled between the West and North Ends, as well as the PLAN: Downtown initiative to bring more affordable housing to the Downtown area. \nDurkan’s platform supports planning for “abundance” in Boston housing. \n“[Abundance is] about saying yes to new people moving into the city,” Durkan said. “It’s about saying yes to new neighbors, and yes to making sure that our communities and the people that want to live there can stay there.”  \nCity Councilor Ed Flynn said the city needs to increase the supply of affordable housing units to help address the housing crisis. \n“I’ve been a strong advocate for increasing affordable housing, veteran’s housing [and] family-size units to help working families remain in the city,” Flynn said. \nOther initiatives to allow for more housing include At-Large City Councilor Henry Santana’s proposed expansion of triple decker housing. Current zoning laws limit many buildings to two and a half stories, preventing the construction of triple-deckers. \nAs another strategy to address the housing affordability crisis, Santana, along with City Councilors Benjamin Weber and Enrique Pepén, none of whom decided to comment, sponsored a resolution in support of a rent control measure on the 2026 ballot. The initiative, filed by Homes For All Massachusetts, would reverse the statewide ban on rent control passed in 1994. \nTamara Small, CEO of NAIOP Massachusetts, an association representing the interests of the real estate industry, said rent control measures would be detrimental to the development of more housing statewide. \n“We are already getting calls from investors all over the world who have heard about this proposal, and they have said if rent control is adopted, then it’s really going to kill housing production in Massachusetts,” Small said.  \nCity Councilor Brian Worrell, in a city council meeting Oct. 29, proposed a plan to increase taxes on large and luxury apartment buildings and decrease tax bills for small landlords and average homeowners. \n“Homeowners and small landlords are carrying a heavier load while larger apartment owners often pay less taxes per unit,” Worrell said in the hearing. \nDurkan said she opposes Worrell’s proposal, calling it a “gut-punch at the wrong moment” for housing development. \n“[The proposal] really places undue burden on dense areas,” Durkan said, “If we’re trying to encourage housing production and density in the city of Boston … it really doesn’t fit with the city’s goals at the moment.” \nSmall also disagreed with Worell’s proposal, and said expenses would get pushed on tenants and would “dramatically disincentivize any type of investment in Boston housing development.” \nHilary Pizer, director of Organizing and Policy at the Massachusetts Affordable Homeownership Alliance, wrote in support of Worrell’s policy in a statement to the Daily Free Press.  \n“MAHA strongly supports this proposal that offers property tax relief to homeowners being squeezed by rising costs,” Pizer wrote. “When you own the home you live in, it’s your shelter, and eventually your nest egg. It should be taxed at the lower residential rate.”    \n \n \n \n   View Story Comments  \n \n \n \n 0    Like This Story   \n \n    Share on Facebook   \n \n    Share on X   \n \n    Email this Story   \n \n    Print this Story   \n  \n \n Leave a Comment  \n Tags:  \n\naffordable housing\nBoston City Council\nBoston municipal elections\ncity councilor benjamin weber\nCity Councilor Brian Worrell\nCity Councilor Enrique Pepén\nCity Councilor Henry Santana\nCity Councilor Sharon Durkan\nMassachusetts Affordable Homeownership Alliance\nnaiop\nrent control  \n \n \n \n \nDonate to The Daily Free Press  \n \nYour donation will support the student journalists of Boston University. Your contribution will allow us to purchase equipment and cover our annual website hosting costs.  \nDonate \n    \n \n \nMore to Discover \n\n\n \n \n  \n \n More in City  \n \n \n \n \n    \n ‘The community is here for us’: Amid federal immigration crackdown, Allston-Brighton locals speak out for immigrant-owned restaurants, grocers    \n \n \n \n    \n Boston’s housing crisis deepens as costs rise, relief stalls    \n \n \n \n    \n ‘The crisis is not over’: Boston food pantries gear up to provide Thanksgiving meals to families in need    \n \n \n \n    \n City Council recognizes Transgender Day of Remembrance, addresses closures of CVS and Walgreens    \n \n \n \n    \n Greater Boston Collaborative Food Access Hub celebrates first year amid federal neglect    \n \n \n \n    \n ‘Trump, end war on immigrants:’ Allston community bands together for rally against local ICE arrests      \n \n \n More in News  \n \n \n \n \n    \n BU administration to replace CGS professors abroad with adjuncts    \n \n \n \n    \n BU School of Law temporarily transitions to a 24-hour swipe access    \n \n \n \n    \n BBYDSA launches community defense program to verify ICE sightings    \n \n \n \n    \n Rev. Warnock preaches social equity and resilience at Marsh Chapel’s 75th anniversary service    \n \n \n \n    \n New ‘AI at BU’ course gives student opportunity to develop skills, understand ethics    \n \n \n Advocates demand increased road safety, honor traffic crash victims on Statehouse steps           \n  \n \n \n \n \n \n \n  \n \n\n\nAbout \nContact \nAdvertising \nTerms of Use \nJoin Our Staff! \nDonate \nBoard of Directors        \n  \n  \n  \n  \n© 2025 • FLEX Pro WordPress Theme by SNO • Log in        \n \n \n \nDonate to The Daily Free Press \n  \n \n \n Full Name (as appears on credit card)   \n Email   \n \n  I would like to remain anonymous. (Name will only be used to verify billing.)   \n Donation Amount  $10 $15 $25 $50 Other   \n Custom Donation Amount \n  \n \n Card Details \n  \n   I agree to the terms of service.  \n\n \n \n \nSubmit Donation    \n \nSubmitting donation...  \n \n  \n \n \nThere was an issue submitting your request.    \n \n \n \n \n\nComments (0)  \n Share your thoughts...  \n All SNO Design Snapshots Picks Reader Picks Sort: Newest  \n \n \n Cancel reply\n\nYour email address will not be published. Required fields are marked *\nComment * \nSpam Control Field.Verification Field.\n\nName *  \nEmail *  \n        \n \nClose \n  \n \nClose Modal Window \n  \n \nClose", "extraction_method": "jina", "word_count": 3340, "success": true}