{"full_text": "As a new NAMB president takes office, his suggestions for helping solve the affordability crisis\nBy\nMatt Sexton\n06 Oct 2025\nShare\nThe last time Kimber White became president of the National Association of Mortgage Brokers (NAMB), a global pandemic forced him to recalibrate his goals to deal with an unprecedented situation.\nThis time, as White (pictured top) takes over as NAMB president, he will be able to implement his agenda without COVID-19 getting in the way. That doesn’t mean there aren’t pressing issues for him to deal with.\nOne of the pressing issues that mortgage brokers nationwide face is the challenge of housing affordability. All buyers are struggling, but the issue is especially damaging to low-income and first-time homebuyers.\nWhite hopes to have conversations at the congressional and Federal Housing levels to help improve affordability. One area where these conversations can begin is with loan-level price adjustments (LLPAs). This is where additional charges are added to a loan based on a borrower’s credit score, loan-to-value (LTV) ratio, property type, occupancy status, and loan purpose.\n“The last FHFA Director said to me when we met face to face, ‘Oh, we're doing these loan-level price adjustments because investors and these second home people, they have to have skin in the game, to make skin in the game,’” White told Mortgage Professional America. “What you did was take the ability of that first-time buyer and of that second home buyer, which is that mom and pop who worked all of their lives to buy a retirement home out of their hands.\n“You've actually made your housing issues worse by doing what you did by adding those loan-level pricing adjustments to second homes and investments. All you did was strip it out of the average middle working class, the small, independent person, and you put it in the hands of corporate America, making the housing crisis worse.”\nChanges to LLPAs\nHe also noted that because of the way LLPAs are charged, the average working American who makes more than 80% of the area median income (AMI) with a higher credit score actually pays more fees.\n“The other thing they can do is, if you make more than 80% of the AMI and your credit score is above a certain amount, you're penalized versus someone who has a lower credit score and is 80% under AMI,” White said. “You're basically penalizing the average group of working Americans with the loan level price adjustments, which I call another consumer tax. Just get rid of that.”\nFor White, it’s not enough for the government to declare a housing emergency. It comes down to actually finding solutions that can make housing more affordable for everyone.\n“I want to be a part of that conversation,” he said. “That's why I'm hoping that we have our lobbyists and make sure that when they start talking and all the programs that are coming out, that we're not just declaring something that's a crisis. Hell, we all know it's a crisis. I'm a firm believer that I want to find solutions, and not everything will work, and the government works slowly. At least start taking baby steps and finding solutions that make sense.”\nWhile he would like to see LLPAs go away completely, even a reduction could significantly improve affordability.\n“I'd love to see them get rid of it totally,” he said. “I'd love to see that happen. But reduce it some. You can spur the economy by reducing some of the LLPA and the revenue that you're going to lose, you're going to make it up, because you're going to have people buying homes again that are actually caring about the real American Dream.\"\n‘Bank of Mom and Dad’ is closed\nWhite said a recent trip to Europe reminded him of another challenge facing first-time homebuyers compared to their European counterparts. In large part, due to economic challenges, this generation’s parents don’t have the means to help their children buy their first home.\n“I was over in Europe, and I got to speak to seven other countries at an international mortgage brokers federation conference, and most of the people over there still have their families able to help give them money,” White said. “We don't have that today. I'm a boomer myself. I'm not in a position, or most people, to give their kids or their grandkids the money like we used to, because we've spent our money through the crashes.”\nBecause the younger generations aren’t getting that help from family members, it is delaying their ability to start building generational wealth. It initiates a cycle where the process becomes increasingly delayed with each generation, resulting in effects that can persist for several generations.\n“They can't afford a home, they can't save, and we have got the largest wealth inequality gap since I've been in this business in 39 years,” White said. “In the 80s, the interest rates may have been 16% but the difference was that the per capita income kept up with that inflation at that house. Today, it's not like that. Housing prices, taxes, and insurance have outpaced the average income of borrowers.”\nKristi Hardy of Atlantic Coast Mortgage says uncertainty around federal job security could cause buyers to pause, but DC’s housing shortage and resilience remain steady. Her message: stay calm, guide clients, and remind them this too shall pass.https://t.co/ZP5HnL874f\n— Mortgage Professional America Magazine (@MPAMagazineUS) October 2, 2025\nThe inability of people to buy a home eventually becomes a belief that they will never be able to. This means there is no opportunity to create generational wealth, and it can also cause psychological damage.\n“The first-time buyer who can't afford to buy a house, they don't think they'll ever buy a house,” White said. “You're not just getting away from the American Dream. You're getting away from the backbone of the American economy. A home is the biggest builder that someone can have, and it is the biggest source of self-worth. It's going to cause a crisis of lack of fulfillment, of self-worth and lack of feeling that they belong.”\nStay updated with the freshest mortgage news. Get exclusive interviews, breaking news, and industry events in your inbox, and always be the first to know by subscribing to our FREE daily newsletter.", "extraction_method": "beautifulsoup", "word_count": 1047, "success": true}