{"full_text": "Follow Us\nWatch Now\nSubscribe\nOPINION\nNEWS\nREGIONS\nWORLD\nBUSINESS\nSPORTS\nENTERTAINMENT\nLIFESTYLE\nTHE SUNDAY TIMES\nMORE\nOPINION\nNEWS\nREGIONS\nWORLD\nBUSINESS\nSPORTS\nENTERTAINMENT\nLIFESTYLE\nTHE SUNDAY TIMES\nSPECIAL FEATURES\nSPECIAL SECTIONS\nTMT NEWSWIRE\nMEDIA OUTREACH NEWSWIRE\nPR NEWSWIRE\nGLOBENEWSWIRE\nPLENTISOFT\nFAST TIMES\nLEGAL ADVICE\nCAMPUS PRESS\nVIDEOS\nEXPATS & DIPLOMATS\nPHOTOS\nBUSINESS FORUM\nPODCASTS\nRESOURCES\nWEATHER\nMARKET OVERVIEW\nTHE MANILA TIMES 500\nEXAM RESULTS\nTMT DIGITAL EDITION\nTMT CSI\nTMT 127TH ANNIVERSARY\nQUIZZES\nGAMES\nOPINION\nNEWS\nREGIONS\nWORLD\nBUSINESS\nSPORTS\nENTERTAINMENT\nLIFESTYLE\nTHE SUNDAY TIMES\nSPECIAL FEATURES\nSPECIAL SECTIONS\nTMT NEWSWIRE\nMEDIA OUTREACH NEWSWIRE\nPR NEWSWIRE\nGLOBENEWSWIRE\nPLENTISOFT\nFAST TIMES\nLEGAL ADVICE\nCAMPUS PRESS\nVIDEOS\nEXPATS & DIPLOMATS\nPHOTOS\nBUSINESS FORUM\nPODCASTS\nRESOURCES\nWEATHER\nMARKET OVERVIEW\nTHE MANILA TIMES 500\nEXAM RESULTS\nTMT DIGITAL EDITION\nTMT CSI\nTMT 127TH ANNIVERSARY\nQUIZZES\nGAMES\nTMT Newswire  GlobeNewswire\nReal Estate Firms Cite Housing Affordability and Rising Costs as Biggest Challenges\nBy GlobeNewswire\nNovember 19, 2025\nResize\n\nDespite these obstacles, more firms expect profitability to increase\n\nWashington, Nov. 19, 2025 (GLOBE NEWSWIRE) -- Real estate firms are bracing for continued challenges related to housing affordability and rising industry costs, according to the 2025 Profile of Real Estate Firms published by the National Association of REALTORS® today.\n\nTop challenges for real estate firms:\n\nHousing affordability (56%)\nIndustry costs (36%, up from 34% in 2023)\nLocal economic conditions (35%, up from 34% in 2023)\nDespite these challenges, 38% of firms expect their profitability to increase in 2025, up from 30% in 2023-the last time this survey was conducted.\n\n\"Real estate firms are on the frontlines of the industry and are seeing firsthand how housing affordability and local economic conditions are impacting their clients,” said Jessica Lautz, NAR deputy chief economist. \"Firms are also experiencing the rising cost of running their businesses. While the current real estate market is challenging, the majority of firms expect profitability to at least remain stable.”\n\nGet the latest news delivered to your inbox\nSign up for The Manila Times newsletters\nBy signing up with an email address, I acknowledge that I have read and agree to the Terms of Service and Privacy Policy.\n\nThe report measures characteristics of real estate firms nationwide to determine how they operate and assess what lies ahead. NAR surveyed its broker members to better understand firms’ demographics, composition and characteristics from the executive and manager perspective. \n\nAdditional key findings from the report:\n\nADVERTISEMENT\n\n46% of sales volume is generated from repeat business and 44% from past client referrals.\n35% of firms are actively recruiting- down 5% from 2023.\n81% of real estate firms have a single office (identical to 2023), with two full-time real estate licensees on average (down from three in 2023).\n19 years: The amount of time the average residential firm has been operating (up from 16 years in 2023).\n25 years: The amount of time the average commercial firm has been operating (identical to 2023).\n71% of firms encourage agents to pursue certifications and designations.\n61% of firms encourage agents to take additional training classes.\nAbout the National Association of REALTORS®\n\nThe National Association of REALTORS® is involved in all aspects of residential and commercial real estate. The term REALTOR® is a registered collective membership mark that identifies a real estate professional who is a member of the National Association of REALTORS® and subscribes to its strict Code of Ethics. For free consumer guides about navigating the homebuying and selling transaction processes - from written buyer agreements to negotiating compensation - visit facts.realtor.\n\n# # #\n\nInformation about NAR is available at nar.realtor. This and other news releases are posted in the newsroom at nar.realtor/newsroom. Statistical data in this release, as well as other tables and surveys, are posted in the \"Research and Statistics” tab.\n\nADVERTISEMENT\n\nCONTACT: National Association of Realtors®\n\nmedia@realtors.org\n\nADVERTISEMENT\n\nEDITORS' PICKS\nDSWD cracks down on cash aid cuts\nMalaysia mulls social media ban for under-16s\nAmoroto stuns Chua for All Japan crown\nMarcos worried about 'unrecognizable' Imee\nMelai Cantiveros brings the Bisaya voice to center stage once more\nTRY THE MANILA TIMES PREMIUM\nFREE FOR 14 DAYS\nSUBSCRIBE NOW\nALREADY A SUBSCRIBER?\nLOGIN HERE\nDOWNLOAD THE DIGITAL EDITION APP\nNews\nNation\nRegions\nWorld\nSports\nEntertainment & Lifestyle\nThe Sunday Times\nOpinion\nEditorial\nEditorial Cartoon\nOP-ED Columns\nFrom our Readers\nLegal Advice\nBusiness\nTop Business\nCorporate News\nForeign Business\nSunday Business & IT\nCompany Announcements\nMarket Overview\nSpecial Sections\nSpecial Features\nTMT Newswire\nVideos\nPodcasts\nWeather\nExam Results\nThe Manila Times\nHome Delivery Subscription\nSubscribe to our Digital Edition\nThe Manila Times College\nThe Manila Times Streaming\nThe Manila Times Forum\nThe Manila Times Classifieds\nTwitter\nYoutube\nFacebook\nInstagram\nDailyMotion\nSpotify\nSubscribe Now\nCopyright © The Manila Times – All Rights Reserved.\nAdvertise\nContact Us\nAbout Us\nPrivacy Policy\nHome\nMy Library\nPodcasts\nVideos\nGames\nThis website uses cookies. By continuing to browse the website, you are agreeing to our use of cookies. Read More.\nClose", "extraction_method": "jina", "word_count": 817, "success": true}