{"full_text": "Why Singapore Is Getting Serious About Shade—and Everything Else You Need to Know About This Week - DwellHome ToursDwell ExclusivesBefore & AfterBudget BreakdownRenovationsPrefabVideo ToursTravelReal EstateVacation RentalsPhotosEditor’s PicksBathroomsKitchensStaircasesOutdoorMagazineCurrent IssueAll IssuesShopShopping GuidesFurnitureLighting & FansDecor & MoreKitchen & DiningBath & BedProjectsEditor’s PicksModernMidcenturyIndustrialFarmhousesScandinavianFind a ProSourcebookPost a ProjectCollectionsEditor’s PicksShoppingRecently SavedPlanningSubscribeSign InView 2 PhotosWhy Singapore Is Getting Serious About Shade—and Everything Else You Need to Know About This WeekAtlanta builds a “sponge park” to fight flooding, YIMBY goes mainstream, and more.Text by Anna BrazView 2 PhotosSingapore is harnessing the power of shade, weaving covered walkways, tree-lined boulevards, and towering shadows into its urban planning to fight the heat. Here’s how the city is proving that shade infrastructure can make a difference in climate change. (BBC) New York is betting big on manufactured homes with a $50 million pilot program, fast-tracking 200 modular builds for low- and middle-income families in an attempt to offset the state’s housing crisis. (The New York Times)\nOnce a fringe movement, YIMBY has gone mainstream, drawing governors, Congress members, and deep-pocketed donors to its New Haven summit. But as its \"more housing, fewer rules about where it can be built\" rallying cry expands, the movement risks splintering. (Slate)\nAtlanta turned a flood-prone neighborhood into Cook Park, a 16-acre \"sponge\" that doubles as a playground, soaking up million of gallons of water during hurricanes. (The New York Times)\nIn more and more cities, even a zero-interest mortgage rate wouldn’t make homeownership affordable.Zillow’s new affordability ranking puts Pittsburg at the top, while Los Angeles, New York, Miami, and other coastal cities stay out of reach—even when mortgages are set to zero-percent interest. Increasingly, homeownership is feeling like a mirage for many middle-income families. (The Washington Post)\nTop photo by Then Chih Wey/Xinhua via Getty Images. PublishedSeptember 26, 2025TopicsDesign NewsSaveResponses Get the Pro NewsletterWhat’s new in the design world? Stay up to date with our essential dispatches for design professionals.SubscribeAboutAboutContact UsFAQEditorial StandardsCareersAdvertiseMedia KitSubscriptionsSubscribe to DwellGift Dwell MagazineDwell+ Subscription HelpMagazine Subscription HelpProfessionalsPost a ProjectSell Your ProductsContribute to DwellPromote Your WorkFollow@dwellmagazine on Instagram@dwellmagazine on Pinterest@dwell on Facebook@dwell on Twitter@dwell on FlipboardDwell RSS© 2025 Recurrent Ventures Inc. All rights reserved.PrivacyTermsDMCASitemapDo Not Sell or Share My Personal Information", "extraction_method": "beautifulsoup", "word_count": 359, "success": true}