{"full_text": "NewsLocal NewsIn Your Neighborhood\nActions\nFacebook\nTweet\nEmail\nBell County Gen Z, Millennials struggle with homeownership dreams as 70% face housing affordability crisis\nLocal families like the Kwans represent national trend where rising costs make saving for homes nearly impossible, even while living with parents to reduce expenses.\nPrev\nNext\nMarc Monroy, KXXV\nBy:\nMarc Monroy\nPosted\nand last updated\nMarc Monroy Hi! I'm Marc Monroy, your Neighborhood Reporter in Central Texas.\nBELL COUNTY, Texas (KXXV) — Bell County millennials and Gen Z residents are struggling to achieve homeownership despite years of saving efforts. Simon Kwan, a 27-year-old father from Belton, represents a broader national trend where 70% of young adults cannot afford housing. Even while living with parents to reduce costs, rising expenses across all categories make saving for home deposits nearly impossible. Generational housing crisis: 70% of Gen Z and millennials struggle with housing affordability according to Redfin dataLocal impact: Bell County residents like Simon Kwan represent the national trend of delayed homeownership among young adultsLiving situation strategies: Even while living with parents to reduce expenses, young adults still face significant financial pressuresMarket uncertainty: Young buyers express concern about unpredictable future housing market conditionsCautious optimism: Despite challenges, residents maintain hope for eventual homeownership while acknowledging extended timelinesCheck out the story:\nBell County Gen Z,\nMillennials struggle with homeownership dreams as 70% face housing affordability crisis\nBROADCAST TRANSCRIPT:\nSimon Kwan has been saving for a house for over a year, but like many in his generation, homeownership feels increasingly out of reach in Bell County.The 27-year-old father from Belton represents a growing trend affecting young adults across the region. According to Redfin, around 70% of Gen Z and millennials are struggling to afford housing, and that challenge is evident locally.\"We've been working on saving up for a little over a year now but it's definitely not going as fast as we thought it would be,\" Kwan said.\nMarc Monroy, KXXV\nEven while living with his parents to reduce expenses, Kwan said rising costs across all categories make saving for a home deposit nearly impossible.\"It's hard to save up with the prices of everything you know even living with my parents we still have to pay for our phone bill, insurance and car insurance,\" Kwan said. \"It's a little expensive right now.\"Bobbie Perius, another Belton resident, faces similar financial pressures as a parent trying to build stability for her family.\"Everything is expensive especially having kids and everything like groceries and rent,\" Perius said.\nMarc Monroy, KXXV\nWhen asked whether she thinks she'll ever be able to afford a home, Perius expressed cautious optimism.\"I hope so,\" Perius said.The uncertainty extends beyond individual families to broader market concerns about future housing accessibility.\"There is a lot of uncertainty with how the housing market is going to look like in a couple years,\" Kwan said.Despite the financial challenges and market uncertainty, Kwan remains hopeful about eventually achieving his dream of homeownership, even if it takes longer than he originally planned.This story was reported on-air by a journalist and has been converted to this platform with the assistance of AI. Our editorial team verifies all reporting on all platforms for fairness and accuracy.\nCopyright 2025 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nIn Your Neighborhood", "extraction_method": "beautifulsoup", "word_count": 549, "success": true}