{"full_text": "Skip to Content  \n \n \n \n  \n        \n \n \n \n \n \n \n      \n \n \n \n \n \n  \nDonate     \n \n \n  \nAdvertise     \n \n \n  \nApply     \n \n \n  \nSubscribe     \n \n \n  \nHousing     \n \n \n  \nDuck Living     \n \n \n  \nGames       \n \n \n \n \n  \n  \n  \n \nDaily Emerald     \n \n \n \n   \n \n \n   \n \n \n \n  \n  Facebook    \n  Instagram    \n  X    \n  Tiktok    \n  LinkedIn    \n  YouTube       \n \n \n \n \n \n Search this site  \nSubmit Search       \n \n \n      \n \n \n \n \n  \n \n\n\nHome \n \nAbout the Emerald \nDonate \nAdvertise With Us! \nAlumni \nApply \nAwards \nGuest Viewpoints \nComment Policy \nContact Us \nDistribution \nHaywardbook \nMeet the Staff \nPrint \nPrivacy Policy \nBoard of Directors   \nNews \nInvestigations \nArts & Culture \nSports \nOpinion \nMultimedia \nPDX Bureau \n \nPDX News \nPDX Arts & Culture \nPDX Sports   \nEthos  \n \n More \n         \n  \n \n \n \n  \n        \n \n \n \n \n \n \n  Open Navigation Menu    \n  \n \n \n   \n Daily Emerald   \n\n\nHome \n \nAbout the Emerald \nDonate \nAdvertise With Us! \nAlumni \nApply \nAwards \nComment Policy \nContact Us \nDistribution \nHaywardbook \nMeet the Staff \nPrint \nPrivacy Policy \nBoard of Directors   \nInvestigations \nNews \nArts & Culture \nSports \nOpinion \nPhoto \nVideo \nPodcast \nGames \n \nWaddle \nCrossword \nMini Crossword   \nPDX \nEthos  \n \n More \n       \n  \n  \n \nDaily Emerald     \n \n \n \n  Open Search Bar    \n \n \n \n Search this site  \nSubmit Search        \n \n \n \n \n    \n  \n \n \n \n  \n        \n \n \n \n \n \n \n  Open Navigation Menu    \n  \n \n \n   \n Daily Emerald   \n\n\nHome \n \nAbout the Emerald \nDonate \nAdvertise With Us! \nAlumni \nApply \nAwards \nComment Policy \nContact Us \nDistribution \nHaywardbook \nMeet the Staff \nPrint \nPrivacy Policy \nBoard of Directors   \nInvestigations \nNews \nArts & Culture \nSports \nOpinion \nPhoto \nVideo \nPodcast \nGames \n \nWaddle \nCrossword \nMini Crossword   \nPDX \nEthos  \n \n More \n       \n  \n  \n \nDaily Emerald     \n \n \n \n  Open Search Bar    \n \n \n \n Search this site  \nSubmit Search        \n     \n \n \n  \n  \n \n Recent Stories   \n \n  \n\n\n\n\n\n\nPhotos: The No. 5 University of Oregon Ducks take on West Coast rivals the No. 19 USC Trojans winning 42-27\n Saj Sundaram and Katie Poluyansky • November 24, 2025\n\n\n\n\n\n\n\n\nBeyond the Flock: Interview with Matthew Conti\n Russell Taber, Podcast producer • November 24, 2025\n\nIn this interview, Russell speaks with Matthew Conti, Recruitment Officer for the University of Oregon Rowing Club. He shares insights into the...\n\n\n\n\n\n\nStudents come together to express their creativity at Craft Club\n Mikayla Mesko, PDX Photographer • November 24, 2025\n\nEvery other Thursday from 3:30 to 4:30 PM at the Duck Den, University of Oregon Portland students are able to express their creativity at Craft...\n\n\n\n\n\n\n\nUO history professor arraigned on 10 charges of encouraging child sex-abuse in the first degree\nNovember 24, 2025\n\n\n\n\n\nCharging Forward: The OSAA Cross Country State Championships\nNovember 24, 2025\n\n\n\n\n\n\nTakeaways from Oregon men’s basketball’s victory over Oregon State\nNovember 24, 2025\n\n\n\n\n\n\nKuhn: What lessons can UO learn from a small liberal arts experience?\nNovember 24, 2025\n\n\n\n\n\n\nAlumni spotlight: Kyle Waters\nNovember 24, 2025\n\n\n\n\n\n\nWomen’s basketball: Hoopfest Women’s Challenge preview\nNovember 24, 2025\n\n\n\n\n\n\nSustainably stylish: The Racks’ second location\nNovember 24, 2025\n\n\n\n\n\n\nMen’s basketball: Players Era Festival preview\nNovember 24, 2025\n \n     \n  \n Sports  \n \n  \n\n\n\n\n\n\nOregon women’s basketball dominates at home over Utah State, 70-34\n Max Koebel, Senior Sports Writer • November 23, 2025\n\nThe Oregon women’s basketball team (5-0) had no problem dominating the Utah State University Aggies (3-2) 70-34 in a Sunday afternoon outing...\n\n\n\n\n\n\nHow It’s Reported: A look inside “Duck Force One”\n Julia Boring, Podcast producer • November 22, 2025\n\nPodcast producer, Julia Boring, sits down with Associate Sports Editor, Owen Murray, and Photography Editor, Saj Sundaram, to talk about their...\n\n\n\n\n\n\nNo. 7 Oregon football downs No. 15 USC 42-27 in top-15 shootout\n Joe Krasnowski, Senior Sports Writer • November 22, 2025\n\nMalik Benson said he \"blacked out,” but the crowd was very much alive. The ear-splitting audience of 59,588 went ballistic at Autzen Stadium,...\n\n\n\n\n\n\nLive updates: No. 7 Oregon beats No. 15 USC, 42-27, in final regular-season home game\n Owen Murray, Sports Associate Editor • November 22, 2025\n\nThe Ducks (9-1, 6-1 Big Ten) and Trojans (8-2, 6-1 Big Ten) meet for an old-school Pac-12 battle to complete Oregon's home regular season slate....\n\n\nView All\n \n     \n \n \n \nUpcoming Games  \n \n  \n  \nFootball   \nMen's Basketball     \n \n \n \nUniversity of Oregon \n  \n \n \n@ Washington \n  \n \nNov 29 /TBD / Football \n  \n   \n      \n \n \n Housing-affordability advocates urge city official to enact opportunity to purchase act \n Organizations ask city officials to include TOPA in phase three of rent protections. \n \n Billie Corsetti    \nNovember 24, 2025  \n \n \n \n \n \n\n\n \n \n \nTyler Graham \nTimothy Morris, the executive director of the Springfield-Eugene Tenant Association, supports the passing of the Tenant Opportunity of Purchase Act, giving tenants priority to buy their building if it’s up for sale (Tyler Graham/Emerald)  \n     \nHousing-affordability organizations in Eugene are urging city officials to including the Tenant Opportunity to Purchase Act in phase three of the city’s renters protection’s process. \nAdvocacy groups, including the Springfield-Eugene Tenant Association, SquareOne Villages and the Democratic Party of Lane County, advocated for TOPA during an October city council meeting to ensure renters are more aware when landlords are going to sell a building and give renters the first opportunity to purchase. \nTOPA requires property owners to notify residents if they are planning to sell their building, and give the residents a time limit to decide whether or not they will form a tenant association to find an avenue to purchase the building. \n“The residents then have a choice of either coming together to identify a property management company, or even potentially run it themselves as their own co-op and purchase the entire building, or to work with local nonprofit organizations,” Timothy Morris, executive director of SETA, said. \nFor housing-affordability advocates like SETA and SquareOne Villages, the goal of TOPA is to give residents the opportunity to stay in their housing, keep prices stabilized and avoid out-of-state corporations pushing them out.\n  \n   \n \nThe city of Eugene’s renters protections process first came into effect in August 2022 with phase one, which saw rental protections like mandated move-in/move-out documentation by the landlord and the $10 maximum screening charge for rental applicants. Phase two went into effect in August 2023 and placed limits on security deposit maximums, requiring landlords to consider applications on a first-come first-served basis. \nAccording to the city’s original roadmap for the process, city officials during phase three will consider addressing issues like monthly gross income screenings, no-cause evictions and application requirements. \n“Stability and affordability comes from community ownership, and our mission is to create those democratic communities that are permanently affordable and environmentally sustainable,” Chazandra Kern, a project manager for SquareOne Villages, said. “With TOPA, we see it as one of those tools that opens up the prospects for renters to not only maintain that stability, but to become co-owners in the housing communities.” \nIn Eugene, housing affordability and stability has been one of the top issues on residents’ minds, according to Celine Swenson-Harris, chair of the Democratic Party of Lane County. \n“When I am out knocking on doors, when I talk to volunteers who go out knocking on doors and come back and talk to me about the conversations they had, we see housing and affordability show up again and again. No matter where you are in this community, and across so many different age and income demographics, housing and homelessness is one of the topics that we hear pretty much every time,” Swenson-Harris said. \nThe National Low Income Housing Coalition found that in Oregon, affordable rent for minimum wage-workers caps at $783 a month, but an average one-bedroom’s fair market rent is $1,435 a month. According to Eugene housing stats from January, 51% of the city’s population are renters, and 61% of them experience cost-burdens. \nAdvocates are hoping that the city council will consider TOPA for phase three of the renters protection process. \n  \n      \n \n \n \n   View Story Comments  \n \n \n \n 4    Like This Story   \n \n    Share on Facebook   \n \n    Share on X   \n \n    Email this Story   \n \n    Print this Story   \n  \n \n Leave a Comment   \n \n \nMore to Discover \n\n\n \n \n  \n \n More in community  \n \n \n \n \n    \n Just my cup of tea    \n \n \n \n    \n Matcha lattes and building community    \n \n \n \n    \n Take a step forward this Walktober    \n \n \n \n    \n Approximately 4,000 attend Eugene “No Kings 2” protest    \n \n \n \n    \n Flock cameras to be paused within the next 24 hours    \n \n \n \n    \n Composting in Eugene      \n \n \n More in community-news  \n \n \n \n \n    \n Eugene Planning Commission backs code changes allowing taller new UO dorms in East Campus    \n \n \n \n    \n Health Enrichment for Low-Income Pets provides pet services to the Eugene community    \n \n \n \n    \n Volunteer groups hope to bridge gaps between UO and Eugene community    \n \n \n \n    \n Residents talk Flock, housing affordability at city council meeting    \n \n \n \n    \n ACLU lawsuit against Eugene renews debate over police surveillance    \n \n \n \n    \n House fire across from UO residence hall      \n \n \n More in News  \n \n \n \n \n    \n UO wellness center to take up previous Shake Smart location in Student Recreation Center    \n \n \n \n    \n Career Closet Pop-Up provides free professional attire for students    \n \n \n \n    \n UO professor arrested on child sex-abuse charges    \n \n \n \n    \n UO legal counsel explains ICE protocols and legal boundaries during faculty senate meeting    \n \n \n \n    \n Former SOJC Dean Juan-Carlos Molleda cleared of wrongdoing by state ethics commission    \n \n \n \n    \n UO students leverage AI to create college marketplace and housing-finder website        \n \nAbout the Contributors \n \n \n \n    \n \n Billie Corsetti, News Reporter  \n Billie is a news reporter at the Daily Emerald and a sophomore studying Journalism and Political Science. She is passionate in researching how federal and state policies impact local communities, as well as how politics and pop culture intersect. In her free time she enjoys reading, camping and listening to podcasts.   \n  \n \n \n \n    \n \n Tyler Graham  \n Tyler is in his first year as a member of the Photo Desk for the Daily Emerald. He is a freshman at the University of Oregon, studying Business Administration with a concentration in sports business. You can find his work on Instagram @Grahamphotos_.   \n        \n  \n \n \n \n \n \n \n \n  \n      \n \n   \n \n \n \n FOLLOW US!    \n \n \n  \n  Facebook    \n  Instagram    \n  X    \n  Tiktok    \n  LinkedIn    \n  YouTube       \n \n \n    \n \n \n \n \n WHO WE ARE     \n \n \n \n _________________________________________________________\n\nThe Daily Emerald is the news division of Emerald Media Group, University of Oregon’s independent student media organization.\n_________________________________________________________\n\nEDITOR-in-CHIEF\nTarek Anthony\n(541) 346-5511 Ext. 325\n[email protected]     \n \n \n    \n \n    \n \n \n \n    \n \n \n \n \n \n PRESIDENT & PUBLISHER\nEric Henry \n(541) 346-5511 Ext. 317\n[email protected]    \n \n \n VP OPERATIONS\nKathy Carbone \n(541) 346-5511 Ext. 302\n[email protected]    \n \n \n AD DIRECTOR\nShelly Rondestvedt \n(541) 346-5511 Ext. 303\n[email protected]    \n \n \n CREATIVE & TECHNICAL DIRECTOR\nAnna CK Smith\n(541) 346-5511 Ext. 327\n[email protected]      \n \n \n \n \n  \n \n\n\nHome \nStaff \nAbout the Emerald  \n \n More \n         \n \n \n \n \n  \n \n\n\nAdvertise With Us! \nHayward Book \nBoard of Directors  \n \n More \n         \n \n \n \n \n  \n \n\n\nApply \nContact Us \nCorrections \nPrivacy Policy \nPromoted Content  \n \n More \n         \n \n \n \n \n    \n  \n  \n \n \n \n  \n        \n \n \n \n \n \n  \n  Facebook    \n  Instagram    \n  X    \n  Tiktok    \n  LinkedIn    \n  YouTube        \n \n \n \n \n \n \n  Open Navigation Menu    \n  \n \n \n    \n\n\nApply \nContact Us \nCorrections \nPrivacy Policy \nPromoted Content  \n \n More \n         \n  \n  \n© 2025 Daily Emerald, published by Emerald Media Group • 1395 University St. Suite 302 • Eugene, OR • 97403 • FLEX Pro WordPress Theme by SNO • Log in         \n \n \n \n \n\nComments (0)  \n Share your thoughts...  \n All Daily Emerald Picks Reader Picks Sort: Newest  \n \n \n Cancel reply\n\nYour email address will not be published. Required fields are marked *\nComment * \nSpam Control Field.Verification Field.\n\nName *  \nEmail *  \n        \n \nClose \n  \n \nClose Modal Window \n  \n \nClose", "extraction_method": "jina", "word_count": 1661, "success": true}