{"full_text": "About\nNews\nExperts\nJournalists\nPricing\n⌕\nLogin\nRegister\nIU Kelley School of Business Real Estate Report Examines Housing Trends and Affordability Challenges\n31-Oct-2025 6:10 PM EDT, by Indiana University\n♡\nCredit: Indiana University Kelley School of Business\n\nJun Zhu, clinical associate professor of finance\n\nPrevious\nNext\nBYLINE: Katrina Nickell\n\nNewswise — INDIANAPOLIS— To provide the public with a clearer understanding of today’s real estate market and bridge the gap between academic research and industry practice, the Indiana University Kelley School of Business Center for Real Estate Studies and Indiana Business Research Center have released the Fall 2025 Kelley Real Estate Outlook.\n\n This issue features expert analysis from Kelley professor Jun Zhu, who examines the rise in serious delinquencies on Federal Housing Administration (FHA) loans, which are designed to make home ownership more accessible through lower down payments. Published biannually, the Kelley Real Estate Outlook also includes research summaries from multiple institutions and is curated by Sara Heidtmann Coers, associate director of the Center for Real Estate Studies and lecturer in real estate at Kelley Indianapolis.\n\nAdditionally, the report features an article by Chris Hancock, CEO of the Builders Association of Greater Indianapolis (BAGI), who addresses the challenges builders face in today’s market and the growing concerns around housing affordability.\n\n“Our world is increasingly data-driven, and while technology has transformed real estate development, most people still lack access to free, reliable data,” said Coers. “We aim to provide meaningful, data-driven insights that go beyond surface-level trends. We also want to make academic research accessible and actionable for industry professionals.”\n\nCoers highlighted the Power Grid, a tool included in the Outlook and updated regularly, as a free and valuable resource for market metrics. “This consolidates key data into one place, eliminating the need for multiple searches or costly subscriptions,” Coers shared. “Our goal is to maximize value for readers by presenting information in clear, industry-focused language.”\n\nA deeper dive into FHA loan delinquencies\n\nZhu, a clinical associate professor of finance at the Kelley School, partnered with her colleagues at the Urban Institute for this research. It examined why the number of FHA delinquencies has increased in a short period of time.\n\n“From mid-2024 to February 2025, FHA mortgage delinquencies jumped from 3.7% to 4.8%. FHA loans are insured loans intended to make home ownership more accessible with low down payments,” Zhu wrote.\n\nFHA loans are a common tool for first-time home buyers requiring a 3.5% down payment and are considered delinquent when 90 days past due. FHA loan delinquency is typically the first place experts see broader economic issues rising, according to Coers.\n\n“When we first approached this issue, the most likely culprit seemed obvious as one or more of the items on the list of usual suspects: relaxed lending standards (including higher debt-to-income [DTI] ratios and competition from government-sponsored enterprises [GSEs]), slowing home price appreciation, or improved loss mitigation encouraging strategic defaults. But according to our study, none of these explanations hold water. In fact, the answer turned out to be much simpler than expected,” Zhu said.\n\nResearchers concluded that borrowers are simply experiencing greater financial stress.\n\n“Inflation has consistently outpaced wage growth, eroding families’ ability to build the emergency savings needed to weather unexpected financial shocks. This financial pressure extends far beyond mortgages — delinquency rates have climbed simultaneously across auto loans, credit cards, and buy-now-pay-later products, suggesting a broad-based affordability crisis rather than housing-specific issues,” Zhu wrote. “Additional stressors compound the problem: an unprecedented frequency of natural disasters, insurance premiums that have skyrocketed in many markets, and property tax increases that particularly burden newer homeowners who haven’t had time to build equity cushions.”\n\nDespite these challenges, Zhu emphasized that today’s environment differs from the 2008 housing crisis. Enhanced foreclosure-prevention tools and a strong FHA insurance fund provide critical safeguards against systemic risk.\n\nBuilders Association of Greater Indianapolis Weighs In\n\nChris Hancock’s contribution to the outlook examines the state of new home construction. While national trends show slowing growth, Central Indiana’s data proposes a different outlook.\n\n.“In Central Indiana (the nine-county Indianapolis region), the new home construction market remains resilient. BAGI data shows a 6% year-over-year rise in single-family building permits for June 2025. Through mid-2025, total permits filed in the region were up 6% from the first half of 2024. This performance stands in sharp contrast to national trends, where new home activity has seen slower growth,” Hancock wrote.\n\nHowever, key challenges nationwide continue to be factors: supply chain delays, land development costs, and labor shortages.\n\n“While home prices have stabilized in 2025, affordability remains the most pressing concern for both buyers and builders. The trifecta of rising labor costs, elevated material prices, and tighter lending conditions directly impacts what gets built,” he added.\n\nHancock concluded that the future depends on collaboration among builders, policymakers, and community leaders. “If stakeholders work together to address these challenges, Central Indiana can maintain its position as a dynamic and accessible housing market.”\n\nThe Fall 2025 Kelley Real Estate Outlook provides an industry roadmap for understanding the forces shaping Indiana’s housing market and beyond. By combining academic research with practical industry insights, the outlook aims to inform professionals across the real estate industry.\n\nREQUEST AN EXPERT\nMEDIA CONTACT\nREGISTER FOR REPORTER ACCESS TO CONTACT DETAILS\nARTICLE MULTIMEDIA\nImages\nTYPE OF ARTICLE\nResearch Results\nSECTION\nBUSINESS\nCHANNELS\nBusiness Ethics Economics Wall Street\nKEYWORDS\nReal Estate Kelley School Of Business Indianapolis FHA Loan Real Estate Market\nCOMMENTS | COMMENTING POLICY\nView All Latest News\nForms\nMedia Press Pass\nUser Registration\nFind My Account\nPay an Invoice\nContact Us\nExperts\nRequest an Expert\nExpert Directory\nEmbargoed News\nSearch Sources\nNewswise\nServices for Journalists\nServices for Communicators\nGet Email Alerts\nDaily Wires\nLatest News\nChannel Index\nAdvanced Search\nSelect Media Database\nLive Events\nGet a Demo\nPricing\nFAQ\nAbout Newswise\n\nJournalists use Newswise as a source for research news, experts, ready-to-use content and story ideas. Media relations professionals can connect with reporters and share their organization's news with a wider audience. Public readers discover the latest research news in science, medicine, social sciences, environment, technology, factchecks and business news from the world's most credible universities and research organizations. More than 7,000 email wires go to journalists from more than 2,400 media outlets around the globe.\n\nContact Us\n      \nSignup\nSubscribe to Newswise\nFor Journalists\nReceive a Demo\nPrivacy Notice Terms of Service\n\n2025 Newswise, Inc\n\n⌕\nLogin\nNews\nExperts\nJournalists\nPricing\nAbout\nBlog\nFAQ\nHelp", "extraction_method": "jina", "word_count": 1067, "success": true}