{"full_text": "Opinion\neditorial\nCity Council plans to wreck NYC’s housing market in name of affordability, ‘saving’ it\nBy\nPost Editorial Board\nPublished\nNov. 22, 2025, 9:29 a.m. ET\nReal socialism always proves to be far more cruel than \"heartless capitalism,\" write the Post Editorial Board,\nGetty Images\nCity Council radicals are speeding toward their goal of destroying New York’s housing market in the name of “saving” it.\nProgressives want to “decommodify” residential real estate by turning it into “social housing” run by politically connected nonprofits.\nThat is: a system much worse than NYCHA.\nThe scheme would grant “qualified” insiders an effective veto on the sale of already “distressed” residential buildings by imposing a six-month “right of first refusal” period on owners and buyers.\nMore From\t\t\t\t\t\t\tPost Editorial Board\nYour COVID dollars at . . . work? UK cops’ Israeli-smearing lies and other commentary\nFrench-Israeli hit squad? As Candace Owens spirals into lunacy, blame the digital media cesspool\nNYPD needs to quash violent car-meetup ‘street takeovers’ IMMEDIATELY\nSay you own a three-family rental property, and want to sell it: Under this “Community Opportunity to Purchase Act,” you must announce your intent to put your property up for sale at a listed price and then wait six months — subject to extensions — to see if a city-approved nonprofit outfit wants to buy it by matching that price.\nOnly then can you make the building “available for sale in the public market.”\nThis madness means huge headaches for sellers, and would drive investors to look anywhere else: No responsible party will put up with the hassles and delays.\nFamilies who inherit property often have to sell to pay taxes and divide estates; this six-month holding period imposes obvious hardship.\nGet opinions and commentary from our columnists\nSubscribe to our daily Post Opinion newsletter!\nThanks for signing up!\nEnter your email address\nPlease provide a valid email.\nBy clicking above you agree to the Terms of Use and Privacy Policy.\nNever miss a story.\nCheck out more newsletters\nCue the complete cratering of values of already distressed properties — which is probably the goal of the legislation in the first place.\nThat is: Insane state laws already have masses of apartment buildings underwater all across town; this is a bid to force owners to sell at even more of a loss.\nCity Councilwoman Pierina Sanchez says it’ll mean “housing that is socially owned by public entities.”\nExcept that connected insiders will control those “public entities”; tenants will be at their mercy.\nReal socialism always proves to be far more cruel than “heartless capitalism.”\nFiled under\naffordable housing\ncity council\neditorial\nnonprofits\nnycha\nsocialism\n11/22/25\nRead Next\nJasmine Crockett is on a cringe streak, and I'm here for i...\nColumnists\nCindy Adams\nThe Metropolitan Opera's vocal coach breaks down the difference between American and European performers\nKirsten Fleming\nHow much lower can the Bill Belichick and Jordon Hudson sexed-up saga sink?\nRich Lowry\nKen Burns makes a woke mockery of America's founding\nSee All Columnists\nCovers\nToday's Cover\nFront Cover\nBack Cover\nFlip for back cover\nBrowse Covers\nTrending Now\non NYPost.com\nThis story has been shared 98,951 times.\n98,951\nNew twist revealed in case of high school football coach who vanished during undefeated season\nThis story has been shared 37,804 times.\n37,804\nHow Trump plans to fund $2K tariff 'dividend' checks for most Americans\nThis story has been shared 35,397 times.\n35,397\nFire chief's wife allegedly flashed 14-year-old volunteer — and said she wanted to have sex when he turned 18", "extraction_method": "beautifulsoup", "word_count": 587, "success": true}