{"full_text": "News\nHousing panel seeks more local autonomy to tackle affordability in Arlington\nBy Scott McCaffrey\nPublished October 1, 2025 at 10:00AM\nAn affordable housing building in Rosslyn (staff photo by Jay Westcott)\nArlington’s Housing Commission is seeking more local leeway in addressing affordable housing and new formulas for determining the number of affordable units in new projects.\nCommission Chair Kellen MacBeth included these recommendations in a letter to the County Board following a review of policies by the Affordable Housing Ordinance working group established earlier this year. County leaders are currently developing legislative priorities for the 2026 General Assembly session.\nIn the letter, MacBeth said the status quo was not providing the desired results.\n“Arlington County continues to fail to produce the level of affordable housing needed to meet the 2015 Affordable Housing Master Plan’s (AHMP) goals,” he wrote. “Our current supply of rental housing units affordable to residents earning up to 60% of area median income is only 12.1%, and we are not increasing supply at a rate fast enough to reach the AHMP goal of 17.7% by 2040.”\nHe wrote that the commission he leads has “grown frustrated” with the current requirements for developers seeking county approval for new projects.\n“Today, we are collecting a lower cash contribution on a per-square-foot basis and producing fewer affordable units in exchange for allowing developers to exceed restrictions on building heights and density,” MacBeth wrote.\nThe working group on this topic included representatives from several county commissions, affordable-housing advocates and representatives for developers. Led by Bryan Coleman, it delivered its recommendations to the Housing Commission last month.\nHousing Commission meeting of Sept. 16, 2025 (screenshot via Arlington County)\nAt the Sept. 16 Housing Commission meeting, Coleman said the experience had led participants to understand that affordable housing remains “a very nuanced issue” with potential pitfalls in making changes.\n“Pulling one string out of the large ball can have effects that you don’t fully understand until it’s been played out,” he said.\nAs a result of the working group’s recommendations, the Housing Commission voted 8-0 asking the County Board to convene a new working group to propose options for determining how much — in either units or cash contributions — developers should be required to contribute when seeking increased density for residential and commercial projects.\nCurrently, developers have four options to satisfy the requirements: Including affordable units within the redeveloped property; funding units nearby; funding units elsewhere in the county; or contributing cash to the county’s Affordable Housing Investment Fund.\nCurrently, most developers take the cash-contribution route as the easiest and, often, most financially advantageous option.\nImplementing a major change would require an update to the county’s current Affordable Housing Ordinance, which dates to 2006, as well as authorization from the General Assembly and governor. Coleman said his panel had worked closely with County Board member Maureen Coffey and State Sen. Barbara Favola to make sure the proposals were feasible.\nVirginia state law limits localities’ powers to regulate affordable-housing requirements on developers. Activists have long sought more local autonomy.\n“We strongly believe that the County Board, and not the General Assembly, should be the ultimate decision-makers on what those changes should be,” MacBeth wrote.\nState legislators of both parties in Virginia typically have been disinclined to give localities more authority, as it dilutes their own. And any changes to the status quo might come under heavy scrutiny from developers, who wield significant power in Richmond.\nAbout the Author\nScott McCaffrey\nA Northern Virginia native, Scott McCaffrey has four decades of reporting, editing and newsroom experience in the local area plus Florida, South Carolina and the eastern panhandle of West Virginia. He spent 26 years as editor of the Sun Gazette newspaper chain. For Local News Now, he covers government and civic issues in Arlington, Fairfax County and Falls Church.\n#affordable housing\n#county government\n#General Assembly\n#housing\n#Housing Commission", "extraction_method": "beautifulsoup", "word_count": 646, "success": true}