{"full_text": "Fact Check Team: Will Trump's 50-year mortgage idea solve or worsen housing affordability?NewsNews'It's a nightmare': Family mourns death of Maine child after being run over by school busA family is in mourning, and a community is asking questions, after a 12-year-old student was run over by a school bus.Jay mobile home park residents rally against lot rent increasesMobile home park residents mobilized in Jay against unwanted rent increases Monday.Maine transportation officials urge drivers to use caution when driving this winterMaine State Police, AAA, the Maine Turnpike Authority and state transportation officials all spoke out Monday, raising awareness.City removes homeless encampment near Portland High SchoolThe Superintendent of Portland Schools has spoken to the city about a homeless encampment near Portland High School, saying it comes down to safety.LocalI-TeamVideosNation & WorldMarijuana in MaineEntertainmentOffbeatConnect to CongressIn-DepthAmazing AmericaArmstrong Army StrongInside Your WorldSoarBeyond The PodiumSpotlight on AmericaForward ThinkingHealthy HomeFull Measure with Sharyl AttkissonDid You Know?Fighting Addiction TogetherCrisis in the ClassroomTransparency TrackerRaising MEARC MaineWaste WatchWeatherCurrent WeatherPortlandPartly Cloudy29F48/29Today48/29Tuesday48/42Wednesday50/39Latest WeathercastLatest WeathercastRadarClosings & DelaysMapsHurricane TrackerForecasting GrowthFeaturesFeatures'It's a nightmare': Family mourns death of Maine child after being run over by school busA family is in mourning, and a community is asking questions, after a 12-year-old student was run over by a school bus.Jay mobile home park residents rally against lot rent increasesMobile home park residents mobilized in Jay against unwanted rent increases Monday.Maine transportation officials urge drivers to use caution when driving this winterMaine State Police, AAA, the Maine Turnpike Authority and state transportation officials all spoke out Monday, raising awareness.City removes homeless encampment near Portland High SchoolThe Superintendent of Portland Schools has spoken to the city about a homeless encampment near Portland High School, saying it comes down to safety.Back To SchoolGood Day MainePump PatrolSinclair CaresPartner SpotlightThank-A-VetFur-Ever FriendFor Pet's SakePet Food DriveReal Estate ReportFinancial MattersMake-A-Wish MaineAsk The ExpertMainers Making a DifferenceHealthier MEWork with MEMaine MakersGame CenterGame CenterDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchChime InWatchLiveNow29°Tue48°Wed50°SearchSearchUser IconWatchSearchNewsDown ArrowLocalI-TeamVideosNation & WorldMarijuana in MaineEntertainmentOffbeatConnect to CongressIn-DepthAmazing AmericaArmstrong Army StrongInside Your WorldSoarBeyond The PodiumSpotlight on AmericaForward ThinkingHealthy HomeFull Measure with Sharyl AttkissonDid You Know?Fighting Addiction TogetherCrisis in the ClassroomTransparency TrackerRaising MEARC MaineWaste WatchWeatherDown ArrowWeather HomeRadarClosings & DelaysMapsHurricane TrackerForecasting GrowthFeaturesDown ArrowFeatures HomeBack To SchoolGood Day MainePump PatrolSinclair CaresPartner SpotlightThank-A-VetFur-Ever FriendFor Pet's SakePet Food DriveReal Estate ReportFinancial MattersMake-A-Wish MaineAsk The ExpertMainers Making a DifferenceHealthier MEWork with MEMaine MakersGame CenterDown ArrowGame Center HomeDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchChime InMoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsNewsletter Sign UpStationDown ArrowStation HomeContactPeopleContestsScheduleCommunity PartnershipsNewsletter Sign UpSportsDown ArrowSports HomeLocalTICKETSCity GuideLegalDown ArrowTerms & ConditionsCopyright NoticesEEO ReportFCC Public FileFCC ApplicationsPublic File AssistanceContactNews TeamConteststwitter iconfacebook iconACCESSIBILITYArmstrong Williams Town HallArmstrong Williams takes on the news of the week and asks the questions you want answered. Don’t miss our weekly town hall!WATCHClose11Please ensure Javascript is enabled for purposes of website accessibilityFact Check Team: Will Trump's 50-year mortgage idea solve or worsen housing affordability?by EMMA WITHROW | Fact Check TeamTue, November 18, 2025 at 7:37 PMUpdated Tue, November 18, 2025 at 10:59 PM4VIEW ALL PHOTOSWASHINGTON, DC - NOVEMBER 17: U.S. President Donald Trump delivers remarks during a meeting of the White House Task Force on the FIFA World Cup 2026 in the Oval Office of the White House on November 17, 2025 in Washington, DC. The task force was created to oversee security, logistics, and federal government support for the 2025 Club World Cup and the 2026 FIFA World Cup, jointly hosted by the United States. (Photo by Win McNamee/Getty Images)Comment on this story0CommentShare storySharetopics: MortgageHousing affordabilityUnderwater mortgagesHomebuildersInterest ratesDonald Trump50-year mortgageNegative equity WASHINGTON (TNND) — The Federal Reserve signaled this week that aspiring home buyers expecting more interest-rate relief may have to keep waiting. And that delay is exposing a deeper problem in the housing market: hundreds of thousands of Americans who bought newly built homes over the last few years are already underwater on their mortgages.It’s a trend analysts say didn’t happen by accident, and the lending practices behind it mirror warning signs from the early 2000s. (TNND)It’s a trend analysts say didn’t happen by accident, and the lending practices behind it mirror warning signs from the early 2000s.How Builders Helped Create a Wave of Underwater MortgagesBeing “underwater” on a mortgage simply means you owe more than your home is currently worth. As Bankrate’s chief financial analyst Greg McBride explains, “you owe more than the current value the asset is worth less than the amount you borrowed”.But according to a new analysis first reported by The Wall Street Journal, many homeowners who purchased newly built houses in 2022–2024 landed in that position almost immediately. That’s because large homebuilders have been offering artificially low mortgage rates, often far below market levels — in exchange for higher home prices.Here’s what WSJ found, based on data from analyst John Comiskey:27% of Lennar’s FHA loans from 2022–2024 are now underwater.18% of D.R. Horton’s FHA loans are underwater.10% of Quicken Loans’ FHA loans (a non-builder lender) are underwater.The playbook works like this: builders advertise mortgage rates around 3.99%, even while the broader market hovered closer to 6.3%. But to make the numbers work, they keep sale prices above what the property might otherwise be worth. Buyers get a lower monthly payment, but at the cost of taking out a loan that’s already near, or above, the home’s actual value.When prices stopped rising, many borrowers slid into negative equity almost immediately.What Happens When You’re Underwater?For homeowners, the consequences are severe, and in some cases, financially immobilizing.You can’t easily sell your home. Selling requires bringing cash to the closing table to cover the gap between the loan balance and the sale price. That can mean writing a check for tens of thousands of dollars.You can’t refinance. Lenders require equity to approve a refi. Without it, homeowners are effectively locked into their existing rates.The risk of default rises. When people owe far more than their home is worth, they’re more likely to walk away, a dynamic that played a major role in the 2008 housing crash, according to Bankrate.It becomes a systemic risk. Large pockets of underwater loans strain lenders, federal backstops, and local housing markets.In short, underwater mortgages trap households and can reverberate far beyond a single borrower.Is a 50-Year Mortgage a Solution, or Another Risk?Into this climate stepped former President Donald Trump, who floated a new idea on Truth Social: 50-year mortgages.Supporters call it an affordability boost. Critics are calling it a “lifetime mortgage.”The Upside: Lower PaymentsLower payments could help more people qualify, especially first-time buyers who fail debt-to-income checks. (TNND)A 50-year mortgage would spread repayment over two extra decades, meaning lower monthly payments.A New York Times analysis found that on a $500,000 home, a borrower could save about $250–$300 a month, around $4,000 a year, with a 50-year loan versus a standard 30-year mortgage.Lower payments could help more people qualify, especially first-time buyers who fail debt-to-income checks.The Downsides: Higher Costs and Bigger RisksThere would be enormous lifetime interest. Using the same NYT example: 30-year mortgage interest: ~$500,00050-year mortgage interest: nearly $900,000You’d pay almost twice the price of the home in interest alone.The National Association of Realtors says the median age of a first-time buyer used to be 36 but is now 40. Add 50 years and they’d be 86 by the time the loan matures.The Bottom LineBuilder-backed mortgages helped more Americans buy homes in a tough market, but often at the cost of pushing them into inflated prices and negative equity. Now, with underwater mortgages spreading across multiple major homebuilders, policymakers are starting to ask whether the industry’s lending incentives need a closer look.Meanwhile, Trump’s 50-year mortgage proposal aims to boost affordability but could introduce new long-term risks: massive interest payments, slower equity, and more households vulnerable to downturns.TrendingReport: Tyson to close large meat plant just weeks after Trump's collusion claims Tyson, one of the nation's largest meat packing companies, is planning to close a large meat packing plant in Lexington, Nebraska.10 people displaced after fire in WestbrookCrews on scene of a structure fire in Westbrook. Wreaths Across America says they are short 25,000 sponsored headstonesThe group brings wreaths to 82 cemeteries in Maine.Is there price-fixing in the beef industry?Beef prices aren't likely to move much after Tyson Foods announced the closure of one of its plants, according to an agricultural economist.Lewiston announces first-ever female chief of police Lewiston Police Chief David St. Pierre retired after 33 years of service. NEWS IN PHOTOS:\"Local\"3'We can make Lewiston a safe city for all': Lewiston swears in first female police chief9Maine weather sees a mix of rain, wind, and cold as Thanksgiving week unfolds3Community shaken after school bus hits and kills 12-year-old student in Rockland 5Lewiston announces first-ever female chief of police ACCESSIBILITYTerms & ConditionsCopyright NoticesEEO ReportFCC Public FileFCC ApplicationsPublic File AssistanceContactNews TeamContestsNewsWeatherSportsGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1449, "success": true}