{"full_text": "Breadcrumb Trail LinksHomeLifeHomesCondosNew Homes\nShare this Story : Declining prices, interest rates improve housing affordability\nCopy Link\nEmail\nX\nReddit\nPinterest\nLinkedIn\nTumblr Declining prices, interest rates improve housing affordabilityCalgary's balanced real estate market edges closer to buyer's market, CREB statistics show.Author of the article:By Joel Schlesinger\n•\nfor the Calgary HeraldPublished Nov 06, 2025Last updated Nov 06, 20253 minute read\nJoin the conversation\nYou can save this article by registering for free here. Or sign-in if you have an account.The average price of a home in Calgary decreased by $4,700 from August to September to reach $567,900. Photo by Gavin Young /PostmediaReviews and recommendations are unbiased and products are independently selected. Postmedia may earn an affiliate commission from purchases made through links on this page.Article contentConditions for buyers are largely improving across Canada, including in Calgary, where a new survey points to lower prices and falling mortgage rates boosting purchasing power. Ratehub.ca released its monthly affordability report, finding improvement from August to September in 10 of the 13 major markets it tracks.THIS CONTENT IS RESERVED FOR SUBSCRIBERS ONLYSubscribe now to read the latest news in your city and across Canada.Unlimited online access to articles from across Canada with one account.Get exclusive access to the Calgary Herald ePaper, an electronic replica of the print edition that you can share, download and comment on.Enjoy insights and behind-the-scenes analysis from our award-winning journalists.Support local journalists and the next generation of journalists.Daily puzzles including the New York Times Crossword.SUBSCRIBE TO UNLOCK MORE ARTICLESSubscribe now to read the latest news in your city and across Canada.Unlimited online access to articles from across Canada with one account.Get exclusive access to the Calgary Herald ePaper, an electronic replica of the print edition that you can share, download and comment on.Enjoy insights and behind-the-scenes analysis from our award-winning journalists.Support local journalists and the next generation of journalists.Daily puzzles including the New York Times Crossword.REGISTER / SIGN IN TO UNLOCK MORE ARTICLESCreate an account or sign in to continue with your reading experience.Access articles from across Canada with one account.Share your thoughts and join the conversation in the comments.Enjoy additional articles per month.Get email updates from your favourite authors.THIS ARTICLE IS FREE TO READ REGISTER TO UNLOCK.Create an account or sign in to continue with your reading experience.Access articles from across Canada with one accountShare your thoughts and join the conversation in the commentsEnjoy additional articles per monthGet email updates from your favourite authorsSign In or Create an AccountEmail AddressContinueor View more offersIf you are a Home delivery print subscriber, online access is included in your subscription.\nActivate your Online Access NowArticle contentNotably, Calgary saw the third most substantial improvement in average price, monthly mortgage payment and income required to qualify under the federal stress test rules.Article contentArticle contentArticle content“The biggest impact, though, was on the price side,” says Penelope Graham, mortgage expert with Ratehub.ca.Article contentNoon News RoundupYour weekday lunchtime roundup of curated links, news highlights, analysis and features.There was an error, please provide a valid email address.Sign UpBy signing up you consent to receive the above newsletter from Postmedia Network Inc.Thanks for signing up!A welcome email is on its way. If you don't see it, please check your junk folder.The next issue of Noon News Roundup will soon be in your inbox.We encountered an issue signing you up. Please try againInterested in more newsletters? Browse here.Article contentThe average price of a home in Calgary decreased by $4,700 from August to September to reach $567,900. That’s the third largest month-over-month decline among markets, trailing only Canada’s two largest markets.Article contentToronto topped the list with a decline of $9,400 to reach an average price in September of $960,300. In Vancouver, the cost fell $8,300 to about $1.14 million for the average cost of a home.Article contentThe price decline in Calgary was the key driver behind the decrease in the average monthly mortgage payment of $2,908, a drop of $30 from the previous month.Article contentFalling prices also lowered the amount of income to qualify under the federal stress test. It fell $1,100 to $123,200 in September from August to qualify for a rate of 6.47 per cent. That is a slight drop from August when the rate was 6.49 per cent. Both rates are two full percentage points above the posted mortgage rates for a five-year fixed rate used in the study. Borrowers must qualify at that highest threshold to ensure they can afford to pay their mortgage if interest rates rise.Article contentArticle contentAs well, Ratehub.ca calculated income requirements and mortgage payments based on a 10 per cent down payment.Article contentGraham notes that the drop in price and rates “did not really move the affordability dial” for those most affected by affordability challenges, first-time buyers.Article contentYet the study does point to a shift in Calgary’s resale real estate market, she adds.Article content“Calgary had been a seller’s market for quite some time, which started to unwind over the past couple of months,” she says. “That sales-to-new-listings ratio actually dropped” nearly nine percentage points in September. Calgary Real Estate Board statistics from Sept. 30 show the metric was 45 per cent, indicating a market with a balance between supply and demand. Yet the market has been trending toward favouring buyers as the ratio moves closer to 40 per cent, the threshold between a balanced and a buyer’s market, Graham says.Advertisement 1This advertisement has not loaded yet.Trending Braid: UCP performing major surgery on Alberta health care\nColumnists\nCalgary lands 14 spots on 2025 Canada Top 100 Restaurants list\nLocal News\nAdvertisement 1Story continues belowThis advertisement has not loaded yet, but your article continues below. Flights delayed, dozens of collisions and Calgary Transit routes adjusted after heavy snowfall across the city\nLocal News\nYour letters: Easy choice for Canada's next military jet\nLetters\nCartoon break time: Editorial cartoons from the past week (Nov. 24, 2025)\nOpinion\nAdvertisement 2AdvertisementThis advertisement has not loaded yet, but your article continues below.Article content“As well, supply is over four months, the highest since early 2020,” she says. “That reduces the edge sellers had, and buyers have more negotiation room.”Article contentOverall, the news is favourable for first-time buyers — though limited, says Calgary mortgage broker Cassia Miller, Alberta vice-president for Ratehub.ca.Article content“It’s not a significant change,” she says, noting the $30 reduction overall in average monthly cost.Article contentShe notes the additional cut by the Bank of Canada this month could be another boost, though that reduction is likely already priced into fixed rate mortgages. Miller notes their interest rates are largely determined by the bond market, which often moves in anticipation of central bank moves, among other economic factors.Article contentMiller adds that as of late October rates had already moved, with the lowest for a five-year fixed rate at about 3.79 per cent.Article content“That increases your purchasing power by about $25,000” based on the average price in Calgary, she says, noting that could help some first-time buyers.Article contentYet for the market to see significant growth, the Bank of Canada would likely need to cut rates more, Graham says.Article content“If the overnight lending rate went to two per cent, which we haven’t seen since 2022, that would still be” higher than during the pandemic.Article contentArticle contentShare this article in your social network\nShare this Story : Declining prices, interest rates improve housing affordability\nCopy Link\nEmail\nX\nReddit\nPinterest\nLinkedIn\nTumblr CommentsYou must be logged in to join the discussion or read more comments.Create an AccountSign in\nJoin the Conversation Postmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information.Featured Local Savings", "extraction_method": "beautifulsoup", "word_count": 1305, "success": true}