{"full_text": "Redding Chico EurekaNewsNewsRedding Public Market opens Tuesday after years of anticipationAfter a 7-year-long project, the Redding Public Market will finally open its doors on Tuesday, Nov. 25.There was a friends and family gathering over the past weLocal agencies unite at Chico State for comprehensive emergency response training exerciseLocal law enforcement and first responder agencies collaborated in a training exercise at Chico State to prepare for real-life emergency scenarios on Monday.&ldquo;WhCHP launches Thanksgiving holiday enforcement, focusing on seat belt safetyAs the holiday season gets closer, the California Highway Patrol (CHP) is beginning their Thanksgiving Holiday Enforcement Period (HEP).The HEP will begin on WCalifornia to enforce full plastic bag ban in grocery stores by JanuaryStarting Jan. 1, California will enforce a complete ban on plastic bags in grocery stores, requiring shoppers to use paper bags instead. This change follows theLocalLocal ElectionsKnow Your CandidatesWildfires and WaterNorthstate DivideAddicted NorthstateBeyond the PodiumConnect to CongressNation & WorldAmazing AmericaOffbeatEntertainmentNorthstate’s News PollsQuestion of the DaySpotlight on AmericaFull Measure with Sharyl AttkissonInside Your WorldCrisis in the ClassroomArmstrong Army StrongSoarWorking NorthstateWeatherCurrent WeatherReddingMostly Clear57F65/40Today65/40Tuesday65/37Wednesday66/38Latest WeathercastLatest WeathercastMapsRadarSky CamsRoad/Traffic ConditionsLake LevelsNorth Coast NewsNorth Coast NewsRedding Public Market opens Tuesday after years of anticipationAfter a 7-year-long project, the Redding Public Market will finally open its doors on Tuesday, Nov. 25.There was a friends and family gathering over the past weLocal agencies unite at Chico State for comprehensive emergency response training exerciseLocal law enforcement and first responder agencies collaborated in a training exercise at Chico State to prepare for real-life emergency scenarios on Monday.&ldquo;WhCHP launches Thanksgiving holiday enforcement, focusing on seat belt safetyAs the holiday season gets closer, the California Highway Patrol (CHP) is beginning their Thanksgiving Holiday Enforcement Period (HEP).The HEP will begin on WCalifornia to enforce full plastic bag ban in grocery stores by JanuaryStarting Jan. 1, California will enforce a complete ban on plastic bags in grocery stores, requiring shoppers to use paper bags instead. This change follows theNorth Coast NewsNorth Coast WeatherNorth Coast Sky CamsNCN Community CalendarChime InGame CenterGame CenterDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchWatchLiveNow57°Tue65°Wed66°SearchSearchUser IconWatchSearchNewsDown ArrowLocalLocal ElectionsKnow Your CandidatesWildfires and WaterNorthstate DivideAddicted NorthstateBeyond the PodiumConnect to CongressNation & WorldAmazing AmericaOffbeatEntertainmentNorthstate’s News PollsQuestion of the DaySpotlight on AmericaFull Measure with Sharyl AttkissonInside Your WorldCrisis in the ClassroomArmstrong Army StrongSoarWorking NorthstateWeatherDown ArrowWeather HomeMapsRadarSky CamsRoad/Traffic ConditionsLake LevelsNorth Coast NewsDown ArrowNorth Coast News HomeNorth Coast NewsNorth Coast WeatherNorth Coast Sky CamsNCN Community CalendarChime InGame CenterDown ArrowGame Center HomeDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchWildfires and WaterMoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsSportsDown ArrowSports HomeContentXtra PointTICKETSCity GuideFeaturesDown ArrowFeatures HomePack A BackpackStuff The BusCommunity ConnectTurtle Bay TuesdayPet of the WeekFor Pet's SakeAuto MattersRev It Up!Sinclair CaresTransmitterNewsletter Sign UpStationDown ArrowStation HomeMeet the TeamContactScheduleContestsCommunity CalendarNewsletter Sign UpCareersLegalDown ArrowTerms & ConditionsCopyright NoticesKRCR EEO Public File ReportFCC Info - KRCRFCC Applications - KRCRPublic File AssistanceKAEF EEO Public File ReportFCC Info - KAEFFCC Applications - KAEFFCC Info - KCVUFCC Applications - KCVUFCC Info - KBVUSinclair California LicenseeFCC Applications - KBVUContactConteststwitter iconfacebook iconACCESSIBILITYArmstrong Williams Town HallArmstrong Williams takes on the news of the week and asks the questions you want answered. Don’t miss our weekly town hall!WATCHClose11Please ensure Javascript is enabled for purposes of website accessibilityTrump administration tries to break through lock-in effect with 'portable mortgages'by AUSTIN DENEAN | The National News DeskFri, November 14, 2025 at 9:47 AM4VIEW ALL PHOTOSFILE - A for sale sign stands outside a home on the market in the Alamo Placita neighborhood Tuesday, Aug. 27, 2024, in central Denver. (AP Photo/David Zalubowski, File)Comment on this story0CommentShare storySharetopics: Mortgage ratesPortable mortgagesHousing affordabilityLock-in effectHomeownershipHousing supplyMortgage-backed securitiesTariffsWASHINGTON (TNND) — The Trump administration is considering another method to bring down soaring housing costs through mortgage rates that are pricing people out of homeownership and keeping homes from coming onto the market.Federal Housing Finance Agency director Bill Pulte said the administration is “actively evaluating “portable mortgages,” which would allow homebuyers to take their mortgage rate with them when they decide to move. The proposal is a direct bid to confront the so-called “lock-in effect,” where homeowners are unwilling or unable to part with their lower mortgage rate and keeping their home off the market.Many homeowners were able to buy or refinance during the pandemic for ultra-low rates at or below 3%, which cuts hundreds of dollars off a monthly mortgage payment. Rates have been stuck between 6 to 7% for the last several years, creating a barrier for homeowners to put their homes up for sale as they don’t want to take up a new loan at higher rates. More than half of homeowners with a mortgage have a rate below 4%, according to Redfin.Homes are changing hands at the lowest rate in decades in 2025 in a market that has been in a standstill for years as mortgage rates climbed and economic uncertainty set in. A Redfin analysis found only 2.8% of homes in the U.S. have turned over to a new owner in 2025.“Buyers are walking away from deals more often, sometimes due to affordability issues and sometimes because they’re re-evaluating whether now is the right moment to commit,” Redfin head of economic research Chen Zhao said in a release. “Others aren’t even shopping, waiting instead for prices or mortgage rates to come down. On the other side, many sellers are staying put—either because they’re locked into low rates or unwilling to accept offers below expectations.”Allowing people to take their mortgage rate with them to a new property could help boost the supply of existing homes on the market if more homeowners are willing to move with their lower rate.But it could also come with higher list prices as more people enter a market with a limited pool of homes available to buy. Homeowners would also have an advantage on bidding compared to a new buyer who is working with today’s rates with more wiggle room in their budgets.“Anyone able to ‘port’ a 3% mortgage into a new purchase would effectively be bidding with cheap financing in a 6% world. That added purchasing power would push prices up, while renters and mortgage-free owners would still face today’s higher rates—only now with even higher list prices,” Jake Krimmel, a senior economist at Realtor.com, wrote in an analysis.Portable mortgages could also disrupt the U.S. mortgage system and lead to higher rates. Mortgage-backed securities, groups of mortgages that lenders sell to investors, would have their pricing models blown up and create more risk for investors as less loans are paid off early with more homeowners taking them with them when they move.Pulte has also said officials are evaluating a plan to offer 50-year mortgages and how to make mortgages assumable, where homebuyers could take over a seller’s preexisting loan. Assumable mortgages are already available in the U.S. but are rarely used because they require a large cash payment or a second mortgage at current rates.The 50-year mortgage could lower monthly payments by stretching out the term of the loan but would also likely come with higher rates and would ultimately cost buyers more in interest over the life of the loan and make it take longer to build equity.The administration’s efforts to lower housing costs come as an increasing slice of Americans are being priced out of the market altogether with elevated mortgage rates and consistently growing list prices. Home values have climbed significantly compared to before the pandemic for both new and existing homes amid a lack of sufficient supply.A shortage of homes is widely seen as the biggest issue when it comes to tackling housing affordability in the United States. Construction cratered in the aftermath of the 2008 financial crisis and has struggled to recover to a sufficient level to meet the demand.Housing starts have slumped in 2025 as builders confront cost challenges and a stalled market. Higher rates are also a challenge for construction, which is also impacted by the rising cost of labor and materials.Tariffs have been a double blow for builders, as the uncertainty around them has chilled activity in the housing market and broader economy. Import taxes have also increased the cost of materials used to build homes, making it more expensive for builders to start and complete projects.Tariffs that went into effect last month imposed a 10% tax on all timber and lumber imports, along with a 25% tariff on kitchen cabinet and furniture. The U.S. imports about one-third of its lumber, primarily from Canada, that are also subject to further tariffs.TrendingGovernor Newsom appoints new Shasta County Superior Court judgeGovernor Gavin Newsom has appointed Patrick Deedon as the Shasta County Superior Court judge.The governor's office said Deedon has been a partner at Maire & DeMan arrested for car break-ins at Lithia Chevrolet in ReddingPolice arrested a they said committed a burglary early yesterday morning at Lithia Chevrolet in Redding.Siskiyou County Sheriff's investigate vehicle burglaries in Mount ShastaThe Siskiyou County Sheriff's Office is investigating a series of vehicle burglaries that took place on the morning of Nov. 10.Crews contain Paradise house fire to garage and attic, cause under investigationCal Fire firefighters were sent to a home fire early Monday morning in Paradise, leading to an multi-hour long investigation.Cal FirCalifornia to enforce full plastic bag ban in grocery stores by JanuaryStarting Jan. 1, California will enforce a complete ban on plastic bags in grocery stores, requiring shoppers to use paper bags instead. This change follows theNEWS IN PHOTOS:\"Local\"3Redding Public Market opens Tuesday after years of anticipation4Local agencies unite at Chico State for comprehensive emergency response training exercise3Redding begins $3 million water pump station project on Cypress Avenue4Saturday Forecast: Warm, sunny weekend beginsACCESSIBILITYTerms & ConditionsCopyright NoticesKRCR EEO Public File ReportFCC Info - KRCRFCC Applications - KRCRPublic File AssistanceKAEF EEO Public File ReportFCC Info - KAEFFCC Applications - KAEFFCC Info - KCVUFCC Applications - KCVUFCC Info - KBVUSinclair California LicenseeFCC Applications - KBVUContactContestsNewsWeatherSportsStationGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1625, "success": true}