{"full_text": "Trump administration tries to break through lock-in effect with 'portable mortgages'NewsNewsFederal funding bill includes nationwide ban on hemp productsA new federal provision included in the funding bill to reopen the government imposes a nationwide ban on most consumable hemp products, specifically targeting Llano Real Estate unveils Rock Ridge plan for 1,150 homes in Potter CountyLlano Real Estate in Amarillo is behind a new development in Potter County called Rock Ridge.There’s an old saying, \"If you build it, they will come,\" and planCity of Amarillo names 3 finalists for the next police chiefThe City of Amarillo named three finalists for the next chief of the Amarillo Police Department.The finalists are interim Chief Jimmy Johnson,Thomas Hover and 8th annual ABC 7 Toy DriveImagine waking up Christmas morning when you were a kid and there were no presents from Santa, and no presents under the tree.That's sadly the reality for someLocalNation & WorldConnect To CongressEntertainmentGuns, Violence & the Road to a Safer TexasOffbeatPanhandle SpiritElection ResultsElectionAmazing AmericaArmstrong Army StrongInside Your WorldSoarBeyond The PodiumQuestion of the DaySpotlight on AmericaHealthy HomeOpen for BusinessFull Measure with Sharyl AttkissonDid You Know?2020 ResultsAddicted AmericaCrisis in the ClassroomWildfireWeatherCurrent WeatherAmarilloClear45F56/36Today56/36Tuesday56/28Wednesday55/28Latest WeathercastLatest WeathercastRadarMapsCamerasClosingsHurricane CenterReport ClosingsSanta TrackerFirestorm 2024Preparing the PanhandleContestsContestsHOLIDAY TRIVIA OFFICIAL CONTEST RULESHOLIDAY TRIVIA OFFICIAL CONTEST RULESContest: HOLIDAY TRIVIAMarket(s)/Station(s): Abilene, TX (KTXS), Albany/Schenectady/Troy, NY (WCWN,WRGB), Amarillo, TX (KVITrick or Treat TriviaTRICK OR TREAT TRIVIA OFFICIAL CONTEST RULESContest: TRICK OR TREAT TRIVIAMarket(s)/Station(s): Abilene, TX (KTXS), Albany/Schenectady/Troy, NY (WCWN,WRGB), AmaSpotlightSpotlightZelle limits at top banksLooking to use Zelle for a transfer? Here are the Zelle limits at various banks.Is there price-fixing in the beef industry?Beef prices aren't likely to move much after Tyson Foods announced the closure of one of its plants, according to an agricultural economist.Federal funding bill includes nationwide ban on hemp productsA new federal provision included in the funding bill to reopen the government imposes a nationwide ban on most consumable hemp products, specifically targeting Llano Real Estate unveils Rock Ridge plan for 1,150 homes in Potter CountyLlano Real Estate in Amarillo is behind a new development in Potter County called Rock Ridge.There’s an old saying, \"If you build it, they will come,\" and planLifestyle MattersScannerSinclair CaresHometown SalutePartner SpotlightPet of the WeekBlack History HonorsFor Pet's SakeClassroom ChampionsInvisibleWater GrowsMental Health: You are not aloneVaccine InfoPanhandle To PlateGame CenterGame CenterDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchWatchLiveNow45°Tue53°Wed53°SearchSearchUser IconWatchSearchNewsDown ArrowLocalNation & WorldConnect To CongressEntertainmentGuns, Violence & the Road to a Safer TexasOffbeatPanhandle SpiritElection ResultsElectionAmazing AmericaArmstrong Army StrongInside Your WorldSoarBeyond The PodiumQuestion of the DaySpotlight on AmericaHealthy HomeOpen for BusinessFull Measure with Sharyl AttkissonDid You Know?2020 ResultsAddicted AmericaCrisis in the ClassroomWildfireWeatherDown ArrowWeather HomeRadarMapsCamerasClosingsHurricane CenterReport ClosingsSanta TrackerFirestorm 2024Preparing the PanhandleContestsSpotlightDown ArrowSpotlight HomeLifestyle MattersScannerSinclair CaresHometown SalutePartner SpotlightPet of the WeekBlack History HonorsFor Pet's SakeClassroom ChampionsInvisibleWater GrowsMental Health: You are not aloneVaccine InfoPanhandle To PlateGame CenterDown ArrowGame Center HomeDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchMoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsChime In TrafficDown ArrowTraffic HomeGas TrackerNewsletter Sign UpKVIIDown ArrowKVII HomeContactPeopleCareersContestsEEOTermsPrivacyCopyrightScheduleSportsDown ArrowSports HomeThe BlitzMore SportsClassroom ChampionScoreboardTICKETSCity GuideLegalDown ArrowTerms & ConditionsCopyright NoticesEEO Public File ReportKVII FCC InfoKVII FCC ApplicationsKVIH FCC InfoKVIH FCC ApplicationsPublic File AssistanceContactNews TeamCareersConteststwitter iconfacebook iconACCESSIBILITYArmstrong Williams Town HallArmstrong Williams takes on the news of the week and asks the questions you want answered. Don’t miss our weekly town hall!WATCHClose11Please ensure Javascript is enabled for purposes of website accessibilityTrump administration tries to break through lock-in effect with 'portable mortgages'by AUSTIN DENEAN | The National News DeskFri, November 14, 2025 at 11:47 AM4VIEW ALL PHOTOSFILE - A for sale sign stands outside a home on the market in the Alamo Placita neighborhood Tuesday, Aug. 27, 2024, in central Denver. (AP Photo/David Zalubowski, File)Comment on this story0CommentShare storySharetopics: Mortgage ratesPortable mortgagesHousing affordabilityLock-in effectHomeownershipHousing supplyMortgage-backed securitiesTariffsWASHINGTON (TNND) — The Trump administration is considering another method to bring down soaring housing costs through mortgage rates that are pricing people out of homeownership and keeping homes from coming onto the market.Federal Housing Finance Agency director Bill Pulte said the administration is “actively evaluating “portable mortgages,” which would allow homebuyers to take their mortgage rate with them when they decide to move. The proposal is a direct bid to confront the so-called “lock-in effect,” where homeowners are unwilling or unable to part with their lower mortgage rate and keeping their home off the market.Many homeowners were able to buy or refinance during the pandemic for ultra-low rates at or below 3%, which cuts hundreds of dollars off a monthly mortgage payment. Rates have been stuck between 6 to 7% for the last several years, creating a barrier for homeowners to put their homes up for sale as they don’t want to take up a new loan at higher rates. More than half of homeowners with a mortgage have a rate below 4%, according to Redfin.Homes are changing hands at the lowest rate in decades in 2025 in a market that has been in a standstill for years as mortgage rates climbed and economic uncertainty set in. A Redfin analysis found only 2.8% of homes in the U.S. have turned over to a new owner in 2025.“Buyers are walking away from deals more often, sometimes due to affordability issues and sometimes because they’re re-evaluating whether now is the right moment to commit,” Redfin head of economic research Chen Zhao said in a release. “Others aren’t even shopping, waiting instead for prices or mortgage rates to come down. On the other side, many sellers are staying put—either because they’re locked into low rates or unwilling to accept offers below expectations.”Allowing people to take their mortgage rate with them to a new property could help boost the supply of existing homes on the market if more homeowners are willing to move with their lower rate.But it could also come with higher list prices as more people enter a market with a limited pool of homes available to buy. Homeowners would also have an advantage on bidding compared to a new buyer who is working with today’s rates with more wiggle room in their budgets.“Anyone able to ‘port’ a 3% mortgage into a new purchase would effectively be bidding with cheap financing in a 6% world. That added purchasing power would push prices up, while renters and mortgage-free owners would still face today’s higher rates—only now with even higher list prices,” Jake Krimmel, a senior economist at Realtor.com, wrote in an analysis.Portable mortgages could also disrupt the U.S. mortgage system and lead to higher rates. Mortgage-backed securities, groups of mortgages that lenders sell to investors, would have their pricing models blown up and create more risk for investors as less loans are paid off early with more homeowners taking them with them when they move.Pulte has also said officials are evaluating a plan to offer 50-year mortgages and how to make mortgages assumable, where homebuyers could take over a seller’s preexisting loan. Assumable mortgages are already available in the U.S. but are rarely used because they require a large cash payment or a second mortgage at current rates.The 50-year mortgage could lower monthly payments by stretching out the term of the loan but would also likely come with higher rates and would ultimately cost buyers more in interest over the life of the loan and make it take longer to build equity.The administration’s efforts to lower housing costs come as an increasing slice of Americans are being priced out of the market altogether with elevated mortgage rates and consistently growing list prices. Home values have climbed significantly compared to before the pandemic for both new and existing homes amid a lack of sufficient supply.A shortage of homes is widely seen as the biggest issue when it comes to tackling housing affordability in the United States. Construction cratered in the aftermath of the 2008 financial crisis and has struggled to recover to a sufficient level to meet the demand.Housing starts have slumped in 2025 as builders confront cost challenges and a stalled market. Higher rates are also a challenge for construction, which is also impacted by the rising cost of labor and materials.Tariffs have been a double blow for builders, as the uncertainty around them has chilled activity in the housing market and broader economy. Import taxes have also increased the cost of materials used to build homes, making it more expensive for builders to start and complete projects.Tariffs that went into effect last month imposed a 10% tax on all timber and lumber imports, along with a 25% tariff on kitchen cabinet and furniture. The U.S. imports about one-third of its lumber, primarily from Canada, that are also subject to further tariffs.TrendingCity of Amarillo names 3 finalists for the next police chiefThe City of Amarillo named three finalists for the next chief of the Amarillo Police Department.The finalists are interim Chief Jimmy Johnson,Thomas Hover and Erika Kirk opens up about wishing for pregnancy after husband's tragic assassinationKirk joined Megyn Kelly for a live interview on the last stop of Kelly's Sirius XM tour in Glendale, Arizona. Google announces new data center in Armstrong CountyGoogle has announced plans to build a new data center on 1,300 acres near Claude, Texas, with construction already underway by Crusoe Energy since May.Armstron7 on ABC 7: The 7 biggest stories from last week you might have missedHere are the top stories from the week of Nov. 16-22:Amarillo house fire causes $60,000 in damagesA firefighter was injured while working a residential fire that caused $60,000 in damages on Saturday night.The Amarillo Fire Department responded to a residentNEWS IN PHOTOS:\"Local\"5Federal funding bill includes nationwide ban on hemp products7Llano Real Estate unveils Rock Ridge plan for 1,150 homes in Potter County4City of Amarillo names 3 finalists for the next police chief4Google announces new data center in Armstrong CountyACCESSIBILITYDownload Our Mobile Apps:Terms & ConditionsCopyright NoticesEEO Public File ReportKVII FCC InfoKVII FCC ApplicationsKVIH FCC InfoKVIH FCC ApplicationsPublic File AssistanceContactNews TeamCareersContestsNewsWeatherSportsGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1630, "success": true}