{"full_text": "Fact Check Team: Will Trump's 50-year mortgage idea solve or worsen housing affordability?NewsNewsWoman, 73, dies after being hit by two cars near US-31 and Hoadley Road Sunday eveningBENZIE COUNTY, Mich., (WPBN/WGTU) -- A woman, 73 of Benzonia, is dead after being hit by two cars near US-31 and Hoadley Road Sunday evening, November 23, accorLake Michigan's water levels drop rapidly, raising concerns about climate impactGREAT LAKES, Mich., (WPBN/WGTU) -- If you’ve driven along the Lake Michigan shoreline recently, you’ve probably noticed low water levels. While we’re not at hisU.S. Coast Guard marks 50 years since Edmund Fitzgerald sinkingThis month, Coast Guard Air Station Traverse City and Air Station Detroit commemorated the 50th anniversary of the tragic sinking of the Edmund Fitzgerald.CoasThanksgiving cooking safety: Traverse City fire department warns of deep-frying dangersGRAND TRAVERSE COUNTY, Mich,. (WPBN/WGTU) --According to the National Fire Protection Association, Thanksgiving is the leading day for home cooking fires.TraveLocal Beyond The PodiumNation & WorldEntertainmentConnect To CongressOffbeatVideosElectionEconomyAmazing AmericaAuto MattersElection ResultsMichigan PoliticsArmstrong Army StrongLifestyle MattersInside Your WorldPoliticalSoarNeighborhoodSpotlight on AmericaMichigan MarijuanaTrafficHealthy HomeFull Measure with Sharyl AttkissonDid You Know?2020 ResultsAddicted MichiganCrisis in the ClassroomClosed CasesWeatherCurrent WeatherTraverse CityCloudy52F53/41Today53/41Tuesday51/40Wednesday44/28Latest WeathercastLatest WeathercastRadarClosingsWeather CamerasMapsFish and Game ReportHurricane TrackerSnowballHotshotsUpNorthLive SkyView DroneDeals - SpotlightCommunityCommunityUS ready to launch more operations against VenezuelaThe U.S. is ready to launch more operations against Venezuela this week, Reuters reported over the weekend.Lizzo reveals she was 'suicidal' at the beginning of her weight loss journeyLizzo was in a low place at the start of her weight loss journey, feeling \"suicidal\" after a public scandal, all of which she channeled into healthier habits.Trump to visit Beijing in April, China's Xi invited for state visit next yearThe phone call came nearly one month after the two men met in person for the first time in six years.Jessica Simpson reveals Ashton Kutcher’s one-word response to her being a virgin at 22There’s one thing Jessica Simpson will never forget Ashton Kutcher’s response to her virginity. Community CalendarChime InUp North PetsExploring MichiganAsk the AttorneyYour Mental Health ConnectionMaking CentsGame CenterGame CenterDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchWatchLiveNow52°Tue51°Wed42°SearchSearchUser IconWatchSearchNewsDown ArrowLocal Beyond The PodiumNation & WorldEntertainmentConnect To CongressOffbeatVideosElectionEconomyAmazing AmericaAuto MattersElection ResultsMichigan PoliticsArmstrong Army StrongLifestyle MattersInside Your WorldPoliticalSoarNeighborhoodSpotlight on AmericaMichigan MarijuanaTrafficHealthy HomeFull Measure with Sharyl AttkissonDid You Know?2020 ResultsAddicted MichiganCrisis in the ClassroomClosed CasesWeatherDown ArrowWeather HomeRadarClosingsWeather CamerasMapsFish and Game ReportHurricane TrackerSnowballHotshotsUpNorthLive SkyView DroneDeals - SpotlightDown ArrowDeals - Spotlight HomePartner SpotlightBack to SchoolFor Pet's SakeMoneywiseTackle HungerUp North PetsCommunity CalendarMaking CentsCommunityDown ArrowCommunity HomeCommunity CalendarChime InUp North PetsExploring MichiganAsk the AttorneyYour Mental Health ConnectionMaking CentsGame CenterDown ArrowGame Center HomeDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchMoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsChime InSportsDown ArrowSports HomeHometown HighlightsOlympicsMore SportsScoreboardThe Blue PrintTICKETSCity GuideHealthDown ArrowHealth HomeHealth NewsDealsDown ArrowDeals HomeGolf CardHoliday MarketplaceNewsletter Sign UpStationDown ArrowStation HomeContact WPBN/WTOMContact WGTQ/WGTUPeopleScheduleContestsCareersEEOTermsCopyrightPrivacyCommunity CalendarVideo Request ServicesCreative ServicesSinclair CaresNewsletter Sign UpLegalDown ArrowTerms & ConditionsCopyright NoticesEEO Public File ReportWPBN FCC Info WPBN FCC ApplicationsWGTU FCC InfoWGTU FCC ApplicationsWGTQ FCC InfoWGTQ FCC ApplicationsWTOM FCC InfoWTOM FCC ApplicationsPublic File AssistanceContact WPBN/WTOMContact WGTQ/WGTUNews TeamCareersConteststwitter iconfacebook iconACCESSIBILITYPlease ensure Javascript is enabled for purposes of website accessibilityFact Check Team: Will Trump's 50-year mortgage idea solve or worsen housing affordability?by EMMA WITHROW | Fact Check TeamTue, November 18, 2025 at 7:37 PMUpdated Tue, November 18, 2025 at 10:59 PM4VIEW ALL PHOTOSWASHINGTON, DC - NOVEMBER 17: U.S. President Donald Trump delivers remarks during a meeting of the White House Task Force on the FIFA World Cup 2026 in the Oval Office of the White House on November 17, 2025 in Washington, DC. The task force was created to oversee security, logistics, and federal government support for the 2025 Club World Cup and the 2026 FIFA World Cup, jointly hosted by the United States. (Photo by Win McNamee/Getty Images)Comment on this story5CommentShare storySharetopics: MortgageHousing affordabilityUnderwater mortgagesHomebuildersInterest ratesDonald Trump50-year mortgageNegative equity WASHINGTON (TNND) — The Federal Reserve signaled this week that aspiring home buyers expecting more interest-rate relief may have to keep waiting. And that delay is exposing a deeper problem in the housing market: hundreds of thousands of Americans who bought newly built homes over the last few years are already underwater on their mortgages.It’s a trend analysts say didn’t happen by accident, and the lending practices behind it mirror warning signs from the early 2000s. (TNND)It’s a trend analysts say didn’t happen by accident, and the lending practices behind it mirror warning signs from the early 2000s.How Builders Helped Create a Wave of Underwater MortgagesBeing “underwater” on a mortgage simply means you owe more than your home is currently worth. As Bankrate’s chief financial analyst Greg McBride explains, “you owe more than the current value the asset is worth less than the amount you borrowed”.But according to a new analysis first reported by The Wall Street Journal, many homeowners who purchased newly built houses in 2022–2024 landed in that position almost immediately. That’s because large homebuilders have been offering artificially low mortgage rates, often far below market levels — in exchange for higher home prices.Here’s what WSJ found, based on data from analyst John Comiskey:27% of Lennar’s FHA loans from 2022–2024 are now underwater.18% of D.R. Horton’s FHA loans are underwater.10% of Quicken Loans’ FHA loans (a non-builder lender) are underwater.The playbook works like this: builders advertise mortgage rates around 3.99%, even while the broader market hovered closer to 6.3%. But to make the numbers work, they keep sale prices above what the property might otherwise be worth. Buyers get a lower monthly payment, but at the cost of taking out a loan that’s already near, or above, the home’s actual value.When prices stopped rising, many borrowers slid into negative equity almost immediately.What Happens When You’re Underwater?For homeowners, the consequences are severe, and in some cases, financially immobilizing.You can’t easily sell your home. Selling requires bringing cash to the closing table to cover the gap between the loan balance and the sale price. That can mean writing a check for tens of thousands of dollars.You can’t refinance. Lenders require equity to approve a refi. Without it, homeowners are effectively locked into their existing rates.The risk of default rises. When people owe far more than their home is worth, they’re more likely to walk away, a dynamic that played a major role in the 2008 housing crash, according to Bankrate.It becomes a systemic risk. Large pockets of underwater loans strain lenders, federal backstops, and local housing markets.In short, underwater mortgages trap households and can reverberate far beyond a single borrower.Is a 50-Year Mortgage a Solution, or Another Risk?Into this climate stepped former President Donald Trump, who floated a new idea on Truth Social: 50-year mortgages.Supporters call it an affordability boost. Critics are calling it a “lifetime mortgage.”The Upside: Lower PaymentsLower payments could help more people qualify, especially first-time buyers who fail debt-to-income checks. (TNND)A 50-year mortgage would spread repayment over two extra decades, meaning lower monthly payments.A New York Times analysis found that on a $500,000 home, a borrower could save about $250–$300 a month, around $4,000 a year, with a 50-year loan versus a standard 30-year mortgage.Lower payments could help more people qualify, especially first-time buyers who fail debt-to-income checks.The Downsides: Higher Costs and Bigger RisksThere would be enormous lifetime interest. Using the same NYT example: 30-year mortgage interest: ~$500,00050-year mortgage interest: nearly $900,000You’d pay almost twice the price of the home in interest alone.The National Association of Realtors says the median age of a first-time buyer used to be 36 but is now 40. Add 50 years and they’d be 86 by the time the loan matures.The Bottom LineBuilder-backed mortgages helped more Americans buy homes in a tough market, but often at the cost of pushing them into inflated prices and negative equity. Now, with underwater mortgages spreading across multiple major homebuilders, policymakers are starting to ask whether the industry’s lending incentives need a closer look.Comment with BubblesJOIN THE CONVERSATION (5)Meanwhile, Trump’s 50-year mortgage proposal aims to boost affordability but could introduce new long-term risks: massive interest payments, slower equity, and more households vulnerable to downturns.Trending51-year-old man arrested following attempted abduction at Traverse City Meijer parking lotGRAND TRAVERSE COUNTY, Mich,. (WPBN/WGTU) - - A 51-year-old Benzie County man was arrested Saturday following an attempted abduction that was reported at the MWoman, 73, dies after being hit by two cars near US-31 and Hoadley Road Sunday eveningBENZIE COUNTY, Mich., (WPBN/WGTU) -- A woman, 73 of Benzonia, is dead after being hit by two cars near US-31 and Hoadley Road Sunday evening, November 23, accorMichigan couple sentenced to 10 years for child abuse, plead guilty to charges in Tenn.WEXFORD COUNTY, Mich,. (WPBN/WGTU) - - A Northern Michigan couple, Jason and Jessica Klimp, are set to appear in court again after pleading guilty to aggravatedInvasive 'jumping worms' from Southeast Asia raise alarm across Michigan's ecosystemsAn invasive worm is causing concern in northern Michigan and across the state.Report: Tyson to close large meat plant just weeks after Trump's collusion claims Tyson, one of the nation's largest meat packing companies, is planning to close a large meat packing plant in Lexington, Nebraska.NEWS IN PHOTOS:\"Local\"6U.S. Coast Guard marks 50 years since Edmund Fitzgerald sinking4Bergmann Center returns to main facility after March ice storm damage4Community rallies to support Kristy Hooper's dual battle: leukemia and son's legacy4Playground plan includes sourced items from two construction projects in Traverse CityACCESSIBILITYDownload Our Mobile Apps:Terms & ConditionsCopyright NoticesEEO Public File ReportWPBN FCC Info WPBN FCC ApplicationsWGTU FCC InfoWGTU FCC ApplicationsWGTQ FCC InfoWGTQ FCC ApplicationsWTOM FCC InfoWTOM FCC ApplicationsPublic File AssistanceContact WPBN/WTOMContact WGTQ/WGTUNews TeamCareersContestsNewsWeatherSportsGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1566, "success": true}