{"full_text": "NewsPolitics\nTwo Denver suburbs take different paths as residents face housing crunch: ‘We can manage it, but just barely’\nLakewood barrels forward with zoning changes, while Littleton battles residents' density pushbackShare this:\nClick to share on Facebook (Opens in new window)\nFacebook\nClick to share on X (Opens in new window)\nX\nA residential neighborhood near the corner of South Harlan Street and West Jefferson Place in Lakewood on Friday, Sept. 26, 2025. (Photo by Hyoung Chang/The Denver Post)\nBy John Aguilar | jaguilar@denverpost.com | The Denver PostPUBLISHED: October 5, 2025 at 6:00 AM MDT Getting your Trinity Audio player ready...Two suburban cities south and west of Denver find themselves on distinctly different tracks in addressing a long-vexing problem — the high prices and elevated borrowing costs that box out young families and renters of all ages from buying a home.\nIn Lakewood, elected leaders spent the summer overhauling the city’s zoning code and land use rules. Their goal: to encourage the building of more varied housing types, and by extension greater density, in the city of 156,000, with the ultimate aim of lowering overall home prices.\nIn Littleton, a similar pro-density effort had sparked a furious backlash earlier this year. Now a citizen-initiated measure is bound for the Nov. 4 ballot and, if passed, it will restrict a large chunk of the city from having anything but single-family homes — a stark pivot from city leaders’ prior goal.\nEach city is part of a larger density debate that has played out in communities across metro Denver and has dominated housing affordability discussions at all levels, from the Colorado statehouse to neighborhood streets.\nLittleton City Councilwoman Andrea Peters, who is also a real estate agent, said the lack of “missing middle” housing in her city is having a chain-reaction effect on younger families seeking their first home as well as older people looking to downsize. That type of housing includes duplexes, triplexes and attached townhomes, which are designed to house more people per square foot but are less imposing than hulking apartment buildings or condos.\n“We have an aging demographic and we don’t have a plan for younger families,” Peters said. “If we have more smaller-size options (for downsizers), that frees up that larger home for someone else.”\nMark Harris, an eight-year resident of Littleton, is part of a group dubbed Rooted in Littleton that is behind Measure 3A on this fall’s ballot. He says the goal is to stop the city from shoehorning certain housing types into neighborhoods where they don’t fit and where residents don’t want them.\nMark Harris, left, and Joe Whitney, who are leading an anti-density movement in Littleton, stand outside a newly built triplex in Littleton on Sept. 25, 2025. (Photo by RJ Sangosti/The Denver Post)\n“Our intent is to preserve single-family land use — that’s what we’re trying to do,” he said. “We are not anti-growth. We are not anti-affordable housing. We just don’t want duplexes, triplexes and quadplexes imposed on us.”\nAs high-level discussions on affordability have taken up much of the oxygen in policy debates in recent years, the issue has been tackled in the state Capitol. A collection of bills passed in 2024 and signed into law by Gov. Jared Polis was designed to increase higher-density living and bring home prices down.\nSeveral Front Range municipalities have, in turn, sued the state, claiming its mandate to implement zoning-related changes encroached on their home rule powers to set their own land-use rules.\nAnd at the center of it all is raw emotion.\n“This place doesn’t resemble what it used to be — not at all,” said Regina Hopkins, a lifelong Lakewood resident who feels the growth in her city over the last couple decades has been out of control. “Why are local governments being forced to fix what is a state issue?”\nHopkins, 40, and others in Lakewood are exploring whether to put their own measure on the ballot to roll back what the city is expected to finalize on Oct. 13.\nBut for newcomer Robert Adams, Lakewood is doing the right thing. At 39, he finally got out of the rental game by purchasing a 1,200-square-foot, 1950s-era home in the city.\n“After my years of renting, we bought 2½ years ago — and it’s quite a burden to afford a moderately-priced home,” he said.\nWhile home prices have finally stagnated across metro Denver in recent months, they haven’t come down much from their record levels. The median price gain of a residential property sold in August in metro Denver was 0.3% compared to the same month a year earlier, rising to $587,000, according to a recent report from Homes.com. That was below the 2.4% annual price gain seen nationally, the site said.\nIn August 2021, when values were surging, metro Denver home prices rose 17.4% compared to a year earlier.\nWhile some experts say the local housing scene has flipped to a buyer’s market, high mortgage rates are keeping things tough for those on the hunt for a listing. Adams paid $650,000 for his Lakewood house, and he carries a 6.6% interest rate on his loan.\n“We can manage it, but just barely,” he said.\nNeed for ‘missing middle’ housing\nThe Lakewood City Council has already approved three rounds of updates to the city’s zoning code. Those include measures allowing diverse housing stock anywhere in the city, limiting new home sizes to 5,000 square feet, and encouraging the conversion of vacant or underused commercial buildings to housing.\nCouncil members will cast one last vote Oct. 13 on a final zoning map. The new rules will go into effect on Jan. 1.\n“Right now, Lakewood is an infill city and there’s not a lot of housing stock coming online,” Adams said. “The supply and demand effect is real. The core idea of this zoning update is that it allows more units to be built — it creates more units for people who are desperately looking for a house.”\nRobert Adams stands in front of his home in Lakewood on Friday, Sept. 26, 2025. (Photo by Hyoung Chang/The Denver Post)\nLakewood Mayor Wendi Strom said the overhaul had taken much of the council’s time in recent months. She remembers adjourning one council meeting just before 3 a.m. in September as its members dissected and analyzed dense zoning code documents deep into the night.\nThe process, she said, isn’t going to make everyone in the city happy.\n“This is their home — these are the roofs over their heads,” Strom said. “And it can be concerning what’s happening on the lot next to yours.”\nBut the mayor has also heard impassioned pleas from young families that just can’t crack the overinflated market. Supporting the development of more housing options will help those young families as well as older residents, teachers, firefighters and first-time homebuyers, she said.\n“We have seen a level of concern from young people about the changes not being made,” Strom said. “Right now, we have way more demand than supply.”\nAccording to the Lakewood Strategic Housing Plan, released in early 2024, planners estimated that the city would need at least 5,800 new homes built over the next 10 years to satisfy anticipated demand.\nAt the metro level, the Denver Regional Council of Governments concluded in a September 2024 report that an area encompassing slightly beyond the Denver area would need 216,000 new housing units — whether houses or apartments or other multifamily units — by 2032.\nFifty-two thousand of them would cover the current shortage, while 164,000 of that total represent new units needed in the future, DRCOG concluded.\nHouses now larger — and more expensive\nMax Nardo, a housing and smart growth senior associate with the Southwest Energy Efficiency Project, said the status quo simply wasn’t working. His organization has been following the Lakewood code updates closely.\n“Cities in Colorado are dealing with the same housing crisis, and many are looking at the same solutions — smaller homes on smaller lots,” he said.\nLakewood’s housing assessment report concluded that nearly three-quarters of households in the city had just one or two people. It also noted that the average single-family home built since 2000 had about 2,600 square feet of space — much larger than houses built decades earlier — and sold for more than $1.1 million.\n“It’s a ridiculous mismatch with what the city really needs,” Nardo said.\nA home is under construction at 6400 W. Exposition Ave. in Lakewood on Friday, Sept. 26, 2025. (Photo by Hyoung Chang/The Denver Post)\nBut Lakewood has seen at least one major institutional protest to its plans. The Green Mountain Water and Sanitation District, which serves 10,000 accounts, accounting for 48,000 residents in Lakewood, wrote a letter to the city in August. It warned that “densification” of the city’s housing stock could compromise the district’s ability to provide adequate service.\nKaren Morgan, the district’s president, told The Denver Post that the district had to plan for the long term.\n“We are already overcapacity with our sewer pipes,” she said. “We do not have the infrastructure to handle that density, especially since we don’t know when it’s happening.”\nA potential harbinger of what could emerge in the wake of Lakewood’s update might exist in Portland, Oregon, where city leaders undertook a similar effort to encourage denser residential construction a few years ago, Nardo said.\nA review of outcomes from that initiative found that between August 2021 and June 2024, the city permitted more than 1,400 accessory dwelling units — which typically include garage apartments and granny flats — and middle housing units, which the report described as duplexes to cottage clusters. The most common middle housing unit built during that period in Portland was a two-bedroom home weighing in at a cozy 900 square feet.\nMost notably, according to the report, the average sale price of one of those new market-rate middle housing units in 2023 and 2024 was about $250,000 less than the price of a new single-family detached house.\nAdams, the new homeowner in Lakewood, said today’s housing market is far different from what it was when many homeowners who are wary about the city’s initiative bought their properties.\n“They bought in at a time when it was more affordable, and they are scared that it’s going to change overnight,” he said. “But if they look at other places that have done this, it’s a slow process.”\nThat gives little comfort to folks like Hopkins, 40, who took a lead in opposing the construction of a five-story apartment complex on the edge of Belmar Park in recent years. That project, she feared, would ruin the feel of a natural oasis in the middle of Lakewood. The developer overcame that fight and is now proceeding toward construction.\n“One of the reasons I oppose the code changes is that a neighborhood’s character will completely change,” she said. “They’re trying to urbanize and gentrify Lakewood. They are just trying to increase density.”\n‘All that does is gentrify’\nIn Littleton, Joe Whitney says building more units won’t necessarily translate to lower home prices. Prices are struck on more than just the availability of housing stock, he says. They also depend on construction costs and what is profitable for the builder.\nHe points to a recently built triplex on South Sycamore Street that offered little price relief to those looking for a home in Littleton, despite the building offering more living units than the single-family homes surrounding it. According to online records from the Arapahoe County Assessor’s Office, the three attached units were purchased for between $980,000 and $1.15 million — prices well above the metro area median.\n“All that does is gentrify — it doesn’t improve affordability,” Whitney said of the new construction. “The last thing we want to see is Littleton turn into Lakewood.”\nHousing economists and advocates for more density point out that there’s more complexity at play in the housing market. They argue that the building of high-end units still reduces overall pressure on rents and housing prices as residents of lower-cost homes upgrade, moving out and making those older units available.\nBut the gentification concern is why Rooted in Littleton chose to try and preempt the city from doing what Harris called another “sneak attack” on the city’s residents. That’s the term he uses to characterize the contretemps that occurred in January, when the council abandoned an attempt to welcome denser housing types in the city after blowback from the community.\nThe ballot measure, if approved by voters next month, would keep the council from bringing other types of housing to single-family neighborhoods, which Harris said cover nearly half of Littleton’s land mass.\nNothing, however, would stop homeowners from requesting permission from the city to build nonconforming structures on their lot.\n“We’re not trying to tie the hands of individual property owners — we’re trying to tie the hands of a City Council that just wants density,” he said.\nMail ballots for Littleton’s election will go out beginning Friday.\nPeters, the Littleton councilwoman, worries about the fiscal impact on Littleton if the measure ends up passing. The governor, in August, signed an executive order that threatened to withhold grants from cities that refuse to follow the new state housing laws.\nIf Littleton’s hands are tied by the restrictions laid out in the ballot measure, Peters said, “it means we’ll be out of compliance with the state and ineligible for grant money.”\nColorado Municipal League Executive Director Kevin Bommer said what’s playing out today in Littleton and Lakewood strikes on a familiar theme, “especially when the pressure to grow comes head-to-head with the desire to preserve the character of a community.”\nBut Bommer, a vocal opponent of state interference in municipal decisions, said “these difficult conversations are happening exactly where they are supposed to be,” at the city level.\n“Local control — or local decision-making — isn’t always pretty, but it is the best way to solve local challenges and talk about the future,” he said. “This is precisely how things need to happen.”\nGet more Colorado news by signing up for our daily Your Morning Dozen email newsletter.\nShare this:\nClick to share on Facebook (Opens in new window)\nFacebook\nClick to share on X (Opens in new window)\nX\nRevContent Feed\nEvents\nMost PopularMost PopularAsking Eric: Family punished for missing wedding 50 years laterAsking Eric: Family punished for missing wedding 50 years laterDirt likely to fly starting in 2026 on NISP water projectDirt likely to fly starting in 2026 on NISP water projectNorthern Colorado home day care owner charged with child abuseNorthern Colorado home day care owner charged with child abuseCSU quarterback Darius Curry suspended for unsportsmanlike conduct against Boise StateCSU quarterback Darius Curry suspended for unsportsmanlike conduct against Boise State‘Berthoud Deserves a Vote’ campaign puts downtown project in jeopardy‘Berthoud Deserves a Vote’ campaign puts downtown project in jeopardyThings to do in the Loveland area Sunday, Nov. 23: Holiday lights, Garrison KeillorThings to do in the Loveland area Sunday, Nov. 23: Holiday lights, Garrison KeillorDriver killed in westbound I-70 crash near PalisadeDriver killed in westbound I-70 crash near PalisadeYour Daily Horoscope for Sunday, November 23, 2025Your Daily Horoscope for Sunday, November 23, 2025Ellory Anne Bauersfeld selected as Miss Loveland Valentine 2026Ellory Anne Bauersfeld selected as Miss Loveland Valentine 2026RH Line calls for Sunday, Nov. 23, 2025RH Line calls for Sunday, Nov. 23, 2025", "extraction_method": "beautifulsoup", "word_count": 2562, "success": true}