{"full_text": "White House’s 50-year mortgage proposal draws heavy criticism\nPlease ensure Javascript is enabled for purposes of website accessibility\nSkip to content\nSelect Region or Brand\nBusiness\nColorado\nIdaho\nLehigh Valley, PA\nLong Island\nNew Orleans, LA\nNew Jersey\nLong Island, NY\nMaryland\nMinnesota\nMecklenburg, NC\nOklahoma City, OK\nRochester, NY\nSouth Carolina\nVirginia\nPet Age\nColor Magazine\nLegal\nMassachusetts\nVirginia\nMissouri\nMinnesota\nNew York\nNorth Carolina\nSouth Carolina\nWisconsin\nMichigan\nRhode Island\nConstruction\nMilwaukee, WI\nOregon\nHome Furnishings\nDesigners Today\nFurniture Today\nGifts & Decorative Accessories\nHome Accents Today\nHome Furnishings News\nHome Textiles Today\nPet Age\nManage Account\nManage Print or Online Subscription\nManage Your Email Subscriptions\nSign In\nUpcoming Event\nMinnesota ICONS\nFree Newsletter\nSubscribe\nNews\nEvents\nWebinars\nPodcast\nPublic Notices\nAbout\nFAQ\nSubscribe\nSubmit a public notice\nPress Releases\nProfessional Announcements\nBTM Business Connect\nBehind the Deal\nContributor Content\nAdvertising\nNews\nNews\nBeyond the Skyline Podcast\nConstruction & Development\nReal Estate\nJust Sold\nOn the Market\nSustainable\nSpotlight on Small Biz\nNation & World\nFinance & Banking\nBusiness calendar\nMost Read\nSections\nTop Projects\nTop Women in Finance\nReader Rankings\nMinnesota AEC 250\nThe Power List Developers\nThe Power List M&A\nThe Power List Construction & Real Estate Law\nEmpowering Women\nIn the Lead\nMinnesota Icon\nRising Young Professionals\nTop Women in Construction\nWomen Who Lead\nExperts Forum\nTrackers\nTwin Cities Apartment Sales Tracker\nTwin Cities Hotel Sales Tracker\nRochester Sales Tracker\nTwin Cities Apartment Development Tracker\nTwin Cities Hotel Development Tracker\nRochester Development Tracker\nPublic Notices\nAbout\nFAQ\nSubscribe\nSubmit a Public Notice\nSubscribe\nSubscribe\nGroup subscriptions\nPress Releases\nProfessional Announcements\nContributor Content\nBTM Business Connect\nBehind the Deal\nAdvertise & Contact\nAdvertising\nAbout Us\nContact Us\nPlaques & Permissions\nEvents\nEvents\nWebinars\nCategory:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display:\nWhite House’s 50-year mortgage proposal draws heavy criticism\nThe Associated Press//November 12, 2025//\nNew homes dot the landscape in Middlesex Township, Pennsylvania, on April 19, 2023. The White House is weighing a 50-year mortgage plan to tackle the housing crisis, but critics say it won’t fix supply shortages or high interest rates. (AP File Photo: Gene J. Puskar)\nHome>Business & Economy>White House’s 50-year mortgage proposal draws heavy criticism\nNew homes dot the landscape in Middlesex Township, Pennsylvania, on April 19, 2023. The White House is weighing a 50-year mortgage plan to tackle the housing crisis, but critics say it won’t fix supply shortages or high interest rates. (AP File Photo: Gene J. Puskar)\nWhite House’s 50-year mortgage proposal draws heavy criticism\nThe Associated Press//November 12, 2025//\nListen to this article\nThe Blueprint\nThe White House is considering a 50-year mortgage to improve housing affordability.\nEconomists say the plan won’t fix issues like limited housing supply or high rates.\nBorrowers could pay nearly $389,000 more in interest than with a 30-year loan.\nCritics note most Americans wouldn’t live long enough to pay off a 50-year mortgage.\nNEW YORK — The White House says it is considering backing a 50-year mortgage to help alleviate the home affordability crisis in the country. But the announcement drew immediate criticism from policymakers, social media and economists, who said a 50-year mortgage would do little to resolve other core problems in the housing market, such as a lack of supply and high interest rates.\nBill Pulte, director of the Federal Housing Finance Agency, said on X over the weekend that a 50-year mortgage would be “a complete game changer” for homebuyers. FHFA is the part of the federal government that oversees Fannie Mae and Freddie Mac, which buy and insure the vast majority of mortgages in the country.\nThe 30-year mortgage is a uniquely American financial product and the default way to buy a home since the New Deal. Politicians and policymakers at the time wanted to create a standardized mortgage that borrowers could afford and pay off during their working years, when the average lifespan for an American was 66 years old.\nLower payment\nExtending the life of a mortgage to 50 years does decrease a borrower’s monthly payment.\nThe average selling price of a home in the U.S. was $415,200 in September, according to National Association of Realtors. Assuming a standard 10% down payment and an average interest rate of 6.17%, the monthly payment on a 30-year mortgage would be $2,288 while the payment on a 50-year mortgage would be $2,022. That’s presuming a bank would not require a higher interest rate on a 50-year mortgage, due to the longer duration of the loan.\nBut significantly higher interest\nBecause even more of the monthly payment on a 50-year mortgage would go toward interest on the loan, it would take 30 years before a borrower would accumulate $100,000 in equity, not including home price appreciation and the down payment. That’s compared to 12-13 years to accumulate $100,000 in equity when paying off a 30-year mortgage, excluding the down payment.\nA borrower would pay, roughly, an additional $389,000 in interest over the life of a 50-year mortgage compared to a 30-year mortgage, according to an AP analysis.\nOther analysts came to a similar conclusion.\n“Extending a mortgage from 30 years to 50 years could double the [dollar] amount of interest paid by the homebuyer on a median priced home over the life of the loan and significantly slow equity accumulation,” wrote John Lovallo with UBS Securities.\nBroader housing issues\nA 50-year mortgage does nothing to solve one critical issue when it comes to housing affordability — the lack of supply of homes. States like California and cities like New York have recently passed legislation or made regulatory changes to allow builders to build homes faster with less regulatory red tape.\nThere’s also the raw cost of homebuilding in the country. Products such as steel, lumber, concrete, copper and plastics that go into home construction are now subject to tariffs under President Trump. Further, many construction jobs were being done by undocumented workers, particularly in the Southwest, where deportations are impacting the ability for homebuilders to find enough labor to build homes.\n“Many of the big things that would address supply right now are going in the wrong direction,” said Mike Konczal, senior director of policy and research at the Economic Security Project.”\nPulte said on X that the introduction of a 50-year mortgage was just a “potential weapon,” among other solutions the White House has considered to combat high housing prices.\nAmericans don’t live long enough\nThe average age of a first-time homebuyer has been creeping up for years and is now roughly 40 years of age. A 50-year mortgage would be difficult to underwrite for a bank for a 40-year-old first-time homebuyer, who would be 90 years old by the time that home is paid off. The average life expectancy of an American is now roughly 79 years, meaning there’s 11 years of life expectancy not covered in a 50-year loan.\n“It’s typically not a goal of policymakers to pass on mortgage debt to a borrowers’ children,” Konczal said.\nOthers have tried longer loans\nOther parts of the financial system have extended loan terms, to mixed results. The seven-year auto loan has become increasingly common as car prices have risen and Americans keep their cars longer. Despite longer loan terms, auto loan delinquencies have been rising, and the average price of a new car is now $49,740 compared to a price of $38,948 for a new vehicle five years ago.\nStudent loans were originally designed to be paid off in 10 years, and now there are multiple payment options that extend repayment out to 20 years.\nEconomists pointed out that a 50-year mortgage may do the opposite of helping with home affordability by causing home price inflation by introducing more potential buyers into a market struggling with supply.\nTrump downplays idea\nAfter significant criticism, President Trump seemed less enthused about the 50-year mortgage. When asked by Laura Ingraham of Fox News about the idea, President Trump said it “might help a little bit” but seemed to brush it off.\nUnder the Dodd-Frank Act, the mortgage giants Fannie Mae and Freddie Mac cannot insure a mortgage that is longer than 30 years, so any 50-year mortgage would be considered a “non-qualifying mortgage” and would be more difficult to sell to investors. Congress would have to amend U.S. financial laws in multiple places to allow for 50-year mortgages, and there seems to be little appetite for Congress to take this on immediately.\nTags:\nPresident Trump, Fannie Mae, housing affordability, mortgage rates, White House, U.S. housing crisis, Freddie Mac, real estate market, home loans, 50-year mortgage\nRelated Articles\nU.S. mortgage rates dip to 6.27%, nearing low for 2025\nU.S. home sales fall as mortgage rates, prices hit highs\nJanuary home sales fall 4.9% amid rising rates, prices\nHome sales down 5% throughout metro, state\nFannie Mae housing data leak sparks scrutiny of Trump housing chief\nShare this!\nRelated ContentJO Companies eyes new affordable housing in Brooklyn ParkJO Companies is planning up to 160 affordable units on Brooklyn Boulevard in Brooklyn Park, seeking public fun[...]November 24, 2025Wisconsin bill could make way for sprinklers in older housingA new Wisconsin bill would let local governments mandate sprinklers and fire-prevention upgrades in older hous[...]November 24, 2025Alaska Native villages weight costly relocation optionsStorms, erosion and thawing permafrost are putting Alaska Native villages at risk as communities weigh costly [...]November 24, 2025Supply chain delays, rising prices threaten electricity gridTransformer, circuit breaker, and cable shortages threaten U.S. grid reliability as demand surges from AI, ele[...]November 24, 2025Endeavor plans redevelopment at former Totino’s siteEndeavor Development plans to replace a Fridley bakery with a 250,000-square-foot speculative warehouse, pendi[...]November 21, 2025Q&A: Kim Hofstede steps in as president of Founders PropertiesNew Founders Properties president Kim Hofstede discusses her career path, industrial real estate strategy, mar[...]November 21, 2025\nFinance & Commerce Daily Newsletter\nSign up for your daily digest of Minnesota News.\nBy signing up you agree to our\nPrivacy Policy\nUpcoming business events\nSee the full list of events here\nEditor’s Picks\nJO Companies eyes new affordable housing in Brooklyn Park\n11/24/2025\nEndeavor plans redevelopment at former Totino’s site\n11/21/2025\nQ&A: Kim Hofstede steps in as president of Founders Properties\n11/21/2025\nMakado buys two Richfield apartment properties\n11/20/2025\nMinnesota groups fight HUD cuts to supportive housing\n11/20/2025\nNews\nEden Prairie flex industrial building sells for $14 million\nA 93K-square-foot flex industrial building in Eden Prairie’s Golden Triangle has sold for $14M as [...]\nJO Companies eyes new affordable housing in Brooklyn Park\nJO Companies is planning up to 160 affordable units on Brooklyn Boulevard in Brooklyn Park, seeking [...]\nWisconsin bill could make way for sprinklers in older housing\nA new Wisconsin bill would let local governments mandate sprinklers and fire-prevention upgrades in [...]\nAlaska Native villages weight costly relocation options\nStorms, erosion and thawing permafrost are putting Alaska Native villages at risk as communities wei[...]\nIPO market stalls as shutdown and investor caution rise\nA government shutdown, SEC backlog and investor caution have slowed IPOs, sending recent debuts lowe[...]\nSupply chain delays, rising prices threaten electricity grid\nTransformer, circuit breaker, and cable shortages threaten U.S. grid reliability as demand surges fr[...]\nBattery limits, safety issues pose challenges to flying taxis\nChina’s low-altitude economy is booming as drones and eVTOL flying taxis expand, though battery li[...]\nUN climate deal boosts funding but skips fossil fuel cuts\nCOP30 ends with a funding boost for climate adaptation but no pledge to phase out fossil fuels, prom[...]\nEndeavor plans redevelopment at former Totino’s site\nEndeavor Development plans to replace a Fridley bakery with a 250,000-square-foot speculative wareho[...]\nJust Sold: North Lakes uses apartment sale for new project\nNorth Lakes Property Management sells four Minnesota apartments to three buyers to help finance a ne[...]\nSpecial Publications\nFinance & Commerce’s Top Women in Finance 2025 profiles\n11/14/2025\nRising Young Professionals honorees announced\n10/14/2025\nFinance & Commerce announces Minnesota Icon honorees\n10/14/2025\nIn the Lead: Women-Owned Businesses 2025\n9/30/2025\nBeyond The Skyline Podcast\nBeyond the Skyline is a podcast and video interview about economic development, real estate and construction in Minnesota.\nListen here\nNews\nEvents\nWebinars\nPodcast\nPublic Notices\nAbout\nFAQ\nSubscribe\nSubmit a public notice\nPress Releases\nProfessional Announcements\nBTM Business Connect\nBehind the Deal\nContributor Content\nAdvertising\nABOUT\nFinance & Commerce provides news, analysis and commentary on Minnesota business. We are the only independent daily newspaper dedicated to business reporting.\nMY ACCOUNT\nLogin\nLogout\nSubscriber\nManage Account\nGroup Subscription\nSubscriber Agreement\nContact\nAbout Finance & Commerce\nContact Finance & Commerce\nAccessibility Statement\nAdvertising\nAdvertising\nSolutions\nEditorial Calendar\nMarketing Guide\nNewsletter\nMedia Kit\nCONNECT\nNEWSLETTER\nGet our free e-alerts & breaking news notifications!\nDIGITAL EDITIONS\nSubscribe for access to the latest digital and special editions.\n© 2025 BridgeTower Media. All rights reserved.\nUse of this website is subject to its Terms of Use | Privacy Policy | Your California Privacy Rights/Privacy Policy | Do Not Sell My Info/Cookie Policy\nWe use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept”, you consent to the use of ALL the cookies. Do not sell my personal information.Cookie settingsACCEPTPrivacy & Cookies Policy\nClose\nPrivacy Overview\nThis website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience.\nNecessary\nNecessary\nAlways Enabled\nNecessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information.\nNon-necessary\nNon-necessary\nAny cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website.\nSAVE & ACCEPT", "extraction_method": "beautifulsoup", "word_count": 2413, "success": true}