{"full_text": "SKIP NAVIGATION\nMARKETS\nBUSINESS\nINVESTING\nTECH\nPOLITICS\nVIDEO\nINVESTING CLUB\nPRO\nLIVESTREAM\nSearch quotes, news & videos\nWATCHLIST\nSIGN IN\nCREATE FREE ACCOUNT\n\nSMALL BUSINESS PLAYBOOK EVENTS\nSMALL BUSINESS PLAYBOOK EVENT 2025\nSMALL BUSINESS PLAYBOOK\n10 tons, built in seven days, and maybe a way to restore American Dream of affordable home ownership\nPUBLISHED SAT, SEP 27 20259:23 AM EDTUPDATED MON, SEP 29 20259:59 AM EDT\nBob Woods\nKEY POINTS\nWith the median price of a single-family home at more than $422,000, relatively high 30-year fixed mortgage rates, and a nationwide shortage of housing, ownership is out of reach for many individuals and families.\nModular homebuilder Fading West, which has grown to a workforce of roughly 160 and revenue of $50 million, is planning to be part of the solution, constructing 10-ton homes in seven days or less at a factory site in Buena Vista, Colorado. \nAmong its early achievements: homes shipped to Hawaii after 2023 wildfires marking the first instance of FEMA offering displaced residents the modular option rather than trailers as temporary housing.\nFading West modular housing development built after the Hawaii wildfires.\nFading West\n\nOwning a home is one of the pillars of the American Dream. But with a nationwide housing affordability crisis headlined by a lofty median price of a single-family home at more than $422,000, the 30-year fixed mortgage rate coming down but still relatively high, and a persistent, nationwide housing shortage of nearly four million units, that dream is out of reach for many individuals and families. \n\nModular homebuilder Fading West is planning to be part of the solution to this wide-ranging dilemma. Founded in 2016 in Buena Vista, Colorado, the company assembles modular homes inside a 110,000-square-foot factory. Compared to traditional on-site stick-built construction, Fading West claims its lean manufacturing principles reduce costs by up to 20% and delivers a finished house in half the time.  \n\n\"Our innovation is that we are manufacturers, not construction workers,\" said Eric Schaefer, chief business development officer at Fading West, which, besides single- and multi-family homes, also fabricates townhouses and apartment complexes. \"Modular has been around a long time,\" he said.\n\nThe industry has a history dating back a full century and has been growing again in recent years, though off a low base relative to national residential real estate statistics.\n\n\"Where we see ourselves as disruptors is our value engineering, speed, high-quality and architecturally interesting designs,\" Schaefer said. \n\nA case in point, if an atypical one, is Lahaina, Maui, the historic Hawaiian city that was devastated by wildfires in August 2023. Along with taking 102 lives, the conflagration destroyed nearly 2,000 homes. In coordination with the Federal Emergency Management Agency, state and local officials and New York City architecture firm DXA Studio, Fading West produced 82 brightly colored modular homes in two months, running two 12-hour shifts a day. The homes were trucked to Seattle, then shipped to Lahaina. Production took less than five months from the start of construction to completion.  \n\nThe one-, two- and three-bedroom houses, designed by DXA's Liv-Connected spinoff, ranged in cost from $165,000 to $227,000 each, according to FEMA, which paid for them. The Kilohana project — ultimately planned to comprise 167 modular units — marked the first instance of FEMA offering displaced residents modular homes instead of trailers as temporary housing, according to an agency spokeswoman.  \n\nFrom disaster relief response to national affordable housing crisis\n\nUtilizing its modular housing for disaster relief victims was a first for Fading West, too. \"We came into business with very small aspirations,\" Schaefer said. The company started out as developers, creating housing attainable for workers in the small mountain and rural towns near Buena Vista, including Colorado ski resorts such as Breckenridge, Copper Mountain and Vail, where real estate prices are as sky-high as the peaks. \"We realized that with the area's shortage of general contractors and subcontractors, building affordable new homes would be impossible,\" Schaefer said, adding that long, snowy winters were another hindrance to outdoor construction.  \n\nWATCH NOW\nVIDEO03:35\nLee: The housing market is short about 5 million homes\n\nInitially, Fading West marketed community-themed clusters of modular houses built by other companies. But after several years, founder and CEO Charlie Chupp decided to rethink its business model in order to meet growing demands for affordable housing, not only locally but across the country. So in 2021, with funding from four private investors and state loans, it built a state-of-the-art factory.  \n\nThe size of two-and-a-half football fields, the U-shaped facility features 18 work stations, each with a different building task. The modular process begins with floors, walls and roofs, then electrical and plumbing, followed by insulation and drywall, and finally cabinets and countertops. \n\n\"The homes are built on air casters, so they can move up a couple inches off the ground. Workers push the units from station to station every four hours,\" Schaefer said.\n\nIt typically takes about seven days to complete each 10-ton house. \n\nFading West currently employs 110 non-union factory workers, making from the low to high $20s an hour, plus 50 administrative staffers and general contractors, who are on-site to set the houses on foundations and connect utilities. \"Other modular companies aren't our competition,\" Schaefer said. \"It's the traditional homebuilders. We're still a $50-million business, but in the building world that's considered a small company.\" \n\nOnly about 3%-5% of new single-family homes in Colorado are factory-built, including modular, Schaefer said. But interest in the approach is spreading, with New York State Governor Kathy Hochul announcing a plan this week that features modular homes as a key to increasing affordable housing supply statewide.\n\nNationally, gaining market share remains an uphill battle. Modular construction of single-family homes in a typical year makes up between 1-3% of all starts, based on last year's Census Bureau data. \"That number has been pretty constant for the past decade or so,\" said Devin Perry, assistant vice president at NAHB, who focuses on systems builders, including modular. It was as high as 7-8% in 2007-08 timeframe. The decline, \"mirrors the rest of the post-bubble housing industry,\" Perry said. \"The modular manufacturing base consolidated and shrank, so now there are fewer factories to supply modular homes.\" \n\nA view of homes located at The Farm, Fading West’s first development project, located near its factory in Buena Vista, Colorado.\nFading West\n\nIt's worth delineating the somewhat confusing classifications of what structures constitute off-site built housing. There are two distinct categories: manufactured and modular. Manufactured homes — AKA mobile homes or trailers — are built to a single national code, administered by the U.S. Department of Housing and Urban Development. \n\nModular homes are built to the same codes used by traditional on-site homebuilders, which include the International Building Code and state and local codes, according to Tom Hardiman, executive director of the Modular Building Institute and its sister organization, the Modular Home Builders Association. MBI represents makers of multi-family homes and commercial buildings — including hospitals, schools, office buildings and hotels — while MHBA covers those building single-family dwellings. \n\nWhereas modular, in all its designations, embodies a fraction of overall homebuilding in the U.S., it does address many of the nation's problems affecting housing when compared to on-site building. They're more affordable and built more quickly by skilled workers in safe, controlled, indoor environments. They reduce waste by nearly 25% and weather-related damage to materials. \"All of that leads to a more sustainable, less expensive, better-built product,\" said Jordan Rogove, partner and co-founder of DXA Studio. \n\nMichael Neal, a principal research associate and equity scholar at the Urban Institute who has studied the sector, agrees with this view, saying modular housing can achieve an affordable product through its production model. \"Site-built, stick-built building, particularly on the single-family side, hasn't experienced much productivity gains in the aggregate over the last few decades,\" Neal said, adding his research shows modular builders cut production time in half vs. traditional methods, which includes the often onerous permitting process. \n\nThe approach can also solve for the lack of reliable labor that traditional homebuilders experience, with modular factories addressing that challenge by having a full-time, local, well-paid workforce that's not restricted by outdoor weather conditions. \"Maybe modular is how affordable housing is reached,\" Neal said.\n\nFading West \"is still kind of a startup four years into this,\" Schaefer said of its affordable-housing mission. \"Where this make sense is in the wider arena — housing for teachers, police officers, firefighters, a pretty broad range\" of aspiring homeowners, he added.\n\nWith that aim, it has launched projects in Wyoming, Utah, Montana, Texas and New Mexico. Yet Fading West is not averse to building up the income scale as well and linking that to the disaster relief mission it pioneered in Hawaii.\n\nThe company is partnering with Home/Town Developments — a group of design, building, development and real-estate leaders in Los Angeles — to provide a variety of permanent modular homes for victims of the wildfires in Pacific Palisades and Altadena, communities where the demographics vary from ultra-wealthy to middle-class. Fading West has designs for multi-million-dollar, 3,000-square-foot, five-bedroom homes, as well as more affordable 1,200-square, two-bedroom models.\n\nThe modular business model is, at its foundation, about being able to build a house to suit homeowners' desires and budgets. \"Think of these as Lego blocks,\" Schaefer said.\n\nWATCH NOW\nVIDEO07:15\nHousing affordability is the most stretched since the early 1980s, says Ivy Zelman\nMORE IN SMALL BUSINESS PLAYBOOK\nMany boomer business owners are getting ready to sell. They may be setting themselves up for failure\nCheryl Winokur Munk\nTrump's 'No tax on tips' could be end of large-group service fees on restaurant bills\nCheryl Winokur Munk\nWhat Zohran Mamdani's big win means for Main Street small business owners\nKevin Williams\nREAD MORE\nSubscribe to CNBC PRO\nSubscribe to Investing Club\nLicensing & Reprints\nCNBC Councils\nSupply Chain Values\nCNBC on Peacock\nJoin the CNBC Panel\nDigital Products\nNews Releases\nClosed Captioning\nCorrections\nAbout CNBC\nInternships\nSite Map\nAd Choices\nCareers\nHelp\nContact\nNews Tips\n\nGot a confidential news tip? We want to hear from you.\n\nGET IN TOUCH\nCNBC Newsletters\n\nSign up for free newsletters and get more CNBC delivered to your inbox\n\nSIGN UP NOW\n\nGet this delivered to your inbox, and more info about our products and services.\n\nAdvertise With Us\nPLEASE CONTACT US\nPrivacy Policy\nYour Privacy Choices\nCA Notice\nTerms of Service\n\n© 2025 CNBC LLC. All Rights Reserved. \nA Division of NBCUniversal\n\nData is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis.\n\nMarket Data Terms of Use and Disclaimers\n\nData also provided by", "extraction_method": "jina", "word_count": 1771, "success": true}