{"full_text": "Real Estate Published\nNovember 20, 2025 11:49am EST\nHousing affordability crisis hammering rural America Pandemic-era price surge leaves rural homebuyers needing double the income from 2019\nFacebook Twitter Comments Print Email Add Fox Business on Google\nBy\nDaniella Genovese\nFOXBusiness\nclose\nvideo Trump admin suggests 'portable mortgages' to fix housing crisis 'The Big Money Show' panel discusses Federal housing official Bill Pulte floating the idea of 'portable mortgages' to incentivize selling homes and revitalizing the declining housing market. The housing affordability crisis is sparing no one. But rural America is feeling particular strain. In rural America, prices continue to rise and incomes haven't kept up, according to a new report from Redfin. The convergence of both factors is causing housing affordability to \"erode faster than big cities and suburbs.\" Homeowners need an annual income of $74,508 to afford a median-priced home in rural U.S. counties, up a staggering 105.8% from before the COVID-19 pandemic. Prior to the pandemic, rural buyers only needed to earn $36,206, according to Redfin's analysis, which compares the third quarter of 2025 with the third quarter of 2019.   MORE THAN HALF OF US HOMES LOST VALUE OVER THE LAST YEAR The income needed to afford a median-priced home in suburban counties rose 90.9% to $102,120 during that same period. Previously, potential buyers only needed an annual salary of $53,482. The income needed to afford a home in urban counties climbed 87.5% to $118,300. Buyers needed an annual salary of $63,103 prior to the pandemic.\nA farm for sale in Rochester, Minnesota.  (Education Images/Universal Images Group via Getty Images)A home is considered affordable if a buyer takes out a mortgage and spends no more than 30% of their income on their monthly housing payment, according to Redfin.  WHY ARE MORTGAGE RATES INCREASING DESPITE A RATE CUT FROM THE FED? Home prices in rural areas have jumped considerably with the median sale price rising 60.5% from before the pandemic. Home sale prices are hovering around $280,900, which is a far cry from the $175,000 in 2019, according to the report. Meanwhile, the median household income in rural counties is sitting around $69,307, which is only up 33.3% from before the pandemic.\nA For-Sale sign is seen on the front lawn of a newly built house in Williston, North Dakota.  (Andrew Burton / Getty Images)Sale prices in suburban counties jumped 48.9% to $385,000 while urban counties experienced a 46.2% gain with prices sitting at $446,000. Suburban counties have seen a 36.8% gain in income and urban counties have seen a 39.3% gain. EX-NYC MAYOR DE BLASIO DEFENDS MAMDANI'S RENT FREEZE PROPOSAL WHILE OTHERS WARN OF MARKET DAMAGEMillions of people relocated out of major cities during the pandemic in search of more space. Remote work and record-low mortgage rates helped drive that trend.\nA home is considered affordable if a buyer takes out a mortgage and spends no more than 30% of their income on their monthly housing payment, according to Redfin. (Mario Tama/Getty Images)But the pandemic-related homebuying frenzy that swept through rural and suburban areas sent home prices soaring and left \"communities grappling with an affordability crisis that persists today,\" according to Redfin. GET FOX BUSINESS ON THE GO BY CLICKING HERETypically, rural areas only have a handful of homes for sale, Redfin said, meaning homebuyers frequently compete with one another. But during the pandemic, areas gained a lot of out-of-state prospective homebuyers. For instance, New Hampshire saw a growing interest from buyers in New York, Texas, California and Seattle, often with larger budgets. This allowed sellers to drive up the asking price, win bidding wars and purchase properties in the Lakes Region, according to New Hampshire-based Redfin Premier real estate agent Julia Martinage.\"A lot of those people are now moving back to where they came from and being replaced by locals or people from border states like Massachusetts,\" Martinage said.\nU.S. Stock Market Quotes\nAdvertisement\nAdvertisement\nAdvertisement\nArrives Weekly\nGet Our Newsletter\nGet a brief on the top business stories of the week, plus CEO interviews, market updates, tech and money news that matters to you.\nWe've added you to our mailing list.\nSubscribe\nBy clicking subscribe, you agree to the Fox News Privacy Policy and Terms of Use, and agree to receive content and promotional communications from Fox News. You understand that you can opt-out at any time.", "extraction_method": "beautifulsoup", "word_count": 721, "success": true}