{"full_text": "The number of contract signings stayed flat month over month, as the National Association of Realtors’ (NAR) Pending Home Sales Index stalled at a reading of 74.8 in September.\nAn index reading of 100 is equal to the level of contract activity in 2001.\n“Contract signings matched the second-strongest pace of the year. However, signings have yet to fully reach the level needed for a healthy market despite mortgage rates reaching a one-year low,” Lawrence Yun, NAR’s chief economist, said in a statement. “A record-high stock market and growing housing wealth in September were not enough to offset a likely softening job market.”\nIn addition to remaining flat month over month, pending home sales were down 0.9% annually in September.\nDespite these results, roughly 20% of NAR members surveyed expect to see an uptick in buyer traffic or seller traffic in the next three months, according to the Realtors’ Confidence Index.\nAlthough some Realtors might be expecting a more active housing market in the current months, economists warn that affordability remains a challenge for many consumers.\n“Lower rates have been bringing some buyers into the market, but according to data from the Mortgage Bankers Association, the recent drop in rates has primarily increased refinance activity rather than purchase activity,” Lisa Sturtevant, chief economist for Bright MLS, said in a statement.\n“Affordability is still a constraint even as rates have fallen to their lowest level in a year. And consumers are generally feeling more cautious amidst growing economic uncertainty.”\nSam Williamson, First American’s senior economist, added that he expects much of the year’s sales activity will be driven by “life happens” moments, especially as affordability challenges and structural inventory shortages continue to weigh on demand.\n“Lower rates help, but they’re not a cure-all,” Williamson said in a statement.\nRegionally, pending home sales rose month over month in the Northeast (65.7) and South (90.0), which recorded 3.1% and 1.1% increases, respectively.\nIn contrast, pending home sales fell on a monthly basis in the Midwest (down 3.4% to a reading of 73.8) and the West (down 0.2% to 59.2). Annually, pending home sales rose in the Northeast (0.5%) and South (0.9%) but fell in the Midwest (-1.5%) and West (-5.3%).\n“The South led the way, posting both month-over-month and year-over-year gains. Its relative affordability — especially when paired with lower mortgage rates — continues to support buyer activity by making the payment-to-paycheck equation more manageable,” Williamson said.\n“The Northeast saw a modest rebound from August, but remains essentially flat compared to last year, while the Midwest gave back some of its August strength, with declines on both a monthly and annual basis. Meanwhile, the West continues to lag, remaining the softest region for signings.”\nRelated\nMore:\nLawrence Yun\nMortgage Rates\nNational Association of Realtors\nPending Home Sales", "extraction_method": "beautifulsoup", "word_count": 464, "success": true}