{"full_text": "Fact Check Team: Will Trump's 50-year mortgage idea solve or worsen housing affordability?NewsNewsFranklin County officials looking for missing 14-year-old The office of the sheriff in Franklin County said there is a missing juvenile.Man arrested after shooting and injuring 1 in Amherst County: Sheriff AyersSheriff Ayers held a press conference on Monday to release details regarding a malicious wounding in Amherst County.Average gasoline prices in Virginia remain unchanged in the last week: GasbuddyAverage gasoline prices in Virginia have remained unchanged in the last week, averaging $2.91/g today, according to GasBuddy's survey. Thanksgiving cooking safety tips: how to prevent kitchen fires this holiday seasonThanksgiving is right around the corner, which means many of you will be busy in the kitchen this week.LocalABC13 InvestigatesCrisis in the ClassroomNation & WorldConnect To CongressNews LinksOffbeatVideosLivestreamAmazing AmericaElection ResultsInside Your WorldBack to SchoolBeyond The PodiumSpotlight on AmericaFull Measure with Sharyl AttkissonAddicted AmericaHeroes in the Heart of VirginiaQuestion of the DayElectionWeatherCurrent WeatherLynchburgMostly Sunny61F62/39Today62/39Tuesday59/53Wednesday70/36Latest WeathercastLatest WeathercastRadarMapsSkyCamClosingsClosings AdminHurricane CenterWeather ExtraSportsSportsMatchups are now set for VHSL regional finalsThe list of local teams still in the hunt to reach Championship Saturday is getting smaller and smaller.This week, ABC13 Football Friday will be covering VHSL RTwo Rockbridge County student athletes sign to collegeWednesday, two Rockbridge County students took the next steps in their athletic journey.Lola Mulitalo signed with Kennesaw State for girls lacrosseMeanwhile, KLynchburg Nipped By Dickinson In NCAA Third RoundIn a back-and-forth battle of attrition that involved two elite teams, the University of Lynchburg men's soccer team was bested by Dickinson, 1-0, in the round Flames Drop Overtime Game at LA Tech, Fall to 4-7 on the yearFor the second week in a row, Liberty went to overtime on the road and dropped their second-straight extra-period contest, falling to LA Tech, 34-28, at Joe AilFootball FridayOther SportsCollege SportsHigh School SportsFull Court PressMinor League BaseballTICKETSCity GuideLiving in the Heart of VirginiaLiving in the Heart of VirginiaShop, Save, Celebrate: Mistletoe DaysThe holiday shopping season is officially here, and Mistletoe Days at Spearman Artisanry is serving up something for everyone. From unique gifts from around theBorn & Raised Under Jim Crow: One Author’s JourneyBorn & Raised Under Jim Crow: One Author’s JourneyTis' The Season: It Is Time for the Bright Nights Block Party!The Bright Nights Block Party is back and DLA has some new things for you to see! From a tree lighting, photos with Santa and a number of performances, you are Santa Claus is Coming to Town with the Lynchburg Symphony Orchestra!Santa is coming to town a little early and it's all to have a great time with you and the Lynchburg Symphony Orchestra! The Happy Holidays concert have two perfStaying Aware - Black HistoryEntertainmentFor Pet's SakePartner SpotlightSinclair CaresGame CenterGame CenterDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchWatchLiveNow61°Tue60°Wed66°SearchSearchUser IconWatchSearchNewsDown ArrowLocalABC13 InvestigatesCrisis in the ClassroomNation & WorldConnect To CongressNews LinksOffbeatVideosLivestreamAmazing AmericaElection ResultsInside Your WorldBack to SchoolBeyond The PodiumSpotlight on AmericaFull Measure with Sharyl AttkissonAddicted AmericaHeroes in the Heart of VirginiaQuestion of the DayElectionWeatherDown ArrowWeather HomeRadarMapsSkyCamClosingsClosings AdminHurricane CenterWeather ExtraSportsDown ArrowSports HomeFootball FridayOther SportsCollege SportsHigh School SportsFull Court PressMinor League BaseballTICKETSCity GuideLiving in the Heart of VirginiaDown ArrowLiving in the Heart of Virginia HomeStaying Aware - Black HistoryEntertainmentFor Pet's SakePartner SpotlightSinclair CaresGame CenterDown ArrowGame Center HomeDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchMoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsNewsletter Sign UpChime InStationDown ArrowStation HomeContactPeopleCareersEEOTermsCopyrightPrivacyScheduleWeather App & AlertsNews App & AlertsSend news tips to ABC 13 -WSETNewsletter Sign UpWho's HiringContestsSt. Jude Dream HomeCommunity Counts70th AnniversarySinclair CaresClassroom HeroesPeople & PlacesLegalDown ArrowTerms & ConditionsCopyright NoticesEEO Public File ReportFCC InfoFCC ApplicationsPublic File AssistanceContactNews TeamCareersConteststwitter iconfacebook iconACCESSIBILITYPlease ensure Javascript is enabled for purposes of website accessibilityFact Check Team: Will Trump's 50-year mortgage idea solve or worsen housing affordability?by EMMA WITHROW | Fact Check TeamTue, November 18, 2025 at 7:37 PMUpdated Tue, November 18, 2025 at 10:59 PM4VIEW ALL PHOTOSWASHINGTON, DC - NOVEMBER 17: U.S. President Donald Trump delivers remarks during a meeting of the White House Task Force on the FIFA World Cup 2026 in the Oval Office of the White House on November 17, 2025 in Washington, DC. The task force was created to oversee security, logistics, and federal government support for the 2025 Club World Cup and the 2026 FIFA World Cup, jointly hosted by the United States. (Photo by Win McNamee/Getty Images)Comment on this story5CommentShare storySharetopics: MortgageHousing affordabilityUnderwater mortgagesHomebuildersInterest ratesDonald Trump50-year mortgageNegative equity WASHINGTON (TNND) — The Federal Reserve signaled this week that aspiring home buyers expecting more interest-rate relief may have to keep waiting. And that delay is exposing a deeper problem in the housing market: hundreds of thousands of Americans who bought newly built homes over the last few years are already underwater on their mortgages.It’s a trend analysts say didn’t happen by accident, and the lending practices behind it mirror warning signs from the early 2000s. (TNND)It’s a trend analysts say didn’t happen by accident, and the lending practices behind it mirror warning signs from the early 2000s.How Builders Helped Create a Wave of Underwater MortgagesBeing “underwater” on a mortgage simply means you owe more than your home is currently worth. As Bankrate’s chief financial analyst Greg McBride explains, “you owe more than the current value the asset is worth less than the amount you borrowed”.But according to a new analysis first reported by The Wall Street Journal, many homeowners who purchased newly built houses in 2022–2024 landed in that position almost immediately. That’s because large homebuilders have been offering artificially low mortgage rates, often far below market levels — in exchange for higher home prices.Here’s what WSJ found, based on data from analyst John Comiskey:27% of Lennar’s FHA loans from 2022–2024 are now underwater.18% of D.R. Horton’s FHA loans are underwater.10% of Quicken Loans’ FHA loans (a non-builder lender) are underwater.The playbook works like this: builders advertise mortgage rates around 3.99%, even while the broader market hovered closer to 6.3%. But to make the numbers work, they keep sale prices above what the property might otherwise be worth. Buyers get a lower monthly payment, but at the cost of taking out a loan that’s already near, or above, the home’s actual value.When prices stopped rising, many borrowers slid into negative equity almost immediately.What Happens When You’re Underwater?For homeowners, the consequences are severe, and in some cases, financially immobilizing.You can’t easily sell your home. Selling requires bringing cash to the closing table to cover the gap between the loan balance and the sale price. That can mean writing a check for tens of thousands of dollars.You can’t refinance. Lenders require equity to approve a refi. Without it, homeowners are effectively locked into their existing rates.The risk of default rises. When people owe far more than their home is worth, they’re more likely to walk away, a dynamic that played a major role in the 2008 housing crash, according to Bankrate.It becomes a systemic risk. Large pockets of underwater loans strain lenders, federal backstops, and local housing markets.In short, underwater mortgages trap households and can reverberate far beyond a single borrower.Is a 50-Year Mortgage a Solution, or Another Risk?Into this climate stepped former President Donald Trump, who floated a new idea on Truth Social: 50-year mortgages.Supporters call it an affordability boost. Critics are calling it a “lifetime mortgage.”The Upside: Lower PaymentsLower payments could help more people qualify, especially first-time buyers who fail debt-to-income checks. (TNND)A 50-year mortgage would spread repayment over two extra decades, meaning lower monthly payments.A New York Times analysis found that on a $500,000 home, a borrower could save about $250–$300 a month, around $4,000 a year, with a 50-year loan versus a standard 30-year mortgage.Lower payments could help more people qualify, especially first-time buyers who fail debt-to-income checks.The Downsides: Higher Costs and Bigger RisksThere would be enormous lifetime interest. Using the same NYT example: 30-year mortgage interest: ~$500,00050-year mortgage interest: nearly $900,000You’d pay almost twice the price of the home in interest alone.The National Association of Realtors says the median age of a first-time buyer used to be 36 but is now 40. Add 50 years and they’d be 86 by the time the loan matures.The Bottom LineBuilder-backed mortgages helped more Americans buy homes in a tough market, but often at the cost of pushing them into inflated prices and negative equity. Now, with underwater mortgages spreading across multiple major homebuilders, policymakers are starting to ask whether the industry’s lending incentives need a closer look.Comment with BubblesJOIN THE CONVERSATION (5)Meanwhile, Trump’s 50-year mortgage proposal aims to boost affordability but could introduce new long-term risks: massive interest payments, slower equity, and more households vulnerable to downturns.TrendingVirginia high school football coach Travis Turner goes missing amid undefeated seasonA high school football coach has gone missing in the middle of an undefeated season in Virginia.Man arrested after shooting and injuring 1 in Amherst County: Sheriff AyersSheriff Ayers held a press conference on Monday to release details regarding a malicious wounding in Amherst County.Gynecologist who worked at multiple hospitals accused of recording, touching 50 patientsA gynecologist who worked at multiple hospitals was accused by over 50 patients of secretly recording and inappropriately touching them.2 injuries reported after accident, Altavista fire crews sayAltavista fire crews said two injuries were reported after an accident on Sunday.Vicious fight aboard Metrobus in Fairfax County leaves man in critical conditionA Metrobus ride turned violent Saturday after an argument escalated into a brutal beating, leaving a man hospitalized in critical but stable condition. NEWS IN PHOTOS:\"Local\"3Man arrested after shooting and injuring 1 in Amherst County: Sheriff Ayers7Thanksgiving cooking safety tips: how to prevent kitchen fires this holiday season32 injuries reported after accident, Altavista fire crews say4Families gather in Downtown Lynchburg for Bright Nights and festive holiday cheerACCESSIBILITYDownload Our Mobile Apps:Terms & ConditionsCopyright NoticesEEO Public File ReportFCC InfoFCC ApplicationsPublic File AssistanceContactNews TeamCareersContestsNewsWeatherSportsGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1616, "success": true}