{"full_text": "Fact Check Team: Will Trump's 50-year mortgage idea solve or worsen housing affordability?NewsNews'It's part of our mission': Columbia police serve Thanksgiving meals to those in needWith Thanksgiving approaching and many families struggling, Columbia police and local organizations are stepping up to ensure no one goes without a holiday mealSpace 803 hosts turkey drive to support families in need this ThanksgivingSpace 803 on Decker Blvd. is hosting its third annual turkey drive, providing over 250 free turkeys to families in need this Thanksgiving.The event, which begaPay it forward: Pharmacist making a difference beyond the clinicThis week’s Pay It Forward honoree is Dr. Phyllis Perkins, a respected pharmacist at Moncrief Army Health Clinic.GoFundMe started for teen killed at SC State HomecomingThe mother of 19-year-old Jaliyah Tayanna Butler, who was killed during homecoming festivities at South Carolina State University, is asking for community suppoLocalWACHFOX InvestigatesNation & WorldConnect To CongressEntertainmentElectionLocal RacesArmstrong Army StrongInside Your WorldAmazing AmericaQuestion of the DaySpotlight on AmericaBeyond the PodiumOffbeatHealthy HomeFull Measure with Sharyl AttkissonCrisis in the classroomWeatherCurrent WeatherColumbiaMostly Cloudy56F78/50Today78/50Tuesday78/63Wednesday74/39Latest WeathercastLatest WeathercastRadarMapsClosingsHurricane CenterskyWACH Weather BlogWeather SchoolskyWACH Weather 101South Carolina: Mercury RisingSportsSportsAlshon Jeffery talks South Carolina-Clemson rivalry on 'South Carolina Sideline'On a new episode of our 'South Carolina Sideline' Podcast, Sports Director Matt Dowell is joined by Alshon Jeffery, Gamecock football legend and Super Bowl chamGamecocks Score Staley-Era Record 121 Points vs QueensJoyce Edwards scored 25 points and Ta’Niya Latson 24 to lead No. 2 South Carolina to its most points in coach Dawn Staley’s 18 seasons with a 121-49 romp over QWolves Roll To 45-24 Victory In First Round Of NCAA Division 2 PlayoffsNewberry College (10-1) won their eighth consecutive game and broke Kentucky State's eight-game winning streak with a 45-24 victory in the first round of the NCBenedict Stuns Wingate On Last Second Play, 25-24In one of the wildest finishes in all of college football action on Saturday, the Benedict College Tigers stunned the Wingate Bulldogs on a last-second touchdowSportsZoneHigh SchoolMore SportsHighschool HoopsClemson TigersUSC GamecocksCarolina PanthersFriday Night RivalsTICKETSSoccerCity GuideFeaturesFeaturesThunderstorms may cause travel trouble across the South todayThunderstorms could cause travel issues in Georgia, Alabama, Tennessee, and Mississippi.'It's part of our mission': Columbia police serve Thanksgiving meals to those in needWith Thanksgiving approaching and many families struggling, Columbia police and local organizations are stepping up to ensure no one goes without a holiday mealSpace 803 hosts turkey drive to support families in need this ThanksgivingSpace 803 on Decker Blvd. is hosting its third annual turkey drive, providing over 250 free turkeys to families in need this Thanksgiving.The event, which begaZelle limits at top banksLooking to use Zelle for a transfer? Here are the Zelle limits at various banks.Share Your HolidayLifestyle MattersMoneyWACHMiss South CarolinaOn PointSinclair CaresCarolina ChampionPartner SpotlightBlack History HonorsFor Pet's SakeTuesday TailsThe Opioid CrisisFriday Night RivalsCarolina ShowcaseArts WACHMarket MakersMUSC Medical WACHSC LAW 101Legal MattersPalmetto PatriotsPay It ForwardConnect to the CapitolGame CenterGame CenterDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchWatchLiveNow56°Tue78°Wed75°SearchSearchUser IconWatchSearchNewsDown ArrowLocalWACHFOX InvestigatesNation & WorldConnect To CongressEntertainmentElectionLocal RacesArmstrong Army StrongInside Your WorldAmazing AmericaQuestion of the DaySpotlight on AmericaBeyond the PodiumOffbeatHealthy HomeFull Measure with Sharyl AttkissonCrisis in the classroomWeatherDown ArrowWeather HomeRadarMapsClosingsHurricane CenterskyWACH Weather BlogWeather SchoolskyWACH Weather 101South Carolina: Mercury RisingSportsDown ArrowSports HomeSportsZoneHigh SchoolMore SportsHighschool HoopsClemson TigersUSC GamecocksCarolina PanthersFriday Night RivalsHighlightsGame ReplaysScholar AthletesTICKETSSoccerCity GuideFeaturesDown ArrowFeatures HomeShare Your HolidayLifestyle MattersMoneyWACHMiss South CarolinaOn PointSinclair CaresCarolina ChampionPartner SpotlightBlack History HonorsFor Pet's SakeTuesday TailsThe Opioid CrisisFriday Night RivalsHighlightsGame ReplaysScholar AthletesCarolina ShowcaseArts WACHMarket MakersMUSC Medical WACHSC LAW 101Legal MattersPalmetto PatriotsPay It ForwardConnect to the CapitolGame CenterDown ArrowGame Center HomeDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchMoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsChime InTrafficDown ArrowTraffic HomeMapNewsletter Sign UpOur StationDown ArrowOur Station HomeAdvertise with UsScheduleContactPeopleContestsCareersTermsEEOPrivacyCopyrightNewsletter Sign UpLegalDown ArrowTerms & ConditionsCopyright NoticesEEO Public File ReportFCC InfoFCC ApplicationsPublic File AssistanceContactNews TeamCareersConteststwitter iconfacebook iconACCESSIBILITYArmstrong Williams Town HallArmstrong Williams takes on the news of the week and asks the questions you want answered. Don’t miss our weekly town hall!WATCHClose11Please ensure Javascript is enabled for purposes of website accessibilityFact Check Team: Will Trump's 50-year mortgage idea solve or worsen housing affordability?by EMMA WITHROW | Fact Check TeamTue, November 18, 2025 at 7:37 PMUpdated Tue, November 18, 2025 at 10:59 PM4VIEW ALL PHOTOSWASHINGTON, DC - NOVEMBER 17: U.S. President Donald Trump delivers remarks during a meeting of the White House Task Force on the FIFA World Cup 2026 in the Oval Office of the White House on November 17, 2025 in Washington, DC. The task force was created to oversee security, logistics, and federal government support for the 2025 Club World Cup and the 2026 FIFA World Cup, jointly hosted by the United States. (Photo by Win McNamee/Getty Images)Comment on this story0CommentShare storySharetopics: MortgageHousing affordabilityUnderwater mortgagesHomebuildersInterest ratesDonald Trump50-year mortgageNegative equity WASHINGTON (TNND) — The Federal Reserve signaled this week that aspiring home buyers expecting more interest-rate relief may have to keep waiting. And that delay is exposing a deeper problem in the housing market: hundreds of thousands of Americans who bought newly built homes over the last few years are already underwater on their mortgages.It’s a trend analysts say didn’t happen by accident, and the lending practices behind it mirror warning signs from the early 2000s. (TNND)It’s a trend analysts say didn’t happen by accident, and the lending practices behind it mirror warning signs from the early 2000s.How Builders Helped Create a Wave of Underwater MortgagesBeing “underwater” on a mortgage simply means you owe more than your home is currently worth. As Bankrate’s chief financial analyst Greg McBride explains, “you owe more than the current value the asset is worth less than the amount you borrowed”.But according to a new analysis first reported by The Wall Street Journal, many homeowners who purchased newly built houses in 2022–2024 landed in that position almost immediately. That’s because large homebuilders have been offering artificially low mortgage rates, often far below market levels — in exchange for higher home prices.Here’s what WSJ found, based on data from analyst John Comiskey:27% of Lennar’s FHA loans from 2022–2024 are now underwater.18% of D.R. Horton’s FHA loans are underwater.10% of Quicken Loans’ FHA loans (a non-builder lender) are underwater.The playbook works like this: builders advertise mortgage rates around 3.99%, even while the broader market hovered closer to 6.3%. But to make the numbers work, they keep sale prices above what the property might otherwise be worth. Buyers get a lower monthly payment, but at the cost of taking out a loan that’s already near, or above, the home’s actual value.When prices stopped rising, many borrowers slid into negative equity almost immediately.What Happens When You’re Underwater?For homeowners, the consequences are severe, and in some cases, financially immobilizing.You can’t easily sell your home. Selling requires bringing cash to the closing table to cover the gap between the loan balance and the sale price. That can mean writing a check for tens of thousands of dollars.You can’t refinance. Lenders require equity to approve a refi. Without it, homeowners are effectively locked into their existing rates.The risk of default rises. When people owe far more than their home is worth, they’re more likely to walk away, a dynamic that played a major role in the 2008 housing crash, according to Bankrate.It becomes a systemic risk. Large pockets of underwater loans strain lenders, federal backstops, and local housing markets.In short, underwater mortgages trap households and can reverberate far beyond a single borrower.Is a 50-Year Mortgage a Solution, or Another Risk?Into this climate stepped former President Donald Trump, who floated a new idea on Truth Social: 50-year mortgages.Supporters call it an affordability boost. Critics are calling it a “lifetime mortgage.”The Upside: Lower PaymentsLower payments could help more people qualify, especially first-time buyers who fail debt-to-income checks. (TNND)A 50-year mortgage would spread repayment over two extra decades, meaning lower monthly payments.A New York Times analysis found that on a $500,000 home, a borrower could save about $250–$300 a month, around $4,000 a year, with a 50-year loan versus a standard 30-year mortgage.Lower payments could help more people qualify, especially first-time buyers who fail debt-to-income checks.The Downsides: Higher Costs and Bigger RisksThere would be enormous lifetime interest. Using the same NYT example: 30-year mortgage interest: ~$500,00050-year mortgage interest: nearly $900,000You’d pay almost twice the price of the home in interest alone.The National Association of Realtors says the median age of a first-time buyer used to be 36 but is now 40. Add 50 years and they’d be 86 by the time the loan matures.The Bottom LineBuilder-backed mortgages helped more Americans buy homes in a tough market, but often at the cost of pushing them into inflated prices and negative equity. Now, with underwater mortgages spreading across multiple major homebuilders, policymakers are starting to ask whether the industry’s lending incentives need a closer look.Meanwhile, Trump’s 50-year mortgage proposal aims to boost affordability but could introduce new long-term risks: massive interest payments, slower equity, and more households vulnerable to downturns.TrendingBreak-in at SC food bank, essential goods stolenA South Carolina food bank said thousands of dollars' worth of canned and nonperishable goods were stolen after its storage area was broken into on Sunday.Nationwide emergency management notification system outage affecting South CarolinaCodeRED, a notification system used by emergency management agencies, is experiencing a nationwide outage following a cybersecurity incident earlier this month,GoFundMe started for teen killed at SC State HomecomingThe mother of 19-year-old Jaliyah Tayanna Butler, who was killed during homecoming festivities at South Carolina State University, is asking for community suppoTwo arrested after tri-state crime spree leaves one dead in WinnsboroAuthorities have identified a body found in Fairfield County.Midlands church spreads Thanksgiving cheer with 1,000 dinners for Columbia familiesOne thousand Thanksgiving dinners, including turkeys, were handed out across Columbia on Saturday thanks to a major effort by a Midlands church.After raising neNEWS IN PHOTOS:\"Local\"5'It's part of our mission': Columbia police serve Thanksgiving meals to those in need3Space 803 hosts turkey drive to support families in need this Thanksgiving3Pay it forward: Pharmacist making a difference beyond the clinic7GoFundMe started for teen killed at SC State HomecomingACCESSIBILITYTerms & ConditionsCopyright NoticesEEO Public File ReportFCC InfoFCC ApplicationsPublic File AssistanceContactNews TeamCareersContestsNewsWeatherSportsContestsGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1659, "success": true}