{"full_text": "Skip to Content  \n \n \n \n \n  \n \n\n\nAbout \nMasthead \nJoin \nSubmit \nAdvertise \nDonate  \n \n More \n       \n \n \n  \n  Facebook    \n  Threads    \n  Instagram    \n  X    \n  Spotify    \n  LinkedIn    \n  YouTube    \n  Reddit    \n  Email Signup      \n \n \n \n \n Search this site  \nSubmit Search        \n \n \n \n  \n  \n \nWashington Square News       \n \n \n \n \n  \n \n\n\nNews \n \nFeatures \nCity \nUniversity \nWar in Gaza \nTrump Administration \nBeyond NYU \nAbroad   \nOpinion \n \nEditorial \nGuest Essays \nLetters from the Editor \nLetters to the Editor \nOff-Third \nOff Topic \nStaff Rants \nTrump Administration   \nSports \n \nWeekly Recap \nIn the Huddle \nOut of Bounds   \nCulture \n \nBeauty & Style \nFood \nIdentity & Equity \nRanked \nNew York Fashion Week   \nArts \n \nBooks \nFilm \nMusic \nPerforming Arts \nVisual Arts   \nMagazine \nMultimedia \n \nCartoons \nPhoto Column \nPhoto Essays \nVideos   \nSponsored  \n \n More \n       \n\n\n\n\n\nCity Scoop: Trump awed in meeting with Mamdani, and other top stories across NYC\n\n\n\nNYU Langone awarded ‘A’ in safety for 11th time\n\n\n\nEx-UN diplomat talks human rights careers with Steinhardt class\n\n\n\nLangone researchers find new way to detect nerve-killing head trauma\n\n\n\nCampus crime down in 2024, according to annual report\n\n\n\n\nNYU Langone fired a nurse battling cancer. Her story isn’t the only one.\n\n\n\nInside one of NYU’s prominent antisemitism consultants\n\n\n\nNYU Grossman rescinds program acceptances after losing federal grant\n\n\n\nAt least 2 NYU affiliates involved in organizations that promote anti-trans practices\n\n\n\n‘A chilling effect’: Conduct guidelines cast shadow of concern over faculty\n\n\n\n\nCity Scoop: Trump awed in meeting with Mamdani, and other top stories across NYC\n\n\n\nAdams to make Elizabeth Street Garden a public park\n\n\n\nCity Scoop: JFK’s grandson to run for Congress, and other top stories across NYC\n\n\n\nLawmakers rally to tax the rich in Union Square\n\n\n\nCity Scoop: Flights canceled at major airports, and other top stories across NYC\n\n\n\n\nEx-UN diplomat talks human rights careers with Steinhardt class\n\n\n\nLangone researchers find new way to detect nerve-killing head trauma\n\n\n\nCampus crime down in 2024, according to annual report\n\n\n\nOthmer slow on post-flood reimbursements, students say\n\n\n\nStudents honor trans lives at Washington Square Park vigil\n\n\n\n\nStudents and faculty commence ‘solidarity fast’ in Bobst\n\n\n\nStudents join hundreds in citywide Oct. 7 protest\n\n\n\nThousands protest Gaza flotilla interception under Washington Square Arch\n\n\n\nProtests persist across Tisch, law school graduations\n\n\n\nStudents picket outside Vanderbilt Hall, demand NYU Law cut anti-protest contract\n\n\n\n\nFundraising for visa-related legal fees now a ‘moot’ issue, NYU says\n\n\n\nStudents rally for ‘no compliance’ with Trump administration in Washington Square Park\n\n\n\nNYU has a ‘moral obligation’ to protect noncitizen students, immigration experts say\n\n\n\nProfessors call for sanctuary campus with off-site classes\n\n\n\nStudents hold cross-campus march for divestment, noncitizen support\n\n\n\n\nBeyond NYU: Bringing activism to the kitchen\n\n\n\nBeyond NYU: Turning life’s errors into humor\n\n\n\nBeyond NYU: Leaving Caltech for a career in journalism\n\n\n\nBeyond NYU: When 5 music majors combine forces for a ‘good time’\n\n\n\nBeyond NYU: From research at Courant to taking on tech giants\n\n\n\n\nOff Topic: Trump’s obsession with ICE is endangering America\n\n\n\nOpinion: NYU’s funding recovery isn’t a complete success\n\n\n\nOff Topic: Epstein’s legacy proves the king can bleed\n\n\n\nGuest Essay: To reach civic solutions, students must start with civility\n\n\n\nOpinion: AI use is costing us our literacy\n\n\n\n\nEditorial: The work has just begun\n\n\n\nEditorial: Students deserve clarity from NYU leadership\n\n\n\nEditorial: Who to vote for in the NYC primaries\n\n\n\nEditorial: Linda Mills, where are you?\n\n\n\nEditorial: Why NYU should, but probably won’t, follow Harvard\n\n\n\n\nGuest Essay: To reach civic solutions, students must start with civility\n\n\n\nGuest Essay: When it comes to contract faculty, NYU has no ‘peers’\n\n\n\nGuest Essay: Mamdani’s win strengthens our fight for gender equality\n\n\n\nGuest Essay: NYU must reject Trump’s coercive ‘compact’\n\n\n\nGuest Essay: Unity is the only way out of Trump’s ‘compact’\n\n\n\n\nLetter from the Editor: My goodbye to WSN\n\n\n\nLetter from the Editor: In the age of Trump, student journalism is more vital than ever.\n\n\n\nLetter from the Editor: A reflection on WSN’s mission\n\n\n\nLetter from the Editor: Welcome to the Washington Square News\n\n\n\nLetter from the editor: On reflection\n\n\n\n\nLetter to the Editor: 94 LS faculty members approve statement to WSN\n\n\n\nLetter to the Editor: Silver School dean on the case for a tuition-free social work education\n\n\n\nLetter to the Editor: Wasserman Center director on the Handshake job search platform\n\n\n\nLetter to the Editor: CWS director on suicide response and mental health resources\n\n\n\nLetter to the Editor: NYU remains committed to NYU Tel Aviv\n\n\n\n\nOff-Third: Performative males are giving real feminists (like me) a bad rap\n\n\n\nOff-Third: The Third North basement’s AC problem violates free speech\n\n\n\nOff-Third: WSN endorses Anna Wintour for NYU spokesperson\n\n\n\nOff-Third: Mills to star in Broadway bio-musical, tickets start at $1099\n\n\n\nOff-Third: NYU released their shortlist for consultants on ‘institutional restraint.’ You won’t believe who’s on it.\n\n\n\n\nOff Topic: Trump’s obsession with ICE is endangering America\n\n\n\nOff Topic: Epstein’s legacy proves the king can bleed\n\n\n\nOff Topic: Trump’s ignorance isn’t bliss \n\n\n\nOff Topic: Having a boyfriend isn’t embarrassing, but Vogue’s new direction is\n\n\n\nOff Topic: The teenage gambling epidemic needs an intervention\n\n\n\n\nStaff Rants: Post-election feelings\n\n\n\nStaff Rants: Springing in and out of spring\n\n\n\nStaff Rants: New beginnings or old complaints?\n\n\n\nStaff Rants: Holiday Overload\n\n\n\nStaff Rants: Spooky season\n\n\n\n\nWomen’s cross country wins first national championship, women’s volleyball falls out of NCAA tournament and other news\n\n\n\nOut of Bounds: Major sports news out of France, Spain and the U.K.\n\n\n\nMeet the NYU student who found his direction through soccer\n\n\n\nIn the Huddle: Kyle Sakalosky on balancing academics and athletics as a first-year\n\n\n\nStaff Recs: Sports media\n\n\n\n\nWomen’s cross country wins first national championship, women’s volleyball falls out of NCAA tournament and other news\n\n\n\nMen’s basketball snatches thrilling wins, cross country excels and more\n\n\n\nMen’s and women’s basketball open seasons, wrestling clinches a narrow win and other news\n\n\n\nCross country earns back-to-back UAA titles, volleyball hosts senior night and other news\n\n\n\nWomen’s volleyball wins twice at Tear It Up, men’s and women’s cross country in action and other news\n\n\n\n\nIn the Huddle: Kyle Sakalosky on balancing academics and athletics as a first-year\n\n\n\nIn the Huddle: Josephine Dziedzic on running track & field and cross country at NYU\n\n\n\nIn the Huddle: Sonia Neighbors on joining the NYU women’s soccer team\n\n\n\nIn the Huddle: Volleyball player Emerson Evans on NYU’s historic season\n\n\n\nIn the Huddle: Aurora Aschettino on her fencing career\n\n\n\n\nOut of Bounds: Major sports news out of France, Spain and the U.K.\n\n\n\nOut of Bounds: Major sports news out of Los Angeles, Madrid and Sydney\n\n\n\nOut of Bounds: Major sports news out of Australia, the U.K. and Washington, D.C.\n\n\n\nOut of Bounds: Major sports news out of Los Angeles, Madrid and Paris\n\n\n\nOut of Bounds: Major sports news out of London, Los Angeles and Paris\n\n\n\n\nNew eats near NYU: This nonprofit restaurant subverts fine dining\n\n\n\nNYC fashion wasn’t what I expected\n\n\n\nWith contemporary Iranian poetry, I reimagine my culture\n\n\n\nThe NYU students behind Mamdani’s historic win\n\n\n\nAs demolition looms, Chelsea residents stand their ground\n\n\n\n\nNYC fashion wasn’t what I expected\n\n\n\n6 Brooklyn neighborhoods in outfits\n\n\n\n‘The New York Sari’ brings a meaningful depiction of the garment to NYC\n\n\n\n#NYCSampleSale: The door to discounted luxury\n\n\n\nBehind the scenes, student costume designers turn fabrics into personality\n\n\n\n\nNew eats near NYU: This nonprofit restaurant subverts fine dining\n\n\n\nStocking for success: Mini-fridge staples every student needs\n\n\n\nNew eats near NYU: This taco spot aims to meet a ‘higher standard’\n\n\n\nSNAP cuts leave students in need — here’s where to find and give support\n\n\n\nDitch Big Food for these local restaurants\n\n\n\n\nWith contemporary Iranian poetry, I reimagine my culture\n\n\n\nThe NYU students behind Mamdani’s historic win\n\n\n\nAs demolition looms, Chelsea residents stand their ground\n\n\n\nSNAP cuts leave students in need — here’s where to find and give support\n\n\n\n‘We’ve been through this before’: Why LGBTQ+ history matters\n\n\n\n\nRanked: Fan-favorite Halloween candy\n\n\n\nRanked: The best Bobst floors for studying\n\n\n\nRanked: Mooncake flavors we’re mooning over\n\n\n\nRanked: Manhattan’s AMC theaters\n\n\n\nRanked: NYU core requirements\n\n\n\n\nWSN at New York Fashion Week\n\n\n\nFrederick Anderson takes you on vacation with his newest NYFW collection\n\n\n\nShao New York invites the past into the future at NYFW\n\n\n\nAre you in heaven? Alexander King Chen’s solo show is a reflection of the inner self\n\n\n\nViator Felis showcases clothing fit for unconventional trailblazers\n\n\n\n\n5 musical adaptations that elevate their source material\n\n\n\n‘Bottom of the Pyramid’ belongs at the top of your reading list\n\n\n\nOff the Radar: ‘Golden Gate Girls’ highlights forgotten film history\n\n\n\nFrankenstein’s creature cries for empathy across film history\n\n\n\nReview: ‘Wicked: For Good’ rejuvenates a divisive second act\n\n\n\n\n‘Bottom of the Pyramid’ belongs at the top of your reading list\n\n\n\nBooks beyond Bobst: A feminist thriller, a tale of art forgery and more\n\n\n\nClassics that your syllabus forgot\n\n\n\nBooks beyond Bobst: A collegiate love triangle, jump-scares and more\n\n\n\nYour next read, based on your NYU school\n\n\n\n\nOff the Radar: ‘Golden Gate Girls’ highlights forgotten film history\n\n\n\nFrankenstein’s creature cries for empathy across film history\n\n\n\nReview: ‘Wicked: For Good’ rejuvenates a divisive second act\n\n\n\n‘Nuremberg’ echoes its cinematic predecessors\n\n\n\nReview: Sydney Sweeney punches up in the lackluster ‘Christy’\n\n\n\n\nReview: ‘EVERYONE’S A STAR!’ finally lets 5SOS escape boyband image\n\n\n\nQ&A: Founder of mercury talks crafting her grunge sound\n\n\n\nWith contemporary Iranian poetry, I reimagine my culture\n\n\n\nWhen anyone can be a rapper, Mickey Factz trains a different type of artist\n\n\n\nReview: Danny Brown fully reignites his passion on ‘Stardust’\n\n\n\n\n5 musical adaptations that elevate their source material\n\n\n\nWho will win ‘Dancing with the Stars’?\n\n\n\nQ&A: Center for Ballet visiting scholar on ballet’s evolution\n\n\n\nQ&A: Stella Adler alumni on forming their own theater company\n\n\n\nRanked: Broadway’s leading ladies\n\n\n\n\n20 Cooper Square Gallery navigates Oceanic tradition\n\n\n\nReview: ‘Everyday Rebellions’ creates unlikely comparisons\n\n\n\nReview: MoMA retrospective expands art’s boundaries\n\n\n\nTisch alum redefines Black transgender art\n\n\n\nNew Pokémon game gets an A for effort and a Z for enjoyment\n\n\n\n\nThe Beverage Issue | Under the Arch Magazine\n\n\n\nThe Career Issue | Under the Arch Magazine\n\n\n\nThe Commuter Issue | Under the Arch Magazine\n\n\n\nWelcome home, class of 2029\n\n\n\nThe Romance Issue | Under the Arch Magazine\n\n\n\n\nOn the Street: Comfort places\n\n\n\nBeverage Bundling\n\n\n\nCartoon: The ‘enlightened’ centrist\n\n\n\nIn photos: Election Day\n\n\n\nIn photos: The New York City Marathon\n\n\n\n\nCartoon: The ‘enlightened’ centrist\n\n\n\nCartoon: The hard-hitting questions of the NYC mayoral debate\n\n\n\nCartoon: An average conversation between Stern bros\n\n\n\nCartoon: The commuter life\n\n\n\nNYU Dining Halls: Farm-to-Table Eats!\n\n\n\n\nOn the Street: Comfort places\n\n\n\nOn the Street: Halloween\n\n\n\nOn the Street: Passage of time\n\n\n\nOn the Street: Silhouettes\n\n\n\nOn the Street: New York City\n\n\n\n\nIn photos: Election Day\n\n\n\nIn photos: The New York City Marathon\n\n\n\nMamdani is ready to be called up off the bench\n\n\n\nThe community at the heart of New York Comic Con\n\n\n\nArt under the city\n\n\n\n\nBeverage Bundling\n\n\n\nCanines in costumes return to Washington Square Park\n\n\n\nWhat’s your dream job?\n\n\n\nEcho Picone on balancing studies and stardom\n\n\n\nWhat’s for sale in Washington Square Park?\n\n\n\n\nSPONSORED: Winter break escape: A road trip from NYC to Washington, D.C.    \n \n \n \n \n \n       \n  \n \n \n \n \n \n \n  Open Navigation Menu    \n  \n \n \n   \n      \n\n\nNews \nCulture \nArts \nAbroad \nOpinion \nFeatures \nSports \nMagazine \nMultimedia \nAbout \nSubmit to WSN \nSubscribe to newsletter \nAdvertise  \n \n More \n       \n  \n  \n \nWashington Square News     \n \n \n \n  Open Search Bar    \n \n \n \n Search this site  \nSubmit Search        \n \n \n \n \n \n       \n  \n \n \n \n \n \n \n  Open Navigation Menu    \n  \n \n \n   \n      \n\n\nNews \nCulture \nArts \nAbroad \nOpinion \nFeatures \nSports \nMagazine \nMultimedia \nAbout \nSubmit to WSN \nSubscribe to newsletter \nAdvertise  \n \n More \n       \n  \n  \n \nWashington Square News     \n \n \n \n  Open Search Bar    \n \n \n \n Search this site  \nSubmit Search        \n \n \n \n \n \n       \n     \n \n \n \n\n   \n \n   \n   \n\n\n\n  \n  \n \n LATEST   \n \n  \n\n\n\n\n\n\nCity Scoop: Trump awed in meeting with Mamdani, and other top stories across NYC\n Leena Ahmed, Deputy News Editor • November 24, 2025\n\n\n\n\n\n\nOff Topic: Trump’s obsession with ICE is endangering America\n Grace Carmody, Staff Writer • November 24, 2025\n\n\n\n\n\n\nNYU Langone awarded ‘A’ in safety for 11th time\n Zachary Karp, Staff Writer • November 24, 2025\n\n\n\n\n\n\nEx-UN diplomat talks human rights careers with Steinhardt class\n Natalie Deoragh, Deputy News Editor • November 24, 2025\n\n\n\n\n\n\nLangone researchers find new way to detect nerve-killing head trauma\n Justin Liu, Contributing Writer • November 24, 2025\n \n     \n  \n \n EDITOR'S PICKS   \n \n  \n\n\n\n\nWSN at New York Fashion Week\n\n\n\n\nNYU Grossman rescinds program acceptances after losing federal grant\n\n\n\n\nAt least 2 NYU affiliates involved in organizations that promote anti-trans practices\n\n\n\n\n‘A chilling effect’: Conduct guidelines cast shadow of concern over faculty\n \n       \n \n \n Opinion: Want to make NYU affordable? Fix NYC housing \n By voting “yes” on the ballot this November, NYU students can help bring affordable living back to New York City. \n \n Ethan Du, Contributing Writer    \nSeptember 25, 2025  \n \n\n\n \n \n \nIvy Chan \n(Ivy Chan for WSN)  \n  \n \n \nCompared to other prestigious private universities, NYU’s tuition isn’t necessarily more expensive — but its room and board absolutely is. If you break down the numbers, NYU’s tuition for the 2025-26 school year is $65,622, for all but two of its schools. In comparison, Northwestern University’s tuition is $69,375, Columbia University’s is $71,170 and the University of Southern California’s is $73,260.  \nNYU dorms can range from $5,310 to a whopping $13,850 per semester. This cost is even more overwhelming if you live off campus, like the majority of upperclassmen do, where the average Greenwich Village apartment goes for $6,142 a month. Finding housing in the city has become practically mandatory for attending NYU, as the school’s own housing is prohibitively expensive, but living off campus comes with its own set of issues.  \n“Abundance,” a book by journalists Ezra Klein and Derek Thompson, blames decadeslong policy failure for the rampant cost-of-living crisis plaguing New York City. It has also prompted local advocacy groups like Abundance New York to confront this issue. Stifling government regulations, such as strict zoning laws and overreaching environmental regulations, have significantly reduced housing supply, skyrocketing costs for everyone. Concerns for preservation of the skyline and avoiding unnecessary congestion have also guided our zoning practices for too long, and it’s time the city prioritises affordability for its many residents.  \nThese zoning practices restrict the amount of units per building, mandated parking minimums and building height, significantly reducing the amount of housing that can be built in the city. In a sweep of legislation in 1961, New York City’s population capacity went from 55 million to 11 million as six-story apartment buildings were banned from being built across most of the city. A recent New York Times study even found that 40% of the buildings in Manhattan would be deemed illegal if they were built today. Whether the buildings are too tall, too dense with apartments or have too much commercial space, if New York City was rebuilt under current zoning laws, it would be a shell of its former self. These laws essentially make it impossible for anyone to build enough housing to satisfy the current shortage. \nFrom 2010 to 2020, the city’s population grew by 630,000, while the number of housing units only increased by 206,000. This results in a meager rental vacancy rate of 1.4% — the lowest in recent history — which allows predatory landlords to capitalize on a low-supply housing environment by raising rents dramatically, making the city unaffordable for millions of people. \nThe proven solution is to build more housing. From 2017 to 2021, Minneapolis increased its housing supply by 8%, and rents only increased by 1% between 2017 and 2023. Meanwhile, Tysons, Virginia increased its supply by 23%, and had only a 4% rent increase. Austin, Texas has allowed for an apartment building boom, granting thousands of permits, and rents have tumbled for 19 months straight. As for New York City, strict zoning codes implemented in the mid-1900s make this easier said than done.  \nIf we know that zoning is the problem, why don’t we just change the code? This is where New York City’s stifling system of bureaucracy, red-tape and regulations come in. While we can change zoning codes, the process, called the Uniform Land Use Review Procedure, can take over two years to complete and can raise development costs by 11 to 16%. Not only do these ULURPs have to be approved by the community board, the borough president, the City Planning Commission, the City Council and the mayor’s office, they also have to complete a land use application and environmental review. With this system, the city has essentially made high housing costs the de-facto law of the land.  \nIn contrast, Abundance calls on lawmakers to update housing policy by streamlining administrative processes and cutting bureaucratic red tape, allowing for the rezoning of the entire city. Through this rezoning process, we can allow buildings to have more units and to be built higher. As a result, we can finally make it legal to prioritize the construction of dense and affordable housing, lowering rents for everyone across the five boroughs.  \nIf you want to embrace the Abundance movement, now is the perfect time to do so. New York’s election day is Nov. 4, and not only should you vote Democrat Zohran Mamdani for mayor and Democrat Mark Levine for comptroller, you should also vote “yes” to questions two, three and four to amend the New York City charter. Question two, or “Fast Track Affordable Housing to Build More Affordable Housing Across the City,” would expedite housing applications in community districts producing the least affordable housing. Question three, or “Simplify Review of Modest Housing and Infrastructure Projects,” would streamline reviews for smaller infrastructure projects. Finally, Question four, “Establish an Affordable Housing Appeals Board with Council, Borough, and Citywide Representation,” would allow rejected affordable housing projects to be appealed. \nThese ballot questions all concern the aforementioned ULURP process, making the system for building new affordable housing faster, cheaper and more efficient. By embracing Abundance and voting in favor of these amendments, we can take a critical step forward in the fight to make New York City, and in-turn NYU, more affordable. \nWSN’s Opinion section strives to publish ideas worth discussing. The views presented in the Opinion section are solely the views of the writer. \nContact Ethan Du at [email protected].   \n \n  \n \n    Share on Facebook   \n \n    Share on X   \n \n    Email this Story   \n \n    Print this Story   \n   \n    \n  \n \n \n \n \n \n \n     \n \n \n \n \n   \n  \n  \n \nWashington Square News     \n \n     \n \n \n \n \n \n Join • Submit • Advertise • About • Masthead • Donate • Tips      \n \n \n \n \n \n  \n  Facebook    \n  Threads    \n  Instagram    \n  X    \n  Spotify    \n  LinkedIn    \n  YouTube    \n  Reddit    \n  Email Signup        \n \n \n \n \n     \n  \n \n \n \n \n \n  \n  Facebook    \n  Threads    \n  Instagram    \n  X    \n  Spotify    \n  LinkedIn    \n  YouTube    \n  Reddit    \n  Email Signup        \n \n \n \n    \n  \n \n \n \n  \n  \n    \n    \n \n \n \n \n \n Join • Submit • Advertise • About • Masthead      \n \n \n \n \n \n  \n  Facebook    \n  Threads    \n  Instagram    \n  X    \n  Spotify    \n  LinkedIn    \n  YouTube    \n  Reddit    \n  Email Signup        \n  \n  \n© 2025 Washington Square News • FLEX Pro WordPress Theme by SNO • Log in           \n \nClose \n  \n \nClose Modal Window \n  \n \nClose", "extraction_method": "jina", "word_count": 3005, "success": true}