{"full_text": "Trump Administration Exploring 50-Year Mortgage Plan to Tackle Housing Affordability - WCBM News-Talk Radio\nSkip to content\nShows\nCasey & Co.\nKim Klacik LIVE\nThe Rob Carson Show\nThe Sean Hannity Show\nThe Charlie Kirk Show\nThe Todd Starnes Show\nThe Right Side with Nino Mangione\nOn-Air schedule\nStein on Sports\nBuy Local MD\nEvents\nTaste of the Union\nPints and Politics\nCrab Feast & Chuck Roast\nKim Klacik Putting Social\nFreedom Fest\nMobile App\nMore\nAbout WCBM\nStaff Directory\nAdvertise with WCBM\nContests & Promotions\nEmployment / Public File\nAll about Real Estate\nAudiology Associates\nHow It Started with Rabbi Michoel Dov Streicher Shlita\nSafe Retirement Solutions\nThe Outdoorsman Radio Show\nThe Veterans & First Responders Community Show\nYou Auto Know\nMenu\nListen Live\nThe Rob Carson Show\n12:00 pm - 3:00 pm\n📲 The NEW WCBM Mobile App is HERE! Listen live ANYWHERE, ANYTIME. Podcasts. Text the studio. Download now on the App Store & Google Play!\nNational Headline\nTrump Administration Exploring 50-Year Mortgage Plan to Tackle Housing Affordability\nShare this post\nhttps://media.townhall.com/cdn/hodl/2025/288/dd89796f-b977-4343-a0a0-ec3d5f6b43d5.jpg\nAcross New York City and the country, the word on everyone’s lips is “affordability.” Over the weekend, President Trump said his administration is preparing to tackle housing costs head-on with a proposal for 50-year mortgage terms for new homebuyers.\nAdvertisement\nThe United States Director of Federal Housing, Bill Pulte, reposted a Truth Social post from President Trump depicting a list of “Great American Presidents,” with President Trump shown alongside Franklin Delano Roosevelt, the creator of the 30-year mortgage. “Thanks to President Trump, we are indeed working on the 50-year mortgage – a complete game changer,” he wrote on Saturday.\nThanks to President Trump, we are indeed working on The 50 year Mortgage – a complete game changer. https://t.co/HZDPzO0qJG\n— Pulte (@pulte) November 8, 2025\nOn Sunday, Pulte followed up on the proposed 50-year mortgage, emphasizing that it is a potential tool to help young people purchase homes, though not necessarily the only solution. Since the initial announcement, the proposal has drawn widespread criticism from both sides of the political aisle.\nWe hear you. We are laser focused on ensuring the American Dream for YOUNG PEOPLE and that can only happen on the economic level of homebuying. A 50 Year Mortgage is simply a potential weapon in a WIDE arsenal of solutions that we are developing right now. STAY TUNED!\nRecommended\nAdvertisement\nWe hear you. We are laser focused on ensuring the American Dream for YOUNG PEOPLE and that can only happen on the economic level of homebuying. A 50 Year Mortgage is simply a potential weapon in a WIDE arsenal of solutions that we are developing right now. STAY TUNED!\n— Pulte (@pulte) November 9, 2025\nThe goal of the 50-year mortgage would be to lower monthly payments; however, the reported decrease in a homebuyer’s monthly cost would be minimal, while the total amount paid in interest would increase substantially. Regardless, President Trump has heard the voice of the American people and is actively exploring options to ensure that younger generations of Americans can still afford a home and achieve their American Dream.\nEditor’s Note: After more than 40 days of screwing Americans, a few Dems have finally caved. The Schumer Shutdown was never about principle—just inflicting pain for political points.\nHelp us report the truth about the Schumer Shutdown. Use promo code POTUS47 to get 74% off your VIP membership.\nShare this post\nRelated Articles\nNov 24, 2025\nFederal Judge Issues Predictable Ruling on Letitia James and James Comey\nNov 24, 2025\nThird Time’s a Charm? Mamdani’s Back and Betting for More Cash\nNov 24, 2025\nThe Ever-Changing Political Environment\nNov 24, 2025\nDo No Harm Survey Shows Rank-and-File Doctors Oppose DEI in Healthcare\nNov 24, 2025\nHere’s What Georgia Voters Think of Majorie Taylor Greene After Resignation Announcement\nNov 24, 2025\nBombshell: Defending Ed Drops National Education Association Docs Detailing Radical LGBTQ Agenda\nNever miss out on important news again\nEmail\nThis field is hidden when viewing the form2 + 8 = ?CommentsThis field is for validation purposes and should be left unchanged.\nΔ\nBy subscribing, you agree to with our Privacy Policy\nResources\nAbout Us\nPrivacy Policy\nFCC Public File\nBuy Local MD\nFacebook\nX-twitter\nInstagram\nLinkedin\nApple\nGoogle-play\nAll content copyright © 2024 WCBM TALKRADIO AM 680. All rights reserved.", "extraction_method": "beautifulsoup", "word_count": 719, "success": true}