{"full_text": "Log in  About us   Contact us   Advertising   Archives   Subscribe   Newsletter Signup   \n \n   \n   \n   \n          \n \n \n \n   Pennsylvania, PA\n  Clear, 37° F   \n \n   \nMonday, November 24, 2025  \n \n \n  \n \n Advanced search      \n \n  \n \n Toggle navigation      Main menu    \n  \n \n \n \n  News    \n    \n \n Top Stories  \n Features  \n Zoning and Development  \n Crime   \n Top Stories  \n Features  \n Zoning and Development  \n Crime   \n \n \n  Entertainment    \n    \n \n Art  \n Theater  \n Music  \n Food  \n Books  \n Events  \n Explore   \n Art  \n Theater  \n Music  \n Food  \n Books  \n Events  \n Explore   \n \n \n  Community    \n    \n \n People  \n Business  \n Sports   \n People  \n Business  \n Sports   \n \n \n  Opinion    \n    \n \n Letters  \n Op-eds  \n Editorials  \n Columns   \n Letters  \n Op-eds  \n Editorials  \n Columns   \n \n \n  Neighborhoods    \n    \n \n Chestnut Hill  \n Mt. Airy  \n Springfield Township  \n Germantown   \n Chestnut Hill  \n Mt. Airy  \n Springfield Township  \n Germantown   \n \n \n  Wissahickon   \n    \n \n \n  Obituaries    \n    \n \n Death Notices  \n Obituaries   \n Death Notices  \n Obituaries   \n \n \n  Marketplace    \n    \n \n Browse the classifieds  \n Place a classified ad  \n This week's print ads   \n Browse the classifieds  \n Place a classified ad  \n This week's print ads   \n \n \n  A Local Lens   \n    \n \n \n  About us     \n \n \n  Contact us     \n \n \n  Advertising     \n \n \n  Archives     \n \n \n  Subscribe     \n \n \n  Newsletter Signup          \n \n Log in \n  \n \n  \n       \n   \n    \n \n \n    \n \nFaith leaders call for housing affordability and a repeal of city’s business tax cuts \n \n \n \n \n     \n City Councilmember Nicolas O’Rourke (right), Seth Anderson-Oberman (left), and Kadi Ashby (middle) spoke at a press conference Saturday organized by Power Interfaith.  \n Photo by Tommy Tucker   \n \n     \n Rev. Alisa Lasater Wailoo (right) spoke about the affordability crisis during a press conference on Wednesday Nov. 12.  \n Photo by Tommy Tucker      Previous    Next   \n \n   \n      \n Posted  Wednesday,  November 19, 2025  12:00 am   \n \nby Tommy Tucker \nFaith leaders called for housing affordability and a repeal of the city’s business tax cuts last week during a series of press conferences in neighborhoods across the city including the Northwest. \nFive of the press conferences hosted by POWER Interfaith, a multiracial and multifaith social justice organization, were in Germantown and Mt. Airy. POWER Interfaith’s goal is to pressure City Council into intensifying efforts to address the current housing affordability crisis Philadelphia residents are facing. \nFaith leaders specifically focused on City Council’s June 12 decision to gradually reduce Business Income and Receipt Tax (BIRT), citing potential harm to the city’s working class and most vulnerable residents. \nThe BIRT tax is the third-largest source of tax revenue for the city, paid for by business owners or companies engaged in for-profit activity within the City of Philadelphia. The tax is not levied on residents who are not business owners. \n“Cutting business taxes is estimated to cost the city $2.8 billion over 12 years, removing significant dollars from the city budget and forcing residents to shoulder more of the burden,” Jayson Massey, a member of Germantown Friends Meeting, said at a press conference Saturday outside Germantown High School. \nHe added, “We are here today in front of the former Germantown High School to show the crisis of affordable housing in Germantown, and also to show that the loss of Germantown High School did not result in usable, safe, and affordable housing for the residents here in Germantown. This neighborhood, with a median income of only $45,727, does not need luxury apartments.” \nThe high school building, which closed in 2013, has been converted into an apartment complex called The Annex at Germantown, where rents begin at $1,050 for studio apartments, according to rent.com. \nAlong with Germantown and Greene Street Friends Meeting, Northwest faith groups and congregations joining the initiative to lobby for affordable housing include St.Vincent de Paul Catholic Church, Faith Chapel, Face to Face Germantown, Mishkan Shalom synagogue, First United Methodist Church of Germantown (FUMCOG), Second Baptist Church of Germantown, and Unitarian Universalists of Mt. Airy. \n\n      \n \nOn Wednesday, Nov. 12, FUMCOG co-hosted one of the press conferences, with their senior pastor, the Rev. Alisa Lasater Wailoo, speaking on the issue of affordability. \n“When I arrived here about three years ago, I would say we got about two calls a week for folks in need. We’re now getting about a dozen calls a week, easily,” Wailoo said. “We get calls from young mothers. And it’s not just calls, members of our church, we have seniors who don’t know if they’re going to be able to turn on their heat. We have veterans who wonder about their medical bills. And we have working folks of every race, every gender, every orientation, and background that are struggling.” \nAt Saturday’s press conference in front of Germantown High School, several speakers and attendees joined the group of faith and civic leaders including City Councilmember Nicolas O’Rourke and Seth Anderson-Oberman, who ran against Councilmember Cindy Bass in 2023. \nO’Rourke, along with fellow Working Families Party City Councilmember Kendra Brooks, opposed the decision to phase out the BIRT tax. \n“There are very few issues that are as constant as the cost of housing and the terms on which you secure it,” O’Rourke said. “The city’s widest housing gap is the shortage of almost 65,000 units, affordable and available to those with the lowest incomes. That’s a problem.” \nHe then discussed what he described as a weakness in Mayor Cherelle Parker’s housing plan. \n“The mayor’s plan for housing, which I have said, and I will say again, does have its fair share of bright spots … But something a number of my colleagues and I have raised was the importance of codifying that most of the plan’s funding goes towards those making the least. Codifying it, not just stating an intention but writing that intent into the letter of the law,” O’Rourke said. “The administration flatly refused to do this a couple of times.” \nHe added, “We know there’s no housing gap for luxury apartments. You see them all over the place, and they’re good and empty … Everyone further up the income scale has a unit that’s available to them, though it may not be their dream apartment. It may not be the exact thing that they’re looking for; it may not hit all of their preferences. It may not be the perfect setup, but they can’t afford it. With this in mind, I simply don’t see why we aren’t being clear about working for those who simply don’t have an option that they can afford.” \nKadi Ashby, the president of the Alden Park Tenants Association, shared her experience as a tenant. When she organized the tenants group early this year, Ashby and her neighbors fought for better maintenance and responsiveness from their building’s management company. \nAfter months of organizing, she received an email from property management denying her a lease renewal, without providing a reason. \n“I am left unable to afford to move. I’m unable to find a comparable apartment in my neighborhood, and it’s possible that this will force me out of my community, the community that, through all of this, has shown me overwhelming support,” Ashby said. ‘We need all of our city council members to commit to fighting gentrification and the corporate landlords taking over our neighborhoods.” \nOne goal of O’Rourke’s office has been to push for better protections for renters, including a bill that would require “good cause” for denying a lease renewal. This effort would protect tenants who attempted to organize from retaliation. \nAnderson-Oberman, who is currently the executive director of the advocacy group Reclaim Philadelphia, ran on a progressive platform, narrowly losing to Bass in the 2023 Democratic primary. On Saturday, he discussed his own family’s struggle with affordability and the actions he believes the city must take to address the housing crisis. \n“The private sector alone, the so-called free market, is never going to solve this crisis. If the private sector were going to build deeply affordable housing for working-class families, they would have done it already,” Anderson-Oberman said. “That’s why our government — city, state, and federal — must step in and build the housing that we actually need. We need public investment. We need government-funded social housing that is mixed-income and permanently affordable.” \nWork ahead \nOn Feb. 1, Power Interfaith will host a Citywide Affordability Summit, inviting City Councilmembers to speak with faith leaders, advocates, and residents about a long-term solution to the shortage of affordable housing and other affordability issues. \nReflecting on the week of press conferences, Meg Cruz, the Northwest organizer for POWER Interfaith, told the Local, “I think it was a super powerful week of action where we saw over 20 of our congregations who were represented at these different press conferences. We had everyday people speaking out about how the affordability crisis impacted them and what the implications of this loss of [BIRT] funding would be like.” \nShe added, “This is a crisis that is really escalating at a scale that is impossible for people to withstand within their own means, and the decision to eliminate business taxes makes that worse.” \nTommy Tucker can be reached at Tommy@Chestnuthilllocal.com.  \n \n                            \n \n Other items that may interest you  \n \n \n \n  Faith leaders call for housing affordability and a …    \n \n \n  Community leaders react to mayor’s new …    \n \n \n  St. Martin-in-the-Fields helps resettle Afghan family    \n \n \n  New executive director of Bird in Hand strives for …         \n \n \n \n      \n \n \n      \n \n \n      \n \n \n      \n \n \n      \n \n \nLocal Calendar \n    \n \n \n      \n \n \n      \n \n \n      \n \n \nThe Latest  \n \nA tribute to Rabbi Waskow Recently, I became aware of the passing of author, social activist Rabbi Arthur Waskow, who packed a lot of punch into his 92 years. \n  \n \n     \nRichard Allen Lane Station is a model of success The Richard Allen Lane Station was the first site along the Chestnut Hill West line to be leased to Ken Weinstein more than 20 years ago. Now that he has been granted five more stations to renovate, it can serve as a template for the others. \n  \n \n     \nHome Works and CHCA set seasonal tables Home Works and the Chestnut Hill Community Association hosted a free, members-only table setting workshop on Nov. 12 to ring in the holiday season. \n  \n \nTips for throwing a fantastic Friendsgiving Get the whole gang involved so everyone is invested and feels like it is “their” event. \n  \n \n     \nAnnual ‘Vegan ThanksLiving Potluck Dinner’ at Hill site Most people in Northwest Philadelphia will probably have turkey as their main course for dinner on Thanksgiving Day. \n   \n \n \n \n      \n \n \n      \n \n \n      \n \n \n      \n \n \n      \n \n \n \n\nFacebook   \n \n \n      \n \n \n      \n \n \n          \n \n \n    \n \n \n   \n   \n   \n  \n      \n \n \n 8434 Germantown Ave. \nPhiladelphia, PA 19118\n 215-248-8800   \n  \n \n \n News  \n Entertainment  \n Community  \n \n Opinion  \n Neighborhoods  \n Wissahickon  \n \n Obituaries  \n Marketplace  \n A Local Lens  \n    \n    \n \n \n © Copyright 2025 The Chestnut Hill Local  \n Powered by Creative Circle Media Solutions", "extraction_method": "jina", "word_count": 1645, "success": true}