{"full_text": "US\nCrime + Justice\nWatch\nSubscribe\nSign in\nUS\n•\n2 MIN READ\nFOR SUBSCRIBERS\nBuying a home isn’t affordable in many metro areas. What about yours?\nBy\nByron Manley\n,\nMatt Stiles\nUPDATED NOV 21, 2025\nCheviot Hills is seen in Los Angeles on April 1, 2025. Myung J. Chun/Los Angeles Times/Getty Images\n\nThe cost of owning a home in the US has surged since the Covid-19 pandemic. The median home price in August was $413,000, up from $321,000 during the same month in 2020 — a 28% increase, according to federal data.\n\nTo better understand this strain on some families, CNN turned to a home ownership affordability index published by the Federal Reserve Bank of Atlanta. It measures the affordability for median-income households across the US who are hoping to buy a median-priced home in a given area.\n\nThe index compares the actual median household income to the “qualified” income needed to keep annual housing costs at or below 30%.\n\nAn index score of 100 or higher indicates the median household income is enough to afford the median-priced home based at that threshold. A score less than 100 means the median income is not enough for a median-priced home.\n\nCNN is tracking this index as it’s periodically updated by the Atlanta Fed. Look up your area to see the trends over time — and how they compare with the national average.\n\nThe Atlanta Fed’s housing data is available at both the national level and for individual core-based statistical areas, or CBSAs. It’s updated monthly, though there’s typically a two-month lag — mainly because of the time it takes to record and collect home sales deeds. In some regions, the data can show noticeable fluctuations due to seasonal changes in median home prices or shifts in the volume of sales used to calculate those medians.\n\nThe Atlanta Fed’s data comes from its Home Ownership Affordability Monitor, or HOAM. It factors in the monthly principal and interest cost, given the current mortgage interest rates, as well as taxes, property insurance and private mortgage insurance in the total cost of home ownership.\n\n“The HOAM index is designed to easily track affordability over time in the United States across geographies,” said Domonic Purviance, a real estate expert with the Atlanta Fed who helped develop the tool.\n\nThe center of gravity on affordability has shifted dramatically across the country during the last five years, according to a CNN analysis of the data.\n\nMost metropolitan areas are now on the more expensive side of the threshold.\n\nThis nationwide shift varies by region.\n\nToday, most metropolitan areas in the West, for example, are too expensive for the median household under the income threshold. The Midwest has gotten dramatically more expensive, too.\n\nUS\nCrime + Justice\nWorld\nAfrica\nAmericas\nAsia\nAustralia\nChina\nEurope\nIndia\nMiddle East\nUnited Kingdom\nPolitics\nTrump\nFacts First\nCNN Polls\n2025 Elections\nRedistricting Tracker\nBusiness\nTech\nMedia\nCalculators\nVideos\nMarkets\nPre-markets\nAfter-Hours\nFear & Greed\nInvesting\nMarkets Now\nNightcap\nHealth\nLife, But Better\nFitness\nFood\nSleep\nMindfulness\nRelationships\nCNN Underscored\nElectronics\nFashion\nBeauty\nHealth & Fitness\nHome\nReviews\nDeals\nGifts\nTravel\nOutdoors\nPets\nEntertainment\nMovies\nTelevision\nCelebrity\nTech\nInnovate\nForeseeable Future\nMission: Ahead\nWork Transformed\nInnovative Cities\nStyle\nArts\nDesign\nFashion\nArchitecture\nLuxury\nBeauty\nVideo\nTravel\nDestinations\nFood & Drink\nStay\nNews\nVideos\nSports\nPro Football\nCollege Football\nBasketball\nBaseball\nSoccer\nOlympics\nHockey\nScience\nSpace\nLife\nUnearthed\nClimate\nSolutions\nWeather\nWeather\nVideo\nClimate\nUkraine-Russia War\nIsrael-Hamas War\nWatch\nFeatured\nShows & Films\nNetwork TV\nClips\nCNN Headlines\nCNN Shorts\nTV Shows A-Z\nCNN 10\nCNN Max\nTV Schedule\nListen\nCNN 5 Things\nChasing Life with Dr. Sanjay Gupta\nThe Assignment with Audie Cornish\nOne Thing\nTug of War\nCNN Political Briefing\nThe Axe Files\nAll There Is with Anderson Cooper\nAll CNN Audio podcasts\nGames\nDaily Crossword\nJumble Crossword\nPhoto Shuffle\nSudoblock\nSudoku\n5 Things Quiz\nBlack Friday Deals\nAbout CNN\nSubscribe\nPhotos\nInvestigations\nCNN Profiles\nCNN Leadership\nCNN Newsletters\nWork for CNN\nUS\nFOLLOW CNN\nSubscribe\nSign in\nTerms of Use\nPrivacy Policy\nManage Cookies\nAd Choices\nAccessibility & CC\nAbout\nSubscribe\nNewsletters\nTranscripts\nHelp Center\n\n© 2025 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.\nCNN Sans ™ & © 2016 Cable News Network.\n\nLegal Terms and Privacy\n\nBy clicking \"Agree\", you have read and agree to the Terms of Use and agree to the collection and use of your information by cookies and similar technologies, as set forth in our Privacy Policy.\n\nAgree", "extraction_method": "jina", "word_count": 747, "success": true}