{"full_text": "Trump administration tries to break through lock-in effect with 'portable mortgages'NewsNewsLexington reacts to Tyson plant closureLexington is reeling from the announcement that Tyson Foods will close its beef processing plant, leaving 3,200 workers without jobs. The Springdale, Arkansas-bNebraska celebrates caregivers, highlights vital support resourcesThe Nebraska Department of Health and Human Services (DHHS) is honoring caregivers throughout November, recognizing their crucial role in supporting communitiesNebraska college emphasizes service and resilience in agriculture educationAs the nation honored Veterans Day and moves toward Thanksgiving, the Nebraska College of Technical Agriculture (NCTA) in Curtis reflects on the spirit of serviHastings park restrooms to close for winter on Nov. 25Restrooms at Crosier Park, Heartwell Park, Lake Hastings, Chautauqua Park, and Lincoln Park in Hastings, which are equipped with small electric heaters, are setLocalNTV's GrowOffbeatNation & WorldEntertainmentVideosConnect to CongressHealthArmstrong Army StrongAmazing AmericaInside Your WorldBeyond the PodiumQuestion of the DaySpotlight on AmericaNebraska FloodingLegislatureLocal PoliticsHealthy HomeNoticias NTVFull Measure with Sharyl AttkissonAuto MattersBack to SchoolAddicted AmericaCrisis in the ClassroomCrimeWeatherCurrent WeatherKearneyPartly Cloudy47F44/37Today44/37Tuesday44/21Wednesday41/20Latest WeathercastLatest WeathercastRadarMapsViaero Camera NetworkClosingsSportsSports#2 Lopers to Host NCAA Central Regionals; Seven of the Nation's Top 17 ComPress release courtesy of UNK Athletics:The now second-ranked Nebraska-Kearney volleyball team is in the NCAA Tournament for a 26th straight season and will hosSuperstars Merritt Beason, Allison Holder, and Morgan Stout to serve as instructors duringPress release courtesy of the Omaha Supernovas:The Omaha Supernovas, the world’s leading professional volleyball franchise, is excited to partner with Kearney SUNK Volleyball: #3 Lopers Win the MIAA Tourney, Will Host NCAA Regionals in DecemberPress release courtesy of UNK Athletics:The third-ranked Nebraska Kearney volleyball team served up a season-high 11 aces and hit .316 to sweep seventh-ranked WNebraska loses to Penn State on the roadPress Release courtesy of Nebraska Athletics-Penn State scored on six of its nine drives and the Nebraska football team fell to the Nittany Lions by a score of Local SportsHigh SchoolCollegeAthlete of the WeekBig Red RundownTICKETSCity GuideFeaturesFeaturesShop great deals at Ken's Black Friday Sale KEN'S\"No Peeking\" event kicks off at Real Deals in KearneyREAL DEALSGive a gift that is Nebraska-made from Grow NEGROW NEBRASKAShop local this Christmas season - Holdrege for the Holidays! Join us For WinterFest!Saturday, December 13th, 2025www.HoldregeChamber.comFor more informationCareersContact UsOn the MenuNTV's Good LifeGood Morning NebraskaSinclair CaresOutdoor FilesHealth ConnectionsPartner SpotlightYou Ask NTV AnswersState FairFor Pet's SakeBlood DriveLifestyle MattersYour Place Inside and OutGuide to the Good LifeAll in a Day's WorkStructure StoriesShow Us Something GoodSkyWatch DroneKeeping You HealthySafe TravelsSmart LivingStationWatchLiveNow47°Tue46°Wed40°SearchSearchUser IconWatchSearchNewsDown ArrowLocalNTV's GrowOffbeatNation & WorldEntertainmentVideosConnect to CongressHealthArmstrong Army StrongAmazing AmericaInside Your WorldBeyond the PodiumQuestion of the DaySpotlight on AmericaNebraska FloodingLegislatureLocal PoliticsHealthy HomeNoticias NTVFull Measure with Sharyl AttkissonAuto MattersBack to SchoolAddicted AmericaCrisis in the ClassroomCrimeWeatherDown ArrowWeather HomeRadarMapsViaero Camera NetworkClosingsSportsDown ArrowSports HomeLocal SportsHigh SchoolCollegeAthlete of the WeekBig Red RundownTICKETSCity GuideFeaturesDown ArrowFeatures HomeCareersContact UsOn the MenuNTV's Good LifeGood Morning NebraskaSinclair CaresOutdoor FilesHealth ConnectionsPartner SpotlightYou Ask NTV AnswersState FairFor Pet's SakeBlood DriveLifestyle MattersYour Place Inside and OutGuide to the Good LifeAll in a Day's WorkStructure StoriesShow Us Something GoodSkyWatch DroneKeeping You HealthySafe TravelsSmart LivingStationDown ArrowStation HomePeopleContestsScheduleContact UsCareersCommunity CalendarNewsletter Sign UpNewsletter Sign UpGame CenterDown ArrowGame Center HomeDaily Crossword Guess Word Jewel Block Micro CrosswordClassic Sudoku Word SearchMoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsChime InLegalDown ArrowTerms & ConditionsCopyright NoticesEEO Public File ReportKHGI FCC InfoKHGI FCC ApplicationsKWNB FCC InfoKWNB FCC Applications KHGI-CD FCC InfoPublic File AssistanceContactPeopleCareersConteststwitter iconfacebook iconACCESSIBILITYArmstrong Williams Town HallArmstrong Williams takes on the news of the week and asks the questions you want answered. Don’t miss our weekly town hall!WATCHClose11Please ensure Javascript is enabled for purposes of website accessibilityTrump administration tries to break through lock-in effect with 'portable mortgages'by AUSTIN DENEAN | The National News DeskFri, November 14, 2025 at 11:47 AM4VIEW ALL PHOTOSFILE - A for sale sign stands outside a home on the market in the Alamo Placita neighborhood Tuesday, Aug. 27, 2024, in central Denver. (AP Photo/David Zalubowski, File)Comment on this story0CommentShare storySharetopics: Mortgage ratesPortable mortgagesHousing affordabilityLock-in effectHomeownershipHousing supplyMortgage-backed securitiesTariffsWASHINGTON (TNND) — The Trump administration is considering another method to bring down soaring housing costs through mortgage rates that are pricing people out of homeownership and keeping homes from coming onto the market.Federal Housing Finance Agency director Bill Pulte said the administration is “actively evaluating “portable mortgages,” which would allow homebuyers to take their mortgage rate with them when they decide to move. The proposal is a direct bid to confront the so-called “lock-in effect,” where homeowners are unwilling or unable to part with their lower mortgage rate and keeping their home off the market.Many homeowners were able to buy or refinance during the pandemic for ultra-low rates at or below 3%, which cuts hundreds of dollars off a monthly mortgage payment. Rates have been stuck between 6 to 7% for the last several years, creating a barrier for homeowners to put their homes up for sale as they don’t want to take up a new loan at higher rates. More than half of homeowners with a mortgage have a rate below 4%, according to Redfin.Homes are changing hands at the lowest rate in decades in 2025 in a market that has been in a standstill for years as mortgage rates climbed and economic uncertainty set in. A Redfin analysis found only 2.8% of homes in the U.S. have turned over to a new owner in 2025.“Buyers are walking away from deals more often, sometimes due to affordability issues and sometimes because they’re re-evaluating whether now is the right moment to commit,” Redfin head of economic research Chen Zhao said in a release. “Others aren’t even shopping, waiting instead for prices or mortgage rates to come down. On the other side, many sellers are staying put—either because they’re locked into low rates or unwilling to accept offers below expectations.”Allowing people to take their mortgage rate with them to a new property could help boost the supply of existing homes on the market if more homeowners are willing to move with their lower rate.But it could also come with higher list prices as more people enter a market with a limited pool of homes available to buy. Homeowners would also have an advantage on bidding compared to a new buyer who is working with today’s rates with more wiggle room in their budgets.“Anyone able to ‘port’ a 3% mortgage into a new purchase would effectively be bidding with cheap financing in a 6% world. That added purchasing power would push prices up, while renters and mortgage-free owners would still face today’s higher rates—only now with even higher list prices,” Jake Krimmel, a senior economist at Realtor.com, wrote in an analysis.Portable mortgages could also disrupt the U.S. mortgage system and lead to higher rates. Mortgage-backed securities, groups of mortgages that lenders sell to investors, would have their pricing models blown up and create more risk for investors as less loans are paid off early with more homeowners taking them with them when they move.Pulte has also said officials are evaluating a plan to offer 50-year mortgages and how to make mortgages assumable, where homebuyers could take over a seller’s preexisting loan. Assumable mortgages are already available in the U.S. but are rarely used because they require a large cash payment or a second mortgage at current rates.The 50-year mortgage could lower monthly payments by stretching out the term of the loan but would also likely come with higher rates and would ultimately cost buyers more in interest over the life of the loan and make it take longer to build equity.The administration’s efforts to lower housing costs come as an increasing slice of Americans are being priced out of the market altogether with elevated mortgage rates and consistently growing list prices. Home values have climbed significantly compared to before the pandemic for both new and existing homes amid a lack of sufficient supply.A shortage of homes is widely seen as the biggest issue when it comes to tackling housing affordability in the United States. Construction cratered in the aftermath of the 2008 financial crisis and has struggled to recover to a sufficient level to meet the demand.Housing starts have slumped in 2025 as builders confront cost challenges and a stalled market. Higher rates are also a challenge for construction, which is also impacted by the rising cost of labor and materials.Tariffs have been a double blow for builders, as the uncertainty around them has chilled activity in the housing market and broader economy. Import taxes have also increased the cost of materials used to build homes, making it more expensive for builders to start and complete projects.Tariffs that went into effect last month imposed a 10% tax on all timber and lumber imports, along with a 25% tariff on kitchen cabinet and furniture. The U.S. imports about one-third of its lumber, primarily from Canada, that are also subject to further tariffs.TrendingGrand Island man arrested for allegedly stealing over $2,000 from Walmart registersA Grand Island man is behind bars after he allegedly pocketed hundreds of dollars from a cash register at his workplace.Manuel Busto Gonzalez was arrested for tTwo charged in alleged assault at UNKTwo people have been charged following an alleged assault on the University of Nebraska-Kearney campus early Sunday morning.Romeo Madlock, 23, of Hastings, is cNorth Platte man acquitted of assault charges, guilty of witness tamperingA Lincoln County jury has found a North Platte man not guilty of three charges and guilty of one.According to Lincoln County District Court records, a jury founGrand Island man charged with first-degree sexual assault of a childA Grand Island man has been charged with sexually assaulting a juvenile girl.Brian Thomas, 40, is charged in Hall County Court with first-degree sexual assault Package thefts prompt Grand Island police investigationGrand Island Police are also investigating after two people reported their packages are stolen.GIPD says the individuals reported Friday that two packages contaNEWS IN PHOTOS:\"Local\"5Lexington reacts to Tyson plant closure4Ag industry gathers in Gothenburg for innovative startup program launch38-month update: An outlook on the Kearney Sportsplex's early impact\n6Ryder Park stadium renovation begins with $5.1 million upgradeACCESSIBILITYDownload Our Mobile Apps:Terms & ConditionsCopyright NoticesEEO Public File ReportKHGI FCC InfoKHGI FCC ApplicationsKWNB FCC InfoKWNB FCC Applications KHGI-CD FCC InfoPublic File AssistanceContactPeopleCareersContestsNewsSportsWeatherGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1678, "success": true}