{"full_text": "Business\nFed Slashes Rates Again — Here’s How It Could Affect Housing Affordability\n(Photo by Chip Somodevilla/Getty Images)\nMelissa O'Rourke\nReporter\nOctober 29, 2025\n2:01 PM ET\nOctober 29, 2025 2:01 PM ET\nMelissa O'Rourke\nReporter\nFont Size:\nThe Federal Reserve announced its second interest rate cut of the year on Wednesday, reducing the benchmark rate by a quarter-point to lower the target range to 3.75%-4.00%.\nThe decision, made by the Federal Open Market Committee (FOMC) after a two-day meeting, follows a quarter-point reduction in September. The move comes amid softer labor market conditions and a federal government shutdown that has stalled most economic data releases.“Falling interest rates will help America’s small businesses access the credit they need to capitalize on the strong economic momentum created by President Trump and Congressional Republicans’ pro-growth policies,” Job Creators Network CEO Alfredo Ortiz told the Daily Caller News Foundation. “With inflation tamed, gas prices at their lowest level in years, record stock market highs, and the Big Beautiful Bill’s tax cuts fueling expansion, the economy is well-positioned for continued growth,” Ortiz added. “This rate cut will empower small businesses to expand, hire, invest, and drive America’s economic resurgence to even greater heights.” (RELATED: SCOTT TURNER: At HUD, Homes and Healthcare Financing Are On The Line During Shutdown)\nUS Federal Reserve Chair Jerome Powell speaks at a news conference at the Federal Reserve headquarters, following the Federal Open Market Committee (FOMC) meeting in Washington, DC, on September 17, 2025. (Photo by JIM WATSON/AFP via Getty Images) The cut comes against a backdrop of weakening jobs data. The most recent available report, for August, showed just  22,000 jobs added, while Bureau of Labor Statistics revisions revealed 911,000 fewer jobs created over the prior year than previously estimated.\nThe September employment report, typically released in early October, remains unpublished due to the shutdown. The only major data point issued since the impasse began was Friday’s Consumer Price Index, which showed annual inflation rising 3% in September, below forecasts. Fed Chair Jerome Powell, speaking on Oct. 14, acknowledged the data vacuum but noted the central bank continues to monitor an array of public and private-sector indicators, stating that the “outlook for employment and inflation does not appear to have changed much since our September meeting.” Powell added that while recent economic data have come in stronger than expected, it hasn’t yet translated into renewed hiring strength.\n“You do have a bit of tension between labor market data – we see very low levels of job creation – and yet people are spending,” Powell said. “We are going to have to see how that plays out.” Economists broadly anticipate a third quarter-point cut at the Fed’s December meeting, which would bring the federal funds rate 0.75 percentage points lower by year-end than it stood in January. “Inflation has been surprisingly sticky, but is coming down and will continue to come down. Thus, a series of quarter-point cuts until the funds rate is approaching 3% seems appropriate,” JD Foster, former chief economist at the Office of Management and Budget, told the DCNF. “As the economy appears to remain on pretty solid footing, there’s no real need to move more quickly.” Mortgage rates — which the Fed does not directly control but are strongly influenced by its actions — have already fallen in anticipation. Freddie Mac reported the average 30-year fixed-rate mortgage at 6.19% as of Oct. 23, down from 6.5% a year earlier. Yet, further relief to homebuyers may be limited. “Markets are forward-looking and have already priced in the likelihood of additional cuts,” Tobias Peter, co-director at the American Enterprise Institute’s Housing Center, told the DCNF. “Rates have come down quite a bit from a year ago, so another quarter-point move may not shift the needle much.” At around 6%, many existing homeowners remain locked into lower-rate mortgages and are reluctant to sell, constricting supply. Housing affordability has become a key focus for the Trump administration, as only 28% of homes in the market are affordable for the average household, according to Realtor.com. Treasury Secretary Scott Bessent stated in September that the administration may declare a national housing emergency, while President Donald Trump has also floated ideas like eliminating capital gains taxes on home sales. Foster, however, voiced skepticism about such tax changes. “Few home sellers pay capital gains tax because they roll their equity into their next home. And for those few who might face a tax, what happens? The same thing that happens whenever you cut the tax on an asset — the asset price rises,” Foster said. “That’s not making housing more affordable.” Foster argued the most effective lever remains lower interest rates, saying, “Bring down mortgage rates and, over time, local housing markets will return to normal in terms of supply.” Peter said that while many solutions to the affordable housing crisis must come from state and local governments, such as zoning reform, there are also meaningful steps that can be taken at the federal level. For example, he suggested that the Bureau of Land Management could sell land located within one to five miles of existing development. “Over the span of 10 years, we think that could easily add up to a million new housing units,” Peter said. He also urged the administration to use its bully pulpit to promote reforms such as reducing minimum lot sizes, lowering taxes for small-scale developers, and easing restrictions on manufactured homes, measures he said could significantly boost the housing supply. All content created by the Daily Caller News Foundation, an independent and nonpartisan newswire service, is available without charge to any legitimate news publisher that can provide a large audience. All republished articles must include our logo, our reporter’s byline and their DCNF affiliation. For any questions about our guidelines or partnering with us, please contact licensing@dailycallernewsfoundation.org.\nTags : federal reserve interest rates jerome powell scott bessent trump administration\nScroll down for comments", "extraction_method": "beautifulsoup", "word_count": 987, "success": true}