{"full_text": "Trump administration tries to break through lock-in effect with 'portable mortgages'NewsNewsNonresident tags, strategic plan update headline Idaho Fish and Game commission meeting LEWISTON, ID &mdash; Following their public hearing, Idaho Fish and Game held their official commission meeting last week, and the topics discussed ranged from the adNational gas prices steady at $3.03The national average price of gasoline is unchanged in the last week, averaging $3.03/g today. The national average is down 2.0 cents per gallon from a month aIdaho State Police increase patrols for Thanksgiving travel safetyWith record numbers of drivers expected on the road this week, the Idaho State Police (ISP) is increasing patrols around the Thanksgiving holiday. The agency isIdaho State triumphs over University of Idaho 31-16 in historic rivalry gameIdaho State secured a 31-16 victory over the University of Idaho in their forty-seventh meeting, a rivalry that dates back to 1916.This game marked the second LocalNation & WorldEntertainmentOffbeatVideosConnect to CongressHealthConsumerTechnologyAmazing AmericaTrafficElectionAcademic All-StarArmstrong Army StrongChime InInside Your WorldCommunity HeroesSoarBeyond The PodiumQuestion of the DayPet of the WeekSpotlight on AmericaFor Pet's SakeHealthy HomeFull Measure with Sharyl AttkissonDid You Know?Addicted AmericaCrisis in the ClassroomWeatherCurrent WeatherLewistonPartly Cloudy39F43/30Today43/30Tuesday43/38Wednesday45/40Latest WeathercastLatest WeathercastRadarMapsHurricane TrackerClosuresKeith's Big FishFlight StatusSki ReportCamerasStationStationHOLIDAY TRIVIA OFFICIAL CONTEST RULESHOLIDAY TRIVIA OFFICIAL CONTEST RULESContest: HOLIDAY TRIVIAMarket(s)/Station(s): Abilene, TX (KTXS), Albany/Schenectady/Troy, NY (WCWN,WRGB), Amarillo, TX (KVITrick or Treat TriviaTRICK OR TREAT TRIVIA OFFICIAL CONTEST RULESContest: TRICK OR TREAT TRIVIAMarket(s)/Station(s): Abilene, TX (KTXS), Albany/Schenectady/Troy, NY (WCWN,WRGB), AmaFrequently Asked QuestionsFrequently Asked QuestionsFrequently Asked QuestionsFrequently Asked QuestionsContactKLEW StaffCareersScheduleContests2016 KLEW Best of the West WinnersSinclair CaresPartner Spotlight2017 Best of the West Winners2018 Best of the West WinnersNewsletter Sign UpSportsSportsLewiston Bengals gear up for promising basketball season with returning key talentsLewiston Bengals gear up for promising basketball season with returning key talentsKendrick Tigers claim fifth title, crushing Logos Knights' dreams 54-26MOSCOW, ID - The 2A State Championship game for the Kendrick Tigers and the Logos Knights.The Tigers pulled out the win for their fifth straight title and an unCougars roar back to beat Thunderbirds, Okafor shines with career-high 27Cougars roar back to beat Thunderbirds, Okafor shines with career-high 27Kendrick Tigers seek perfect season and fifth title against familiar foe Logos KnightsLEWISTON, ID &ndash; The Idaho 2A State Championship game for the Kendrick Tigers and the Logos Knights.Kendrick is going for yet another title to cap off an undefeatExtrasProfessionalCollegePrep AthleteScoreboardPrep SportsTICKETSCity GuideGame CenterGame CenterDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchWatchLiveNow39°Tue43°Wed45°SearchSearchUser IconWatchSearchNewsDown ArrowLocalNation & WorldEntertainmentOffbeatVideosConnect to CongressHealthConsumerTechnologyAmazing AmericaTrafficElectionAcademic All-StarArmstrong Army StrongChime InInside Your WorldCommunity HeroesSoarBeyond The PodiumQuestion of the DayPet of the WeekSpotlight on AmericaFor Pet's SakeHealthy HomeFull Measure with Sharyl AttkissonDid You Know?Addicted AmericaCrisis in the ClassroomWeatherDown ArrowWeather HomeRadarMapsHurricane TrackerClosuresKeith's Big FishFlight StatusSki ReportCamerasStationDown ArrowStation HomeContactKLEW StaffCareersScheduleContests2016 KLEW Best of the West WinnersSinclair CaresPartner Spotlight2017 Best of the West Winners2018 Best of the West WinnersNewsletter Sign UpSportsDown ArrowSports HomeExtrasProfessionalCollegePrep AthleteScoreboardPrep SportsTICKETSCity GuideGame CenterDown ArrowGame Center HomeDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchMoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsLegalDown ArrowTerms & ConditionsCopyright NoticesEEO Public File ReportFCC InfoFCC ApplicationsPublic File AssistanceContactNews TeamCareersConteststwitter iconfacebook iconACCESSIBILITYArmstrong Williams Town HallArmstrong Williams takes on the news of the week and asks the questions you want answered. Don’t miss our weekly town hall!WATCHClose11Please ensure Javascript is enabled for purposes of website accessibilityTrump administration tries to break through lock-in effect with 'portable mortgages'by AUSTIN DENEAN | The National News DeskFri, November 14, 2025 at 9:47 AM4VIEW ALL PHOTOSFILE - A for sale sign stands outside a home on the market in the Alamo Placita neighborhood Tuesday, Aug. 27, 2024, in central Denver. (AP Photo/David Zalubowski, File)Comment on this story0CommentShare storySharetopics: Mortgage ratesPortable mortgagesHousing affordabilityLock-in effectHomeownershipHousing supplyMortgage-backed securitiesTariffsWASHINGTON (TNND) — The Trump administration is considering another method to bring down soaring housing costs through mortgage rates that are pricing people out of homeownership and keeping homes from coming onto the market.Federal Housing Finance Agency director Bill Pulte said the administration is “actively evaluating “portable mortgages,” which would allow homebuyers to take their mortgage rate with them when they decide to move. The proposal is a direct bid to confront the so-called “lock-in effect,” where homeowners are unwilling or unable to part with their lower mortgage rate and keeping their home off the market.Many homeowners were able to buy or refinance during the pandemic for ultra-low rates at or below 3%, which cuts hundreds of dollars off a monthly mortgage payment. Rates have been stuck between 6 to 7% for the last several years, creating a barrier for homeowners to put their homes up for sale as they don’t want to take up a new loan at higher rates. More than half of homeowners with a mortgage have a rate below 4%, according to Redfin.Homes are changing hands at the lowest rate in decades in 2025 in a market that has been in a standstill for years as mortgage rates climbed and economic uncertainty set in. A Redfin analysis found only 2.8% of homes in the U.S. have turned over to a new owner in 2025.“Buyers are walking away from deals more often, sometimes due to affordability issues and sometimes because they’re re-evaluating whether now is the right moment to commit,” Redfin head of economic research Chen Zhao said in a release. “Others aren’t even shopping, waiting instead for prices or mortgage rates to come down. On the other side, many sellers are staying put—either because they’re locked into low rates or unwilling to accept offers below expectations.”Allowing people to take their mortgage rate with them to a new property could help boost the supply of existing homes on the market if more homeowners are willing to move with their lower rate.But it could also come with higher list prices as more people enter a market with a limited pool of homes available to buy. Homeowners would also have an advantage on bidding compared to a new buyer who is working with today’s rates with more wiggle room in their budgets.“Anyone able to ‘port’ a 3% mortgage into a new purchase would effectively be bidding with cheap financing in a 6% world. That added purchasing power would push prices up, while renters and mortgage-free owners would still face today’s higher rates—only now with even higher list prices,” Jake Krimmel, a senior economist at Realtor.com, wrote in an analysis.Portable mortgages could also disrupt the U.S. mortgage system and lead to higher rates. Mortgage-backed securities, groups of mortgages that lenders sell to investors, would have their pricing models blown up and create more risk for investors as less loans are paid off early with more homeowners taking them with them when they move.Pulte has also said officials are evaluating a plan to offer 50-year mortgages and how to make mortgages assumable, where homebuyers could take over a seller’s preexisting loan. Assumable mortgages are already available in the U.S. but are rarely used because they require a large cash payment or a second mortgage at current rates.The 50-year mortgage could lower monthly payments by stretching out the term of the loan but would also likely come with higher rates and would ultimately cost buyers more in interest over the life of the loan and make it take longer to build equity.The administration’s efforts to lower housing costs come as an increasing slice of Americans are being priced out of the market altogether with elevated mortgage rates and consistently growing list prices. Home values have climbed significantly compared to before the pandemic for both new and existing homes amid a lack of sufficient supply.A shortage of homes is widely seen as the biggest issue when it comes to tackling housing affordability in the United States. Construction cratered in the aftermath of the 2008 financial crisis and has struggled to recover to a sufficient level to meet the demand.Housing starts have slumped in 2025 as builders confront cost challenges and a stalled market. Higher rates are also a challenge for construction, which is also impacted by the rising cost of labor and materials.Tariffs have been a double blow for builders, as the uncertainty around them has chilled activity in the housing market and broader economy. Import taxes have also increased the cost of materials used to build homes, making it more expensive for builders to start and complete projects.Tariffs that went into effect last month imposed a 10% tax on all timber and lumber imports, along with a 25% tariff on kitchen cabinet and furniture. The U.S. imports about one-third of its lumber, primarily from Canada, that are also subject to further tariffs.TrendingIdaho Group Pushes Bill to Name State Highway After Charlie KirkA proposal is in the works in the Idaho Legislature to rename State Highway 16 the &ldquo;Charlie Kirk Memorial Highway.&rdquo; The push comes from the Idaho Family Policy National gas prices steady at $3.03The national average price of gasoline is unchanged in the last week, averaging $3.03/g today. The national average is down 2.0 cents per gallon from a month aNonresident tags, strategic plan update headline Idaho Fish and Game commission meeting LEWISTON, ID &mdash; Following their public hearing, Idaho Fish and Game held their official commission meeting last week, and the topics discussed ranged from the adJudge dismisses indictments against James Comey, Letitia JamesU.S. District Judge Cameron McGowan Currie determined Lindsey Halligan's appointment as U.S. Attorney for the Eastern District of Virginia was illegal.\nLewiston Bengals gear up for promising basketball season with returning key talentsLewiston Bengals gear up for promising basketball season with returning key talentsNEWS IN PHOTOS:\"Local\"3LCSC unveils new workforce training location in Lewiston5Photos: Lewiston Firefighters bring down IdaVend building6Goncalves family sues WSU over Bryan Kohberger's troubling behavior before murders7Idaho community remembers four students on third anniversary of tragic murdersACCESSIBILITYDownload Our Mobile Apps:Terms & ConditionsCopyright NoticesEEO Public File ReportFCC InfoFCC ApplicationsPublic File AssistanceContactNews TeamCareersContestsNewsWeatherSportsGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1615, "success": true}