{"full_text": "Trump administration tries to break through lock-in effect with 'portable mortgages'NewsNewsSCDOT to close bridge over Cedar Creek in Lexington CountySCDOT will close the Cedar Creek Road bridge over Cedar Creek in Lexington County for repairs starting in December.The road closure will begin on December 1 and TNT Lister of the Harlem Globetrotter's dribbles her way into the Midlands Get ready to celebrate a century of fun, laughs and basketball as the Harlem Globetrotters comes to the Capital City for their historic tour.The group is celebrParents charged after two children injured in accidental shootingTwo parents have been arrested after two children were injured in an accidental shooting at a residence off Wilson Road, just outside the City of Newberry, accoGov. McMaster hosts annual tree lighting at SC StatehouseGovernor Henry McMaster and First Lady Peggy McMaster will mark the start of the holiday season Sunday with the 59th Annual Governor’s Carolighting at the SouthLocalWACHFOX InvestigatesNation & WorldConnect To CongressEntertainmentElectionLocal RacesArmstrong Army StrongInside Your WorldAmazing AmericaQuestion of the DaySpotlight on AmericaBeyond the PodiumOffbeatHealthy HomeFull Measure with Sharyl AttkissonCrisis in the classroomWeatherCurrent WeatherColumbiaPartly Cloudy70F73/50Today73/50Tuesday77/63Wednesday74/39Latest WeathercastLatest WeathercastRadarMapsClosingsHurricane CenterskyWACH Weather BlogWeather SchoolskyWACH Weather 101South Carolina: Mercury RisingSportsSportsGamecocks Score Staley-Era Record 121 Points vs QueensJoyce Edwards scored 25 points and Ta’Niya Latson 24 to lead No. 2 South Carolina to its most points in coach Dawn Staley’s 18 seasons with a 121-49 romp over QWolves Roll To 45-24 Victory In First Round Of NCAA Division 2 PlayoffsNewberry College (10-1) won their eighth consecutive game and broke Kentucky State's eight-game winning streak with a 45-24 victory in the first round of the NCBenedict Stuns Wingate On Last Second Play, 25-24In one of the wildest finishes in all of college football action on Saturday, the Benedict College Tigers stunned the Wingate Bulldogs on a last-second touchdowClemson Defeats Furman, 45-10Clemson (6-5) raced out to a 31-0 lead in the middle of the second quarter and honored its seniors in style with a 45-10 win over Furman (6-6). Clemson compiledSportsZoneHigh SchoolMore SportsHighschool HoopsClemson TigersUSC GamecocksCarolina PanthersFriday Night RivalsTICKETSSoccerCity GuideFeaturesFeaturesJon Gosselin married Stephanie Lebo in intimate Pennsylvania wedding: were his kids there?Jon Gosselin is a married man again! The \"Jon & Kate Plus 8\" alum said \"I do\" to Stephanie Lebo on Sunday, Nov 23, according to Entertainment Tonight.Woman found alive in coffin before cremation at Thai templeThe woman had been bedridden for about two years, and recently appeared to stop breathing and became unresponsive. US ready to launch more operations against VenezuelaThe U.S. is ready to launch more operations against Venezuela this week, Reuters reported over the weekend.Lizzo reveals she was 'suicidal' at the beginning of her weight loss journeyLizzo was in a low place at the start of her weight loss journey, feeling \"suicidal\" after a public scandal, all of which she channeled into healthier habits.Share Your HolidayLifestyle MattersMoneyWACHMiss South CarolinaOn PointSinclair CaresCarolina ChampionPartner SpotlightBlack History HonorsFor Pet's SakeTuesday TailsThe Opioid CrisisFriday Night RivalsCarolina ShowcaseArts WACHMarket MakersMUSC Medical WACHSC LAW 101Legal MattersPalmetto PatriotsPay It ForwardConnect to the CapitolGame CenterGame CenterDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchWatchLiveNow70°Tue77°Wed75°SearchSearchUser IconWatchSearchNewsDown ArrowLocalWACHFOX InvestigatesNation & WorldConnect To CongressEntertainmentElectionLocal RacesArmstrong Army StrongInside Your WorldAmazing AmericaQuestion of the DaySpotlight on AmericaBeyond the PodiumOffbeatHealthy HomeFull Measure with Sharyl AttkissonCrisis in the classroomWeatherDown ArrowWeather HomeRadarMapsClosingsHurricane CenterskyWACH Weather BlogWeather SchoolskyWACH Weather 101South Carolina: Mercury RisingSportsDown ArrowSports HomeSportsZoneHigh SchoolMore SportsHighschool HoopsClemson TigersUSC GamecocksCarolina PanthersFriday Night RivalsHighlightsGame ReplaysScholar AthletesTICKETSSoccerCity GuideFeaturesDown ArrowFeatures HomeShare Your HolidayLifestyle MattersMoneyWACHMiss South CarolinaOn PointSinclair CaresCarolina ChampionPartner SpotlightBlack History HonorsFor Pet's SakeTuesday TailsThe Opioid CrisisFriday Night RivalsHighlightsGame ReplaysScholar AthletesCarolina ShowcaseArts WACHMarket MakersMUSC Medical WACHSC LAW 101Legal MattersPalmetto PatriotsPay It ForwardConnect to the CapitolGame CenterDown ArrowGame Center HomeDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord SearchMoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsChime InTrafficDown ArrowTraffic HomeMapNewsletter Sign UpOur StationDown ArrowOur Station HomeAdvertise with UsScheduleContactPeopleContestsCareersTermsEEOPrivacyCopyrightNewsletter Sign UpLegalDown ArrowTerms & ConditionsCopyright NoticesEEO Public File ReportFCC InfoFCC ApplicationsPublic File AssistanceContactNews TeamCareersConteststwitter iconfacebook iconACCESSIBILITYPlease ensure Javascript is enabled for purposes of website accessibilityTrump administration tries to break through lock-in effect with 'portable mortgages'by AUSTIN DENEAN | The National News DeskFri, November 14, 2025 at 12:47 PM4VIEW ALL PHOTOSFILE - A for sale sign stands outside a home on the market in the Alamo Placita neighborhood Tuesday, Aug. 27, 2024, in central Denver. (AP Photo/David Zalubowski, File)Comment on this story0CommentShare storySharetopics: Mortgage ratesPortable mortgagesHousing affordabilityLock-in effectHomeownershipHousing supplyMortgage-backed securitiesTariffsWASHINGTON (TNND) — The Trump administration is considering another method to bring down soaring housing costs through mortgage rates that are pricing people out of homeownership and keeping homes from coming onto the market.Federal Housing Finance Agency director Bill Pulte said the administration is “actively evaluating “portable mortgages,” which would allow homebuyers to take their mortgage rate with them when they decide to move. The proposal is a direct bid to confront the so-called “lock-in effect,” where homeowners are unwilling or unable to part with their lower mortgage rate and keeping their home off the market.Many homeowners were able to buy or refinance during the pandemic for ultra-low rates at or below 3%, which cuts hundreds of dollars off a monthly mortgage payment. Rates have been stuck between 6 to 7% for the last several years, creating a barrier for homeowners to put their homes up for sale as they don’t want to take up a new loan at higher rates. More than half of homeowners with a mortgage have a rate below 4%, according to Redfin.Homes are changing hands at the lowest rate in decades in 2025 in a market that has been in a standstill for years as mortgage rates climbed and economic uncertainty set in. A Redfin analysis found only 2.8% of homes in the U.S. have turned over to a new owner in 2025.“Buyers are walking away from deals more often, sometimes due to affordability issues and sometimes because they’re re-evaluating whether now is the right moment to commit,” Redfin head of economic research Chen Zhao said in a release. “Others aren’t even shopping, waiting instead for prices or mortgage rates to come down. On the other side, many sellers are staying put—either because they’re locked into low rates or unwilling to accept offers below expectations.”Allowing people to take their mortgage rate with them to a new property could help boost the supply of existing homes on the market if more homeowners are willing to move with their lower rate.But it could also come with higher list prices as more people enter a market with a limited pool of homes available to buy. Homeowners would also have an advantage on bidding compared to a new buyer who is working with today’s rates with more wiggle room in their budgets.“Anyone able to ‘port’ a 3% mortgage into a new purchase would effectively be bidding with cheap financing in a 6% world. That added purchasing power would push prices up, while renters and mortgage-free owners would still face today’s higher rates—only now with even higher list prices,” Jake Krimmel, a senior economist at Realtor.com, wrote in an analysis.Portable mortgages could also disrupt the U.S. mortgage system and lead to higher rates. Mortgage-backed securities, groups of mortgages that lenders sell to investors, would have their pricing models blown up and create more risk for investors as less loans are paid off early with more homeowners taking them with them when they move.Pulte has also said officials are evaluating a plan to offer 50-year mortgages and how to make mortgages assumable, where homebuyers could take over a seller’s preexisting loan. Assumable mortgages are already available in the U.S. but are rarely used because they require a large cash payment or a second mortgage at current rates.The 50-year mortgage could lower monthly payments by stretching out the term of the loan but would also likely come with higher rates and would ultimately cost buyers more in interest over the life of the loan and make it take longer to build equity.The administration’s efforts to lower housing costs come as an increasing slice of Americans are being priced out of the market altogether with elevated mortgage rates and consistently growing list prices. Home values have climbed significantly compared to before the pandemic for both new and existing homes amid a lack of sufficient supply.A shortage of homes is widely seen as the biggest issue when it comes to tackling housing affordability in the United States. Construction cratered in the aftermath of the 2008 financial crisis and has struggled to recover to a sufficient level to meet the demand.Housing starts have slumped in 2025 as builders confront cost challenges and a stalled market. Higher rates are also a challenge for construction, which is also impacted by the rising cost of labor and materials.Tariffs have been a double blow for builders, as the uncertainty around them has chilled activity in the housing market and broader economy. Import taxes have also increased the cost of materials used to build homes, making it more expensive for builders to start and complete projects.Tariffs that went into effect last month imposed a 10% tax on all timber and lumber imports, along with a 25% tariff on kitchen cabinet and furniture. The U.S. imports about one-third of its lumber, primarily from Canada, that are also subject to further tariffs.TrendingBreak-in at SC food bank, essential goods stolenA South Carolina food bank said thousands of dollars' worth of canned and nonperishable goods were stolen after its storage area was broken into on Sunday.Midlands church spreads Thanksgiving cheer with 1,000 dinners for Columbia familiesOne thousand Thanksgiving dinners, including turkeys, were handed out across Columbia on Saturday thanks to a major effort by a Midlands church.After raising neRain showers expected before ThanksgivingSkies stay mostly clear through this afternoon, with highs trending slightly cooler than yesterday in the upper 60s to lower 70s.Parents charged after two children injured in accidental shootingTwo parents have been arrested after two children were injured in an accidental shooting at a residence off Wilson Road, just outside the City of Newberry, accoSCDOT to close bridge over Cedar Creek in Lexington CountySCDOT will close the Cedar Creek Road bridge over Cedar Creek in Lexington County for repairs starting in December.The road closure will begin on December 1 andNEWS IN PHOTOS:\"Local\"5Gov. McMaster hosts annual tree lighting at SC Statehouse3Greg's Groceries packs 300 boxes with food for families in need3Staying beautiful to start the work week4Sunny skies and slightly cooler to end the weekendACCESSIBILITYTerms & ConditionsCopyright NoticesEEO Public File ReportFCC InfoFCC ApplicationsPublic File AssistanceContactNews TeamCareersContestsNewsWeatherSportsContestsGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1732, "success": true}