{"full_text": "BusinessPolicyIncreasing Housing Affordability By Cutting Crime, Indexing Cap GainsByPatrick Gleason,Contributor.Forbes contributors publish independent expert analyses and insights. I cover the intersection of state & federal policy and politics. Follow AuthorSep 30, 2025, 10:56pm EDTSep 30, 2025, 11:00pm EDTShareSaveEnding taxation of inflationary capital gains, reforms that strengthen property rights, and public safety measures that reduces crime, together could all help rectify the housing affordability crisis.gettyNorth Carolina lawmakers returned to Raleigh last week to pass House Bill 307, a reform package referred to by many as “Iryna’s Law” in honor of the Ukrainian refugee who was murdered on a Charlotte light rail train in August. As the Carolina Journal reported shortly after the bill received final passage on September 24, “HB 307 tightens pretrial conditions for the release of violent offenders, eliminates cashless bail, establishes a new protocol for ordering mental health evaluations in the criminal justice system, and sets a firmer timeline for appeal in death penalty cases.”“For too long, activist judges and magistrates have turned dangerous criminals loose, endangering lives and spreading chaos in our communities,” said North Carolina House Speaker Destin Hall (R) following the passage of HB 307, which Governor Josh Stein (D-N.C.) is still considering. “That ends now. Iryna Zarutska’s murder is a tragic reminder of what’s at stake. That’s why we are delivering some of the strongest tough-on-crime reforms in North Carolina history.”“The bill eliminates cashless bail for certain offenses, restricts judicial discretion in granting pretrial release, and creates a new category of ‘violent offenses’ requiring GPS monitoring, house arrest, or secured bond for those accused,” noted the Carolina Journal. “It also mandates mental health evaluations in specific cases, tightens deadlines on death penalty appeals, and adds committing a capital felony on public transportation to the list of aggravating factors that can make a defendant eligible for the death penalty. Republican leaders say the changes are designed to ensure violent and repeat offenders remain off the streets while holding magistrates more accountable for release decisions.”Reforms to reduce crime and increase public safety are a high priority for the White House and in many statehouses beyond North Carolina. While North Carolina’s HB 307 and similar proposals elsewhere aim to reduce crime, a less advertised benefit of such reforms, some influential voices are noting, is that they make affordable housing stock that was previously unsuitable for many households a viable option for families. Palmer Luckey, the tech titan who founded Oculus VR and Anduril Industries, recommended in an August 18 post on X that the “fastest way to lower average housing prices in American cities is enforcing the law/reducing criminal activity.”“Huge chunks of high-density housing are trapped in Bad Neighborhoods, no-go zones depressed well below nearby prices,” Luckey added. “Nobody with options even considers them.”Chris DeRose, an Arizona real estate developer who previously served as senior counsel to the state attorney general, says Luckey is “absolutely accurate.” “The best zoning reform couldn’t add housing nearly this fast,” he added.MORE FOR YOULeading politicians across the country, in both blue and red states, speak frequently about the historically high cost of housing and proposals that make housing more affordable, particularly for young and working class families. That talk has been accompanied by action in some states, with lawmakers in a number of red and blue states passing deregulatory reforms in recent years aimed increasing the supply of housing and reducing its cost to households. As the Pew Foundation recently highlighted, reforms that strengthen property rights and allow more housing to be built have helped alleviate rising rents and home prices in fast-growing cities like Raleigh, Austin, Nashville, and Denver. Locally-enacted reforms that strengthen property rights, as well as state preemption of local zoning restrictions that impede or block the development of new housing, are permitting the number of housing units to grow faster than would otherwise be the case in many places. Yet there are still a number of other ways in which federal, state, and local lawmakers can take action to make housing more affordable. Some housing cost mitigation proposals are less intuitive than the zoning reforms and property tax relief bills that lawmakers have pursued in recent months and years. One such proposal, which is currently being considered by the White House and congressional leaders for inclusion in the next reconciliation package, is the indexation of capital gains for inflation.Setting aside that fact that nobody is in a place to determine how big or small of a house another person or family needs, many baby boomers continue to reside in houses whose size exceeds their perceived needs for a host of reasons. Michael Batnick and Ben Carlson, professional wealth managers who cohost the podcast Animal Spirits, recently discussed the backlash and anti-baby boomer sentiment generated online in response to a recent survey finding that “61% of boomers never plan to sell their homes.”“Why would they?,” Batnik asked rhetorically, pointing out that there is no logical reason that freeing up housing stock for younger buyers should be a motivating factor for older homeowners to put their house on the market. “What are they supposed to do?,” Carlson added, “where are they supposed to go?”Batnik and Carlson are correct that it’s irrational for lawmakers or anyone to expect baby boomers, or home owners of any age, to sell a house that they still like living in, and in many cases own outright, just so strangers can have a chance to live there. Indexing capital gains for inflation, however, creates a significant financial incentive for older homeowners who might not otherwise consider downsizing or capitalizing on a long held asset that has appreciated greatly over two or three decades.Since inflation accounts for a considerable share, in some cases most of the gain in the value of homes that many baby boomers have been in for decades, indexing capital gains for inflation would significantly reduce the tax owed when baby boomers go to sell their house. Creating such a strong incentive for empty-nesters to downsize would help free up housing stock that is well suited for younger and larger families‘Inflation Tax’ On Homes Contributes To The U.S. Housing Affordability Crisis“The fact is, Boomers with smart financial advisors won’t sell their empty nester family homes due to the taxes they would pay—much of it on merely inflationary gains,” says Ryan Ellis, an IRS-enrolled agent who runs a tax preparation firm. “They’re being advised to die still owning the homes, so that their kids can inherit them tax free and with stepped up basis. Meanwhile, Millenial and Gen Z families looking for their ‘forever homes’ have fewer options to buy. The tax code’s ‘inflation tax’ on homes is a contributor to America’s housing inventory crisis.”Indexation of capital gains for inflation would be a boon to homeowners as well as those invested in the stock market, which includes the majority of American households. Inflation accounts for a notable portion of most capital gains. In some cases, the entire gain is attributable to inflation. The lack of inflation indexing for capital gains forces many Americans to pay taxes on inflationary stock gains and even when there has been no real gain at all. In making the case for capital gains to be indexed for inflation, Americans for Tax Reform (ATR) offers the following example:“A taxpayer that purchases one share of Coca-Cola stock in 1998 would have paid $32.38 per share. Today, that share would be worth $48.13 with a gain of $15.76 and a tax liability of $3.75. However, because of inflation, the value of a dollar in 1998 is worth $1.56. The inflation adjusted value of the stock is therefore $50.50 and the taxpayer has an inflation adjusted loss of $2.38.”Some leading Democrats used to be in favor of indexing capital gains for inflation. “If we really want to increase growth, there are proposals that we can do,” Senate Minority Leader Chuck Schumer (D-N.Y.), then a congressman, said in a 1992 House floor speech, adding that he “would be for indexing all capital gains and savings and borrowing.”There is contextual basis for indexing of capital gains for inflation and legal precedent indicates that such a change can be made by executive action. ATR notes that “the IRS already makes inflation adjustments for over 60 tax provisions every year including adjusting individual income tax brackets, the standard deduction, and the Earned Income Tax Credit.”“In addition, the authority to index capital gains taxes is based on existing legal precedent as outlined in legal memos (see here and here),” ATR adds. “According to these studies the cost basis of an asset when calculating the capital gains tax does not necessarily mean historical cost.”Though there is a strong case that the Trump administration can unilaterally index capital gains for inflation by administrative action, many would like to see Congress codify that change. Doing so would ensure that indexation of capital gains for inflation could not be easily undone by a future administration, providing the certainty needed for this change realize its economic growth-boosting potential.The need to rectify the housing affordability crisis remains a high priority across the U.S., particularly in the nation’s fastest growing locales. Fortunately for lawmakers seeking to address the matter, there are a broad array of reforms in the prospective policy toolkit from which to choose, many of which are complementary reforms primarily aimed at other laudable goals, such as crime reduction and tax relief. Editorial StandardsReprints & Permissions", "extraction_method": "beautifulsoup", "word_count": 1563, "success": true}