{"full_text": "Skip to Content, Navigation, or Footer.\nBREAKING:\nRay Priore steps down as Penn football head coach\nFounded in 1885\nNEWSLETTERS\nMonday, Nov. 24, 2025\nThis Week's Paper\nNews \nSports \nOpinion \nPuzzles \nMultimedia \n34th Street\nUnder the Button\nDonate\nPenn Architecture hosts panel on adaptive building reuse in cities\nThe panel discussion took place in Meyerson Hall on Oct. 29. GRACE CHEN / THE DAILY PENNSYLVANIAN\nBy COSTA GAY-AFENDULIS\nNov. 3, 2025\n\nPenn’s Architecture department hosted a panel at the Weitzman School of Design to discuss the practice of adaptively converting vacant office buildings into residential units in cities.\n\nThe Oct. 29 panel included six experts in the field with backgrounds in architecture, journalism, and finance who spoke about the benefits and considerations of applying adaptive reuse on a large scale. This practice has gained traction in recent years as a way to bring life back to central business districts following a shift to remote work that has emptied out many American downtowns and the rapidly growing demand for housing. \n\nWeitzman associate professor of practice Hina Jamelle, who also serves as the school’s urban housing director, organized the event. During the panel, she explained that there has been “a renewed attention on adaptive reuse, especially the conversion of commercial buildings into housing.”\n\nJamelle added that the event’s title, “Under Pressure”, refers to “a call for action in a timely and efficient way, because [they] realize that pressure has come to bear on certain aspects of the city.” She emphasized that the housing crisis is relevant to Penn students because “the chances are very high” that many of them are “going to be moving to an urban center” upon graduation.\n\n“Everyone needs a place to live,” she said. “We would not want cities to just be for sort of a certain asset class. You really want a city to have that engaging vibrancy of younger people coming in, new ideas coming in, and people being able to thrive.” \n\nWeitzman city and regional planning professor Vincent Reina, who worked as an urban housing policy advisor in the Biden-Harris administration, sat on the panel. He emphasized a need for “actual affordable units,” given that there is an estimated “shortage of 65,000 affordable, available housing units” in the city. \n\n“If you look at the housing stock in Philadelphia, we actually have enough housing for most households,” he said during the event. “We just don’t have enough housing for the very poor households.”\n\nIn an interview with The Daily Pennsylvanian, Reina said that solving these issues in the city “requires a real and consistent commitment from the city to address the housing needs, but particularly for the most vulnerable residents”. \n\nADVERTISEMENT\n\nReina has prior experience working with students on public housing projects in New York City, which he said “spurred” him to think about “the critical role that housing plays” in helping residents feel that they are “a part of the community.”\n\nReina told the DP that his team helped develop PHL Housing Plus, a project to rehabilitate homes for affordability, and other Philadelphia initiatives such as Rebuilding Together. \n\nArchitecture student Ryan Newbling emphasized the importance of having urban “space that really connects and drives a community, versus just having repetitive residential units,” in an interview with the DP.\n\nNewbling added that the event was also integrated into the graduate architecture program. Students had their own work “on display,” which focused on “bringing life back to urban spaces.”\n\nWall Street Journal reporter and panelist Peter Grant emphasized the historical significance of the broad evacuation of office space and why reuse is worth the investment. According to Grant, unlike downturns in office use in the late 1990s and late 2010s that ended up rebounding, “the downturn now is not cyclical, it’s structural … this is here to stay.”\n\nHowever, the panelists also discussed the complications and costs of the process of adaptive reuse. Buildings that are constructed to serve as office spaces often face fewer structural requirements than residential units — such as for included window spaces — and need expensive renovations. Grant discussed how economic factors still aren’t fully allowing this process to be implemented on a large scale everywhere. \n\n“There’s one city where you do have the necessary ingredients, and that’s New York,” Grant said during the event. “You have some Magic Mountain out there in New York that’s producing people who are making enough money to afford $4,000 a month rents — that’s not happening in a lot of these other markets.”\n\nThe panelists provided examples of proposed and completed reuse projects in a wide range of cities, like Chicago, New York, Baton Rouge, La., and Providence, R.I.\n\nReina concluded that adaptive reuse is “a really important piece” of solving the housing crisis. \n\n“Can you actually solve our housing supply problems with these conversions? I think no,” Reina said. “But you add a really important piece to our puzzle — to our many tools that we need to actually address our housing supply needs and community issues.”\n\nThe Daily Pennsylvanian is an independent, student-run newspaper. Please consider making a donation to support the coverage that shapes the University. Your generosity ensures a future of strong journalism at Penn.\n\nDONATE\nMORE LIKE THIS\nPenn professor publishes new book discussing use of proxies to model past climates\nBY RYAN RUCKER · 22 HOURS AGO\nSNF Paideia Program hosts University Chaplain to discuss book on ‘uncovering’ life paths\nBY RACHEL ERHAG · 22 HOURS AGO\nKelly Writers House hosts poetry editor to discuss book of collected letters\nBY SAMANTHA DASIKA · 22 HOURS AGO\nPenn deploys heavy police presence near campus in advance of 40th Street ‘link up' that drew hundreds of youth\nBY PHOEBE ANAGNOS · 22 HOURS AGO\nHundreds of Penn affiliates sign petition against lawsuit seeking names of Jewish employees, students\nBY ISHA CHITIRALA · 22 HOURS AGO\nPenn sees slight rise in international student enrollment despite national downturn\nBY CANDICE FELDERER · 22 HOURS AGO\nMOST READ\n1\nPenn alum-owned restaurant becomes first in Philadelphia to win a Michelin star\nBY ARTI JAIN · NOV. 20, 2025\n2\nPenn employee Meaza Brown killed in hit-and-run\nBY ISHA CHITIRALA · NOV. 21, 2025\n3\nPenn graduate student union overwhelmingly authorizes strike as contract negotiations continue\nBY DANIYA SIDDIQUI AND SANDY WALLS · NOV. 21, 2025\n4\nTed Kwee-Bintoro | Penn must act now\nBY TED KWEE-BINTORO · NOV. 20, 2025\n5\nPenn institutes mandatory information security training for all employees following data breach\nBY RIANA MAHTANI · NOV. 21, 2025\n6\nState Dept. memo says Penn shows 'no evidence of DEI' in hiring, reaffirms research partnership\nBY ANVI SEHGAL · NOV. 20, 2025\n7\nPenn Board of Trustees amends bylaws to reduce board size, establish member removal process\nBY ISHA CHITIRALA · NOV. 21, 2025\n8\nPenn lecturer Buzz Bissinger served as uncredited collaborator on Sen. John Fetterman’s memoir\nBY ALEX DASH · NOV. 20, 2025\n9\nPenn-owned storefront vacancy rates align with citywide trends, University says\nBY JOSÉ CARLOS SERRANO AND PHOEBE ANAGNOS · NOV. 20, 2025\n10\nPenn men’s basketball headed to Big 5 championship game after 84-68 win at Drexel\nBY JAVIER ST. REMY · 2 DAYS AGO\nPENN CONNECTS\nAbout\nSponsored Content\nAbout Us\nArchives\nStaff\nAdvertise\nCreative Agency\nDonate\nBusiness\nAlumni Association\nPrivacy Policy\nTerms of Service\nContact Us\nNews\nAcademics\nAdministration\nAdmissions\nIdentities\nScience & Health\nPolitics\nPhiladelphia\nStudent Life\nData\nBusiness\nNews Tips\nSports\nBaseball\nSoftball\nMen's Lacrosse\nWomen's Lacrosse\nMen's Tennis\nWomen's Tennis\nTrack & Field\nSports Administration\nOpinion\nOpinion Columns\nGuest Columns\nStaff Editorials\nOpinion Submissions\nPuzzles\nCrosswords\nNews Quiz\nMini Crosswords\nPassword\n34th Street\nFeatures\nFocus\nEgo\nFilm & TV\nMusic\nArts\nStyle\nMultimedia\nWord on the Street\nStreet Sweeper\nUnder the Button\nNews\nOpinion\nVideo\nProjects\nCopyright © 2025 The Daily Pennsylvanian, Inc. All rights reserved.\nPowered by  Solutions by The State News", "extraction_method": "jina", "word_count": 1310, "success": true}