{"full_text": "Skip to main content\nEnable accessibility for low vision\nOpen the accessibility menu\nSkip to content\nSelect Region or Brand\nManage Account\nSign In\nUpcoming Event\n\nPHENOMS AND ICONS\n\nFREE NEWSLETTER\nSUBSCRIBE\nNews\nEvents\nProject Center\nSub-Bid Requests\nPublic Notices\nLeads & Data Center\nPress Releases\nAdvertising\nHome\n>\nNews\n>\n\nU.S. metro areas seeing more transit-oriented housing projects\n\nA woman walks her dog past the Pok Oi Residences in Boston’s Chinatown neighborhood. The apartment complex is within walking distance of the subway and bus stops. (Charles Krupa/The Associated Press)\n\nU.S. metro areas seeing more transit-oriented housing projects\n\nThe Associated Press//November 24, 2025//  \n\nListen to this article\nAT A GLANCE:\nTransit-oriented housing offers affordable units near bus, rail and subway lines\nCities like Los Angeles, Boston and Washington, D.C. are gaining developments\nStates adopt zoning reforms to allow more dense housing near transit\nChallenges include local opposition, funding gaps and rising construction costs\n\nBOSTON — After years of living on the street and crashing on friends’ couches, Quantavia Smith was given the keys to a Los Angeles studio apartment that came with an important perk — easy access to public transit.\n\nThe 38-year-old feels like she went from a life where “no one cares” to one where she has a safe place. And the metro station the apartment complex was literally built upon is a lifeline as she searches for work without a car.\n\n“It is more a sense of relief, a sense of independence,” said Smith, who moved into the unit in July. She receives some government assistance and pays 30 percent of her income for rent — just $19 a month for an efficiency apartment with a full-market value of $2,000.\n\n“Having your own space, you feel like you can do anything,” she said.\n\nMetro areas from Los Angeles to Boston have taken the lead in tying new housing developments to public transit, often teaming up with developers to streamline the permitting process and passing policies that promote developments that include a greater number of units.\n\nBuilding housing near public transit helps energize neglected neighborhoods and provide affordability, city officials say, while ensuring a steady stream of riders for transit systems and cutting greenhouse gas emissions by reducing the number of cars on the road.\n\n“Transit-oriented development should be one of, if not the biggest solution that we’re looking at for housing,” said Urban Institute Land Use Lab research director Yonah Freemark, who has written extensively on the topic. “It takes advantage of all of this money we’ve spent on transportation infrastructure. If you build the projects and don’t build anything around the areas near them, then it’s kind of like money thrown down the drain.”\n\nThe Santa Monica and Vermont Apartments, where Smith lives, is part of an ambitious plan by the Los Angeles County Metropolitan Transportation Authority to build 10,000 housing units near transit sites by 2031 — offering developers land discounts in exchange for affordable housing development and other community benefits.\n\nIn Washington, D.C., the transit authority since 2022 has completed eight projects that provided nearly 1,500 apartments and a million square feet of office space. About half were in partnership with Amazon, which committed $3.6 billion in low-cost loans and grants for affordable housing projects in Washington, as well as Nashville, Tennessee, and the Puget Sound area in Washington state. Almost all are within a half-mile of public transit.\n\n“Big cities face the greatest challenges when it comes to traffic congestion and high housing costs,” Freemark said. “Building new homes near transit helps address both problems by encouraging people to take transit while increasing housing supply.”\n\nIn Boston, the Pok Oi Residents in Chinatown is a 10-minute walk to the subway and a half-dozen bus stops. That’s a draw for Bernie Hernandez, who moved his family there from a Connecticut suburb after his daughter was accepted into a Boston university.\n\n“The big difference is commuting; you don’t need a car,” said Hernandez, who said he can walk to the grocery story and pharmacy. His 17-year-old daughter takes the subway to school. Now, his car mostly sits idle, saving him money on gas and time spent in traffic.\n\n“You get to go to different places very quickly,” Hernandez said. “Everything is convenient.”\n\nStates across the country are passing laws targeting restrictive zoning regulations that for decades prohibited multifamily construction and contributed to housing shortages.\n\nLast month, California Gov. Gavin Newsom signed a state law allowing taller apartment buildings on land owned by transit agencies and near bus, train and subway lines.\n\n“Building more homes in our most sustainable locations is the key to tackling the affordability crisis and locking in California’s success for many years to come,” said state Sen. Scott Wiener, who authored the bill.\n\nCalifornia joins Colorado, which requires cities to allow an average of 40 housing units per acre within a quarter-mile of transit, and Utah, which mandates about 50 units per acre. In Washington, the governor this year signed a bill allowing taller housing developments in mixed-use commercial zones near transit.\n\n“We want to ensure that there are mixed-income, walkable, vibrant homes all around those transit investments and that people have the option of using cars less to improve the environmental health of our communities,” said Rep. Julia Reed, who authored the Washington bill. “It’s about giving people the opportunity to drive less and live more.”\n\nMassachusetts Gov. Maura Healey has made housing a priority. Among her most potent tools is a 2021 law that requires 177 towns or communities nearby to create zoning districts allowing multifamily development. The state provided nearly $8 million to more than 150 communities to help create these zones and threatened to cut funding for those that don’t. More than 6,000 housing units are in development as a result.\n\n“You put housing nearby public transit (and) it’s great for people,” Healey said. “They can literally get up, leave their home, walk to a commuter rail and get to work.”\n\nAmong the first to comply was Lexington, which has approved 10 projects, including a $115 million complex with 187 housing units and retail space.\n\nWalking past earth-moving equipment and dump trucks at the construction site earlier this year, project manager Quinlan Locke said: “This is a landscape yard. It’s commercial. It’s meant for trucking. Two years from now, it’s going to be meant for people who live here, work here and play here. This is going to become someone’s home.”\n\nSome advocates argue the lofty goals of transit-oriented housing are falling short due to fierce local resistance and lack of funding and support at the federal and state levels.\n\nHigher mortgage interest rates, more government red tape, rising construction costs and lack of investment at transit stations also have contributed to a troubling trend — nine times more housing units built far from public transit versus near it in the past two decades, according to a 2023 Urban Institute study.\n\nIn Massachusetts, 19 communities still haven’t created new zones. Some unsuccessfully sued the state to halt the law, while residents rejected new zones in others. Lexington eventually shrank its zone from 227 acres to 90 acres after residents complained.\n\n“If we allow the state to come in and dictate how we zone, what else are they going to come in and dictate?” said Anthony Renzoni, a selectman from the town of Holden, which sued the state and is drawing up a new zoning map after residents rejected the first one.\n\nIn Los Angeles, the six-story complex where Smith lives in East Hollywood is home to 300 new residents since opening in February. The area has gained a Filipino grocery and a medical clinic. A farmers market is set to open early next year.\n\nHalf of the building’s 187 units are reserved for formerly homeless residents like Smith, who had been living in a rundown motel via a voucher and before that on the street. She’s been assigned a case worker and is getting help with basic life skills, budgeting and finding work.\n\nEqually important: Smith, who can’t afford a car, doesn’t need one.\n\n“I’m very, very fortunate to be somewhere where the transit takes me where I want to go,” she said. “Where I want to go is not that far.”\n\nTags: Affordable housing,Boston housing,California housing law,Homelessness solutions,Los Angeles housing,Mixed-use development,Public transit,Transit-oriented development,Urban planning,Zoning reform\n\nRelated Articles\nYears after deadly fire, London tower to be taken down\nWorld’s oldest operating drive-in theater revived\nWith Kabul finally at peace, luxurious homes gain appeal\nWest Linn multifamily property fetches $33.6 million\nWaterfront Park bowl redevelopment in Portland land use review intakes | Nov. 17, 2025\nRelated Content\nWindsor Engineers expands into Portland\n\nWindsor Engineers has opened its newest office in Portland.\n\nNovember 24, 2025\n\n$40.8 million multifamily project in Portland building permits | Nov. 24, 2025\n\nA new construction permit is under inspection for construction of the Jamii Court Apartments on Southwest Barb[...]\n\nNovember 24, 2025\n\nIn-N-Out restaurant project in Portland land use review intakes | Nov. 24, 2025\n\nA type 2 procedure (adjustment) is pending for development of a burger restaurant with drive-thru service on N[...]\n\nNovember 24, 2025\n\nData center projects fuel scrutiny of power forecasts\n\nUtilities predict soaring electricity demand from data centers, raising concerns about speculative forecasts, [...]\n\nNovember 21, 2025\n\nPacific Northwest projects totaling $65.1 million in top bidders | Nov. 21, 2025\n\nThe Oregon Department of Transportation is preparing to award a $4.9 million contract for construction of curb[...]\n\nNovember 21, 2025\n\nPortland bans use of rental pricing algorithms\n\nThe Portland City Council on Wednesday passed a measure that bans corporate landlords from using rent-fixing p[...]\n\nNovember 20, 2025\n\nDJC Oregon Daily Newsletter\n\nSign up for your daily digest of DJC Oregon Daily News.\n\nEmail: *\nIndustry\nselect your industry\nSIGN UP\nBy signing up you agree to our\nPrivacy Policy\n\n\n\n\nNews\nWindsor Engineers expands into Portland\n$40.8 million multifamily project in Portland building permits | Nov. 24, 2025\nIn-N-Out restaurant project in Portland land use review intakes | Nov. 24, 2025\nU.S. metro areas seeing more transit-oriented housing projects\nData center projects fuel scrutiny of power forecasts\nPacific Northwest projects totaling $65.1 million in top bidders | Nov. 21, 2025\nPortland bans use of rental pricing algorithms\nHood River–White Salmon bridge project wins federal OK\nHistoric district status sought for Indianapolis’ Martindale area\nAffordable housing plan on track in historic Portland district\n$1.6 million multifamily project in Portland building permits | Nov. 17, 2025\nWaterfront Park bowl redevelopment in Portland land use review intakes | Nov. 17, 2025\nSee All News\nDJC People\nPrevious\nBrooke Everard | 2FORM Architecture\n\n2FORM Architecture has hired Brooke Everard as an associate architect. She is a 2023 graduate of the[...]\n\nAlex Legé | PCS Structural Solutions\n\nPCS Structural Solutions has entered its fifth generation of leadership with the promotion of Alex L[...]\n\nTodd Parke | PCS Structural Solutions\n\nPCS Structural Solutions has entered its fifth generation of leadership with the promotion of Todd P[...]\n\nHayden Doud | Walsh Construction\n\nHayden Doud has joined Walsh Construction Co. as an assistant superintendent. He is a graduate of Or[...]\n\nSteve Rupert | Mackenzie\n\nMackenzie is pleased to announce that architect Steve Rupert is joining the firm as principal. He ha[...]\n\nJessica Glenn | Maul Foster & Alongi\n\nMaul Foster & Alongi has promoted Jessica Glenn to principal environmental scientist. She has nearly[...]\n\nRobert Hoàng | Bora Architecture & Interiors\n\nBora Architecture & Interiors has promoted Robert Điệp Hoàng to principal. He has more than 25 y[...]\n\nTaylor Schimbke | Walsh Construction\n\nTaylor Schimbke has joined Walsh Construction Co. as corporate controller. She has extensive experie[...]\n\nBrooke Everard | 2FORM Architecture\n\n2FORM Architecture has hired Brooke Everard as an associate architect. She is a 2023 graduate of the[...]\n\nAlex Legé | PCS Structural Solutions\n\nPCS Structural Solutions has entered its fifth generation of leadership with the promotion of Alex L[...]\n\nTodd Parke | PCS Structural Solutions\n\nPCS Structural Solutions has entered its fifth generation of leadership with the promotion of Todd P[...]\n\nHayden Doud | Walsh Construction\n\nHayden Doud has joined Walsh Construction Co. as an assistant superintendent. He is a graduate of Or[...]\n\nSteve Rupert | Mackenzie\n\nMackenzie is pleased to announce that architect Steve Rupert is joining the firm as principal. He ha[...]\n\nJessica Glenn | Maul Foster & Alongi\n\nMaul Foster & Alongi has promoted Jessica Glenn to principal environmental scientist. She has nearly[...]\n\nRobert Hoàng | Bora Architecture & Interiors\n\nBora Architecture & Interiors has promoted Robert Điệp Hoàng to principal. He has more than 25 y[...]\n\nTaylor Schimbke | Walsh Construction\n\nTaylor Schimbke has joined Walsh Construction Co. as corporate controller. She has extensive experie[...]\n\nBrooke Everard | 2FORM Architecture\n\n2FORM Architecture has hired Brooke Everard as an associate architect. She is a 2023 graduate of the[...]\n\nNext\nCommentary\nThe value of clearly expressing expectations up front | Opinion\nHidden but present: the impact of ‘dark matter’ in mediation | Opinion\nNavigating Oregon’s evolving wildfire mitigation standards | Opinion\nOregon rolls out program to increase housing production | Opinion\nDriving through data fog: markets shrug off blind spots | Opinion\nU.S. Supreme Court to look closely at separation of powers | Opinion\nForm I-9 made easy: compliance, audits and best practices | Opinion\nCould cultivation of curiosity be the ultimate stress buster? | Opinion\nCompleting a project after a receiver is appointed | Opinion\nA force of nature whose legacy still unites communities | Opinion\nContracting with potential litigation in mind | Opinion\nLean and integrated delivery drive speed, certainty, client value | Opinion\nSee All Commentary\nCOMMUNITY CALENDAR\nNews\nEvents\nProject Center\nSub-Bid Requests\nPublic Notices\nLeads & Data Center\nPress Releases\nAdvertising\nABOUT\n\nDJC Oregon provides 24/7 construction news coverage and events honoring top construction professionals.\n\nMY ACCOUNT\nLogin\nSubscribe\nManage Account\nGroup Subscription\nSubscriber Agreement\nCONTACT\nAbout DJC Oregon\nContact DJC Oregon\nAccessibility Statement\nADVERTISING\nAdvertising\nSolutions\nEditorial Calendar\nMarketing Guide\nNewsletter\nMedia Kit\nCONNECT\n \n \n \n \nNEWSLETTER\n\nGet our free DJC Oregon Daily News & breaking news notifications!\n\nselect your industry\nSIGN UP\nDIGITAL EDITIONS\n\nSubscribe for access to the latest digital and special editions.\n\n© 2025 BridgeTower Media. All rights reserved.\n\nUse of this website is subject to its Terms of Use | Privacy Policy | Your California Privacy Rights/Privacy Policy | Do Not Sell My Info/Cookie Policy\n\nWe use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies. However, you may visit \"Cookie Settings\" to provide a controlled consent.\nCookie settings\nAccept All\n\nEnjoy this one free article.  \n\nSubscribe for unlimited access. \n\nAlready a Subscriber?  Sign in     \n\n\t\nSUBSCRIBE", "extraction_method": "jina", "word_count": 2449, "success": true}