{"full_text": "AP\nSan Francisco mayor proposes denser housing to tackle affordability crisis\nSan Francisco Mayor Daniel Lurie is pushing to build more homes to address the city's housing crisis\nBy JANIE HAR - Associated Press\nOct 29, 2025\nOct 29, 2025\nFacebook\nTwitter\nWhatsApp\nSMS\nEmail\nFacebook\nTwitter\nWhatsApp\nSMS\nEmail\nPrint\nCopy article link\nSave\nSAN FRANCISCO (AP) — San Francisco Mayor Daniel Lurie is trying to get more homes built for people like Liam Murphy: a fifth-generation city kid who found himself repeatedly outbid for tiny two-bedroom houses that wound up selling for $1.6 million.Murphy, 39, now lives about an hour's drive away from his job as a San Francisco firefighter. He says it's too late for his family to move back, but he hopes others can stay in a city where the average monthly rent for a one-bedroom is $3,500.“That would just make for a better city overall,” said Murphy, “and the reason is because city kids just grow up being exposed to more. They're exposed to all the cultures of San Francisco, which makes a more well-rounded person.”Tiny, colorful San Francisco — just seven miles squared — embraces its image as a city that welcomes all. But its inability to build more housing has made it one of the world's toughest places to find a home, risking the diversity it prides itself on.Epithets are hurled at the mayorLurie hopes to change that, with a plan to allow for denser and taller buildings throughout much of the city, including the westside Sunset neighborhood of single-family homes and the tourist friendly Haight-Ashbury, which is studded with classic Victorian and Edwardian homes.The issue has roiled the city, and threats of recall loom over San Francisco supervisors who go along with Lurie. At a recent housing rally, the mayor who won a rare reprieve from President Donald Trump's threats to send in federal forces struggled to be heard over angry chants of “shame!” and “liar.”Protesters demanded the city invest in 100% below-market rate housing and accused him of being a gentrifier and a Republican.“I truly believe that this has San Franciscans' best interests at heart. Are some people going to be fearful? Absolutely. I get it. Change is scary,” said Lurie, who is a centrist Democrat. “But the status quo is not working. There's an affordability crisis right now.”Democrats vs DemocratsThe city's estimated 830,000 residents are passionate over both land use and equity. Housing projects have died as pressure to create more affordable units made potential developments unprofitable. Residents also want their stunning views.But San Francisco is under pressure from the state to adopt a new zoning plan allowing for 36,000 more homes by 2031 — or else the state will decide what gets built where — and the mayor likely has the votes to pass his “Family Zoning Plan.”Supporters say it's a matter of supply and demand, and that more homes will bring down the overall cost of housing.Critics say such trickle-down economics will not work in a city like San Francisco, which is in such global demand that some foreign investors buy properties sight-unseen. They say developers will only build luxury housing that's too costly for most workers, while displacing tenants and destroying the character of entire neighborhoods.“There’s a herd of elephants in the room that no one will address,” says Eric Jaye, a Democratic political consultant who opposes the plan.A city 'for people who didn’t love cities’Much of the housing push has come from Democrats, including a former city mayor, Gov. Gavin Newsom, who signed into law a proposal by San Francisco state Sen. Scott Wiener to build more homes near transit.The city has made enormous strides in recent years, with whole districts of tall condo buildings cropping up around downtown, says Rafael Mandelman, president of the Board of Supervisors. But he acknowledges that people come to San Francisco for its more intimate neighborhoods and access to green space.“San Francisco, historically, was the city for people who didn’t love cities,\" Mandelman said.Katherine Roberts, 72, initially welcomed construction of an affordable housing complex near the three-story Edwardian she labored to buy in the Haight-Ashbury neighborhood two decades ago.But at 160 units and eight stories high, the massive building has shattered her peace of mind, dominating her view.“I’m looking out and it’s like I’m living in East Germany. How can you build something this inappropriate in a historic neighborhood like the Haight-Ashbury?” Roberts said. “What about all the people who already live here? What are we supposed to do?”Proposal calls for denser homesFor the most part, the new zoning plan allows for more housing to be packed into the space of a single-family home — say a duplex with a studio — without exceeding the city's height limit of roughly four stories for such properties. At least 15% of new housing must be below-market rate.Buildings on neighborhood commercial corridors could double to eight stories. Busier thoroughfares could see high-rises of 10 stories and more, and in a few spots, on Van Ness Avenue, heights could hit 650 feet (200 meters), rivaling some downtown skyscrapers.Passage of Lurie's proposal won't necessarily lead to more homes in a city with high labor and construction costs and “notoriously complex and cumbersome\" approval processes, as the state said in a scathing 2023 review.And so city dwellers make do with overcrowded — and sometimes awkward — living situations.Laura Foote, executive director of “yes in my backyard” YIMBY Action, wound up living with the man who is now her husband — and the woman he was divorcing — in a one-bedroom apartment for about six months, until his ex could find another rental.“We didn’t kill each other,” Foote said, “but it went on longer than it would have in a well-functioning housing market.”Mayor's plan is likely to passSupervisors are still negotiating amendments to the zoning plan, which could be voted out of committee on Monday for consideration by the full board. Some supervisors want to exempt historic properties, or all buildings currently used for housing. The mayor agreed to exempt buildings with at least three rent-controlled units.The compromise was a major relief for Phyllis Nabhan, 78, who lives in the Richmond neighborhood, between the Golden Gate Bridge and Golden Gate Park. She fears becoming homeless if a developer scoops up the property she's called home for 47 years, starting with a rent of just $350 a month.But Nabhan still objects to the proposal. She says it would ruin her neighborhood's “cozy and wonderful” feel, and blames the state for forcing the city to change.“I think that this mayor is trying,” she said. “It’s a horrible job, I wouldn’t want to be mayor.”\nFeatured Local Savings\nCopyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.\nFacebook\nTwitter\nWhatsApp\nSMS\nEmail\nPrint\nCopy article link\nSave\nTags\nSan Francisco Housing\nEconomic Indicators\nPolitics\nLifestyle\nBusiness\nU.s. News\nGeneral News\nClick Here to View Ads!\nFeatured Weekly Print Ads\nTom's Painting\nBulletin\nSupport Local Journalism in Classrooms", "extraction_method": "beautifulsoup", "word_count": 1168, "success": true}