{"full_text": "Councilmember Pinto rolls out 'Prosper DC Plan' focused on jobs, housing and youthNewsNewsJury to weigh recall efforts against Purcellville, Va., vice mayor in trial set for Dec. 1After eight months of collecting signatures and waiting, Purcellville residents may soon get an answer as to whether or not Vice Mayor Ben Nett will be booted fQuincy Wilson, youngest American track and field Olympian ever, commits to MarylandQuincy Wilson, the then-16-year-old who became the youngest track and field Olympian in American history in 2024, announced his commitment to the University of Prince George's County advocates say data center still needs more researchA small but vocal group met with 7 News on Monday, right outside the old Landover Mall, which is the site of a proposed data center.Prince George’s Sheriff warns of scammers posing as deputies and stealing over $12,000The Prince George&rsquo;s County Office of the Sheriff is alerting residents to a surge in phone scams where fraudsters are posing as sheriff&rsquo;s deputies.LocalElections7News MorningsNation & WorldGood Morning WashingtonCrisis In The ClassroomEntertainmentOffbeatVideosAmazing AmericaArmstrong Army StrongBeyond The PodiumConnect To CongressInside Your WorldSoarSpotlight on AmericaTown HallQuestion of the DayFull Measure with Sharyl AttkissonDid You Know?Coronavirus VaccineAddicted in AmericaSeptember 11th: 20th Anniversary7News DroneBack to School75th AnniversaryHEALTHWJLA PollWeatherCurrent WeatherArlingtonCloudy48F57/41Today57/41Tuesday57/54Wednesday69/40Latest WeathercastLatest WeathercastCherry Blossom RadarClosingsMapsHurricane CenterLunchbox WeatherWeather camerasFirst Alert Weather BlogI TeamI TeamAir India crash rekindles whistleblowers safety concerns over Boeing's manufacturing flawsThe Dreamliner crash echoes the catastrophic 737 MAX crashes of 2018 and 2019.EPA cancels limits for several PFAS chemicals in drinking waterLast year,\nthe EPA set limits on PFAS in drinking water to protect public health. Now, that same agency is undoing those defenses.Senate Pres. Bill Ferguson faces heat over energy company ties, 'There is a solar grift'A state lawmaker is scrutinizing the ethics and motivations behind Senate President Bill Ferguson&rsquo;s votes on energy legislation and chamber priorities.Del. MarkMultiple people shot along I-75 in southeastern Kentucky, authorities sayMultiple people were shot Saturday along Interstate 75 in a rural area south of Lexington, authorities said.Send Us A News TipCall For ActionSinclair CaresSportsSportsChychrun scores twice to lift Capitals over Blue Jackets 5-1WASHINGTON (AP) &mdash; Jakob Chychrun scored twice and the Washington Capitals beat the Columbus Blue Jackets 5-1 on Monday night.Tom Wilson and John Carlson each haQuincy Wilson, youngest American track and field Olympian ever, commits to MarylandQuincy Wilson, the then-16-year-old who became the youngest track and field Olympian in American history in 2024, announced his commitment to the University of Jayden Daniels returns to practice with the Commanders but is unlikely to face the BroncosWASHINGTON (AP) &mdash; Jayden Daniels returned to practice for the Washington Commanders on Monday after missing the past two games with a dislocated left elbow, butCameron Boozer scores 26 as No. 5 Duke hammers Howard 93-56Cameron Boozer&rsquo;s 26 points and 12 rebounds led No. 5 Duke to another lopsided victory in a 93-56 romp past Howard on Sunday.CapitalsD.C. UnitedNationalsWashington CommandersWizardsCollege BasketballCollege FootballHigh School SportsRising StarsScoreboardToyota Athlete of the WeekMore SportsOlympicsTICKETSNFL DraftCity GuideGame CenterGame CenterDaily Crossword Guess Word Jewel Block Micro CrosswordClassic Sudoku Word SearchWatchLiveNow48°Tue57°Wed69°SearchSearchUser IconWatchSearchNewsDown ArrowLocalElectionsElection Results7News MorningsNation & WorldGood Morning WashingtonCrisis In The ClassroomEntertainmentOffbeatVideosAmazing AmericaArmstrong Army StrongBeyond The PodiumConnect To CongressInside Your WorldSoarSpotlight on AmericaTown HallQuestion of the DayFull Measure with Sharyl AttkissonDid You Know?Coronavirus VaccineAddicted in AmericaSeptember 11th: 20th Anniversary7News DroneBack to School75th AnniversaryHEALTHWJLA PollWeatherDown ArrowWeather HomeCherry Blossom RadarClosingsMapsHurricane CenterLunchbox WeatherWeather camerasFirst Alert Weather BlogI TeamDown ArrowI Team HomeSend Us A News TipCall For ActionSinclair CaresSportsDown ArrowSports HomeCapitalsD.C. UnitedNationalsWashington CommandersWizardsCollege BasketballCollege FootballHigh School SportsRising StarsScoreboardToyota Athlete of the WeekMore SportsOlympicsTICKETSNFL DraftCity GuideGame CenterDown ArrowGame Center HomeDaily Crossword Guess Word Jewel Block Micro CrosswordClassic Sudoku Word SearchMoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsChime InTrafficDown ArrowTraffic HomeMapMetroDownload our appFeaturesDown ArrowFeatures Home7News StoriesDMV StrongFor Pet's SakeLotteryHelping HandsFeeding the DMV7News SalutesBlack History MonthContestsAANHPICall For ActionDown ArrowCall For Action HomeFile Consumer ComplaintObituariesAbout UsDown ArrowAbout Us HomeContact The NewsroomCopyrightCareersContestsEEOMeet Our TeamMobile AppsPrivacySinclair CaresScheduleTermsSubmit an Investigative TipNewsletter Sign UpNewsletter Sign UpLegalDown ArrowTerms & ConditionsCopyright NoticesEEO Public File ReportFCC InfoFCC ApplicationsPublic File AssistanceContact WJLASubmit TipWJLA News TeamCareersContestsMaryland Political Ad Disclosures – Ad Networkstwitter iconfacebook iconACCESSIBILITYArmstrong Williams Town HallArmstrong Williams takes on the news of the week and asks the questions you want answered. Don&rsquo;t miss our weekly town hall!WATCHClose11Please ensure Javascript is enabled for purposes of website accessibilityCouncilmember Pinto rolls out 'Prosper DC Plan' focused on jobs, housing and youthby Ida Domingo,Phylicia Ashley,DCBureauReporter,andLianna GoldenMon, November 17, 2025 at 8:26 AMUpdated Tue, November 18, 2025 at 6:42 PM4VIEW ALL PHOTOSDC Councilmember Brooke Pinto.(7News/File)Comment on this story5CommentShare storySharetopics: Prosper DC PlanEconomic opportunitiesYouth developmentAffordable housingLocal businessesApprenticeshipsFinancial servicesTech innovationWASHINGTON (7News) — D.C. Councilmember Brooke Pinto introduced a sweeping package of 23 bills Monday morning aimed at expanding economic opportunities, improving youth development programs and supporting local businesses in the District.According to Pinto, the “Prosper DC Plan” builds on Pinto’s earlier public safety-focused initiatives — Peace DC and Secure DC — by addressing what she calls the economic and opportunity gaps that contribute to instability for many residents. The plan includes measures to improve job access, reduce barriers for entrepreneurs, expand youth programming and make housing more affordable.SEE ALSO | DC invests $9.2M in program monitoring students traveling to & from school\"We must create pathways to economic prosperity for all District residents and entrepreneurs to ensure the District remains a place where people want to live, work, grow their business, and create communities that are vibrant.” said Councilmember Pinto. “As I have met with residents across the District, it is clear folks are eager to be part of lifting up the city -- creating pathways to contribute, earn, and grow must be central to the future we are fighting for together. My Prosper DC Plan will help uplift families, residents, and businesses by investing in economic opportunities for residents, competitiveness for businesses, positive youth development, and affordable, healthy, and accessible communities.” In weeks’ worth of council hearings and testimony, saying more resources are needed to prevent kids from getting into trouble and crime, Pinto said this is her answer.WJLASeven of the 23 bills in the package focus on juveniles and their development in the district. We asked Pinto why she thinks these bills are realistic and how they relate to reducing juvenile crime.“We have to do more to prevent and if somebody violates the law they have to be held accountable,” Pinto said “I've always believed that we can and must do both in our city, which is why every time we advance a specific tool or specific idea it is one in a holistic set of pathways that we have to move forward in.”The bills focused on juveniles do the following:Allows minors to open a deposit account without parental consentRequires D.C. schools to create appropriate AI use for students and staffCovers 50% of wages for employers who hire a young adult parent7News asked Pinto why employers get subsidies.“I'm a big believer in aligning incentives,” Pinto said. “We have a population in D.C. that is seeing increased rates of teen pregnancy and young people having children, and that often creates a lot of economic challenges for that family. And so, what we wanted to create with this bill was a pilot program to provide some subsidization to get access to employment.The bills also:Gives $300,000 to non-profits for social and educational programmingRequires the Deputy Mayor for Education to create an app that connects teens looking for jobs with hiring in all eight wards. Expands the Marion Barry youth program from 24 to 30 years old.The Department of Parks and Recreation would also be required to open and operate a teen center in each quadrant of the city.Pinto said she wants this to pass and be included in this year's budget. 7News asked if the D.C. budget could handle the enhancement after the budget crisis. Pinto said it's all about focusing the budget in the right place.\"Bringing in these other aspects, this holistic approach to addressing juvenile crime, I think it makes a lot of sense as long as it’s not at the expense of public safety,\" Joshua Ederheimer, a former official with the Metropolitan Police Department (MPD) and current assistant professor at the University of Virginia, said. Ederheimer backs the program, howeverMy only concern when I saw this was: Is money going to be diverted from the police department to support these very good programs? I think that’s a very bad idea because the department is understaffed and they need the funding.The D.C. Police Union has said the department is short about 800 officers, out of a current 3,200, while the mayor says they need about 500. Enforcement, Ederheimer adds, is crucial to keeping a city safe, but it's far from the only answer. \"I think any funding for these well-thought-out programs needs to complement and be in addition to the police department budget,\" he said. According to a release, the Prosper DC Plan takes important steps to deliver:Economic Opportunities for ResidentsPositive Youth DevelopmentSupports and Attraction Incentives for BusinessesAffordable, Healthy and Accessible HousingSee the bills introduced below: Economic Opportunities for Residents:1.\nIntroducing the Apprenticeships and Credentials as Pathways to Prosperity Act of 2025 This bill supports high school graduates and other DC workers by establishing an apprenticeship and credential program targeting high-demand industries like healthcare, tech, education, hospitality, and construction management that provides on-the-job training, job placement, and zero-interest forgivable loans for tuition and living expenses.2.\nIntroducing the Equitable Access to Financial Services Act of 2025 This bill supports unbanked and underbanked DC residents by requiring any contract the District enters into with a financial institution that provides prepaid debit cards to require the financial institution to have physical locations in at least five wards and that a preference be given to financial institutions with physical locations in census tracks with a median household income of $50,000 or less.3.\nIntroducing the Expanding Fertility Treatment Options Amendment Act of 2025: This bill supports women and families by requiring health insurers in the District to cover elective egg freezing as a treatment to increase the chance of pregnancy for patients at a later, more advanced age, when they may face age-related fertility decline.4.\nIntroducing the Park Concessions Amendment Act of 2025: The bill supports our local economy by reinvesting in underutilized recreation centers and parks across the District and establishing a seasonal grant program to support local food and drink vendors operating at recreation sites during peak months.Positive Youth Development:1.\nIntroducing the Teen Center Establishment Amendment Act of 2025 This bill supports teens by addressing gaps in recreational programming by requiring DPR to establish and operate at least four comprehensive teen centers in each quadrant of the District.2.\nIntroducing the Youth Villages Grant Establishment Amendment Act of 2025 This bill supports at-risk youth by establishing a Youth Villages grant program within the Child and Family Services Agency modeled after the Senior Villages program under the Department of Aging and Community Living (DACL) to support creation and operation of neighborhood-based organizations across DC.3.\nIntroducing the Youth Links App Act of 2025 This bill supports our youth by directing the Deputy Mayor for Education to contract with a third-party developer to create a smartphone application that directly connects youth and young adults in the District to flexible, paid work opportunities in the private sector.4.\nIntroducing the Youth Employment Program Cohort Expansion Amendment Act of 2025 This bill supports our young adults facing barriers in the workforce by extending the maximum age for participation in the Marion Barry Summer Youth Employment Program (MBSYEP) to 30 years of age.5.\nIntroducing the Pathways to Prosperity for Young Parents Pilot Amendment Act of 2025 This bill helps reduce barriers into the workforce for young parents by creating a pilot program that provides 100 subsidized employment vouchers to young parents.6.\nIntroducing the Youth Banking Amendment Act of 2025 This bill empowers young people to take control of their finances by clarifying that financial institutions may provide deposit accounts to minors between the age of 14-18 without parental consent, and that accounts may not provide lines of credit for minors or charge fees or overdraft charges.7.\nIntroducing the Artificial Intelligence Literacy in Education Act of 2025 This bill supports students and educators by requiring the DC Office of the State Superintendent of Education (OSSE) to create guidance surrounding the use and instruction of artificial and generative intelligence tools.Supporting and Attracting Businesses:1.\nIntroducing the Innovate DC Amendment Act of 2025 This bill grows our local tech economy by providing matching grants to DC universities and hospitals to support the development of tech research and innovation facilities, and it invests in tech commercialization research to launch new businesses.2.\nIntroducing the Fairness and Accuracy in Real Property Tax Assessments Amendment Act of 2025 This bill implements common-sense improvements to make the real property tax assessment process more accurate, efficient, and timely as we see an office market that is experiencing major vacancy impacts.3.\nIntroducing the Special Events Permit Process Simplification Act of 2025 This bill supports DC’s cultural vibrancy by streamlining the special event permitting process and creates a one-stop-shop for event permitting by establishing an Office of Special Events under the Deputy Mayor of Planning and Economic Development.4.\nIntroducing the Art Gallery Tax Exemption Amendment Act of 2025 This bill supports our local arts community by ensuring art galleries that are exempt from property tax may also exempt space used for business purposes that support the cultural mission of the organization.5.\nIntroducing the Vacant Space Art Activation Program Act of 2025 This bill supports our local arts by utilizing vacant space for arts and cultural organizations at no cost to the organizations and helps address our chronic commercial vacancies. Vibrant space leads to opportunities, activation, and safety.6.\nIntroducing the Job Growth Incentive Amendment Act of 2025: This bill incentivizes current business owners to grow their businesses here in DC and encourages companies to relocate to DC which is especially important for supporting residents impacted by federal government and contractor layoffs.Affordable, Healthy, and Accessible Communities:1.\nIntroducing the Expanding Downtown Affordable Housing Options Act of 2025 This bill supports residents by expanding housing options downtown by reducing barriers for office-to-housing conversions and encouraging new forms of communal housing that will increase supply and drive down housing costs for residents.2.\nIntroducing the Portable Tenant Screening Report Amendment Act of 2025 This bill supports renters by reducing the costs of seeking a residential unit by requiring prospective landlords to accept portable tenant screening reports, which can be used for multiple applications.3.\nIntroducing the Disabled Veterans Complete Property Tax Exemption Amendment Act of 2025 This bill supports disabled veterans by amending the homestead deduction to include a complete property tax exemption for qualifying 100% disabled veterans and transferring the deduction to the surviving spouse of a disabled veteran or a surviving spouse of a veteran who died in the line of duty.4.\nIntroducing the Renter Tax Credit Expansion Amendment Act of 2025 This bill supports renters by increasing the tax credit cap to match fair market rent values and creating an option for more regular payments to tenants.5.\nIntroducing the Ensuring Access and Supporting Engagement (EASE) for DOC Residents Act of 2025: This bill addresses barriers to the Council legislative process for DOC residents by ensuring they can testify before the DC Council and engage with their ANC Commissioner, and it requires that DOC provides access to the technology and internet necessary to facilitate their testimony.Comment with BubblesREAD THE COMMENTS (5)6.\nIntroducing the Rodent Abatement Through Smart Solutions (RATSS) Amendment Act of 2025: This bill supports a clean and healthy DC by addressing the prevalent rodent problem by replacing public trash cans that are in disrepair with rodent-proof bins, establishing a more systematic replacement program for residential trash cans that have evidence of being chewed by rodents, establishing a home trash shed incentive program for the safe storage of trash receptacles, and establishing a trash compactor grant program for businesses.TrendingMan found dead in wheelchair on side of road in Tysons A man was found dead in a wheelchair on the side of the road in Tysons, Va.Driver killed in single-vehicle crash in Montgomery CountyA driver is dead following a Sunday night single-vehicle collision in Montgomery County, according to police. Man found naked, unconscious after Fairfax County fight later dies: PoliceFairfax County police are investigating a deadly incident after officers responded to a fight early Monday morning. Montgomery County at a crossroads over future of its trash disposalMontgomery County, Maryland, is entering a pivotal debate over how to manage the more than 600,000 tons of trash it produces each year.Teen going 100 mph charged with killing pregnant girlfriend in deadly 12-vehicle crashA teenager, Jose Gutierrez, 19, is facing murder charges after allegedly causing a 12-vehicle crash while driving at 100 mph in a 45 mph zone.NEWS IN PHOTOS:\"Local\"3Jury to weigh recall efforts against Purcellville, Va., vice mayor in trial set for Dec. 16Prince George's County advocates say data center still needs more research3Prince George&rsquo;s Sheriff warns of scammers posing as deputies and stealing over $12,0003Waldorf man accused of killing 4-month-old girlACCESSIBILITYDownload Our Mobile Apps:Terms & ConditionsCopyright NoticesEEO Public File ReportFCC InfoFCC ApplicationsPublic File AssistanceContact WJLASubmit TipWJLA News TeamCareersContestsMaryland Political Ad Disclosures – Ad NetworksNewsWeatherHealthSportsContestsGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 2849, "success": true}