{"full_text": "Fact Check Team: Will Trump's 50-year mortgage idea solve or worsen housing affordability?NewsNewsWaste Watch: TSU scandal sparks questions about financial oversight at state universitiesThe state of Texas allocated approximately $30 billion for public higher education in the last fiscal year, which ended in September, according to the Texas LegJoyful tears fill Jefferson County courtroom as families unite on National Adoption DayA Jefferson County courtroom was transformed into a scene of joy and celebration as 19 children were officially adopted during a special session in honor of NatPOLL: Are the penalties for dogfighting and spectatorship too lenient?A major crackdown on illegal animal fighting has raised fresh questions about how strictly Texas prosecutes dog-fighting rings and those who watch them. On Nov.Marsh fire near Cheniere LNG in SW Louisiana sends thick smoke into Port ArthurA significant marsh fire is currently burning across the highway from Cheniere, Louisiana, sending a substantial amount of smoke toward Port Arthur.Local authoLocalNation & WorldOffbeatEntertainmentTexasSpotlight on AmericaBack to SchoolConnect to CongressThe Morning ShowAmazing AmericaOn The RunAuto MattersElectionSpecial ReportsWhat's Driving You CrazyCrime in the CommunityArmstrong Army StrongCrisis in the ClassroomSouthTexas State FairVideosCommunity NewsAddicted SETXARC Southeast TexasWeatherCurrent WeatherBeaumontShowers Late74F78/63Today78/63Tuesday78/52Wednesday69/41Latest WeathercastLatest WeathercastRadarMapsHurricane TrackerCamerasWeatherNETFeaturesFeaturesJK Subaru - November 20, 2025JK Subaru is putting the spotlight on its community-first mission in a new interview, emphasizing service, integrity, and local involvement as the pillars of itSinclair Cares: Fill the Food BanksSinclair is partnering with Feeding America this holiday season for Sinclair Cares: Fill the Food Banks to help provide meals to families across the U.S. Paws off the turkey: A Thanksgiving food warning for all pet parents The seasonings and herbs on your Thanksgiving turkey can cause harm to your pet.Beaumont Heritage Society honors Indian pioneer, Beaumont native with historical markerAn Indian pioneer who made his home in beaumont....will be honored with a texas historical marker.the beaumont heritage society and the jefferson county historiHometown HeroesAsk the AttorneyLifestyle MattersPay It ForwardPartner SpotlightDaytime w/ Kimberly and EstebanToyFeastFor Pet's SakeProblem SolversDaytimeCoats and KettlesThe Baptist WaySouper Bowl of CaringMake Macy Do ItSportsSportsLamar Cardinals clinch FCS playoff spot, set to face Abilene ChristianThe Lamar Cardinals have earned an At-Large bid into the FCS Playoffs after a historic season.The Cardinals finished the year 8-4 after a loss last night againIndiana's Fernando Mendoza hears the Heisman hypeIndiana University QB Fernando Mendoza discusses his Heisman Trophy candidacy, remaining focused on the next game and following his brother to the Hoosier statePOLL: What would make Beaumont nightlife safer?A series of late-night disturbances outside several popular Beaumont bars is renewing concerns about public safety in large parking lots around to and after cloBradley urges Pulisic and Adams to seize their World Cup momentFormer USMNT star Michael Bradley gives his assessment of the current team and reveals the message he relayed to Christian Pulisic and Tyler Adams.Top Sports StoriesLocal SportsHigh School SportsLamar AthleticsScoreboardYour Winning WaysLamar Cardinal SpotlightTICKETSCity GuideGame CenterGame CenterDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord Search WatchLiveNow74°Tue80°Wed69°SearchSearchUser IconWatchSearchNewsDown ArrowLocalNation & WorldOffbeatEntertainmentTexasSpotlight on AmericaBack to SchoolConnect to CongressThe Morning ShowAmazing AmericaOn The RunAuto MattersElectionSpecial ReportsWhat's Driving You CrazyCrime in the CommunityArmstrong Army StrongCrisis in the ClassroomSouthTexas State FairVideosCommunity NewsAddicted SETXARC Southeast TexasWeatherDown ArrowWeather HomeRadarMapsHurricane TrackerCamerasWeatherNETFeaturesDown ArrowFeatures HomeHometown HeroesAsk the AttorneyLifestyle MattersPay It ForwardPartner SpotlightDaytime w/ Kimberly and EstebanToyFeastFor Pet's SakeProblem SolversDaytimeCoats and KettlesThe Baptist WaySouper Bowl of CaringMake Macy Do ItSportsDown ArrowSports HomeTop Sports StoriesLocal SportsHigh School SportsLamar AthleticsScoreboardYour Winning WaysLamar Cardinal SpotlightTICKETSCity GuideGame CenterDown ArrowGame Center HomeDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord Search MoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsChime InTrafficNewsletter Sign UpStationDown ArrowStation HomeContactPeopleContestsScheduleNewsletter Sign UpDaytimeLegalDown ArrowTerms & ConditionsCopyright NoticesFCC InfoFCC ApplicationsPublic File AssistanceContactNews TeamConteststwitter iconACCESSIBILITYArmstrong Williams Town HallArmstrong Williams takes on the news of the week and asks the questions you want answered. Don’t miss our weekly town hall!WATCHClose11Please ensure Javascript is enabled for purposes of website accessibilityFact Check Team: Will Trump's 50-year mortgage idea solve or worsen housing affordability?by EMMA WITHROW | Fact Check TeamTue, November 18, 2025 at 6:37 PMUpdated Tue, November 18, 2025 at 9:59 PM4VIEW ALL PHOTOSWASHINGTON, DC - NOVEMBER 17: U.S. President Donald Trump delivers remarks during a meeting of the White House Task Force on the FIFA World Cup 2026 in the Oval Office of the White House on November 17, 2025 in Washington, DC. The task force was created to oversee security, logistics, and federal government support for the 2025 Club World Cup and the 2026 FIFA World Cup, jointly hosted by the United States. (Photo by Win McNamee/Getty Images)Comment on this story0CommentShare storySharetopics: MortgageHousing affordabilityUnderwater mortgagesHomebuildersInterest ratesDonald Trump50-year mortgageNegative equity WASHINGTON (TNND) — The Federal Reserve signaled this week that aspiring home buyers expecting more interest-rate relief may have to keep waiting. And that delay is exposing a deeper problem in the housing market: hundreds of thousands of Americans who bought newly built homes over the last few years are already underwater on their mortgages.It’s a trend analysts say didn’t happen by accident, and the lending practices behind it mirror warning signs from the early 2000s. (TNND)It’s a trend analysts say didn’t happen by accident, and the lending practices behind it mirror warning signs from the early 2000s.How Builders Helped Create a Wave of Underwater MortgagesBeing “underwater” on a mortgage simply means you owe more than your home is currently worth. As Bankrate’s chief financial analyst Greg McBride explains, “you owe more than the current value the asset is worth less than the amount you borrowed”.But according to a new analysis first reported by The Wall Street Journal, many homeowners who purchased newly built houses in 2022–2024 landed in that position almost immediately. That’s because large homebuilders have been offering artificially low mortgage rates, often far below market levels — in exchange for higher home prices.Here’s what WSJ found, based on data from analyst John Comiskey:27% of Lennar’s FHA loans from 2022–2024 are now underwater.18% of D.R. Horton’s FHA loans are underwater.10% of Quicken Loans’ FHA loans (a non-builder lender) are underwater.The playbook works like this: builders advertise mortgage rates around 3.99%, even while the broader market hovered closer to 6.3%. But to make the numbers work, they keep sale prices above what the property might otherwise be worth. Buyers get a lower monthly payment, but at the cost of taking out a loan that’s already near, or above, the home’s actual value.When prices stopped rising, many borrowers slid into negative equity almost immediately.What Happens When You’re Underwater?For homeowners, the consequences are severe, and in some cases, financially immobilizing.You can’t easily sell your home. Selling requires bringing cash to the closing table to cover the gap between the loan balance and the sale price. That can mean writing a check for tens of thousands of dollars.You can’t refinance. Lenders require equity to approve a refi. Without it, homeowners are effectively locked into their existing rates.The risk of default rises. When people owe far more than their home is worth, they’re more likely to walk away, a dynamic that played a major role in the 2008 housing crash, according to Bankrate.It becomes a systemic risk. Large pockets of underwater loans strain lenders, federal backstops, and local housing markets.In short, underwater mortgages trap households and can reverberate far beyond a single borrower.Is a 50-Year Mortgage a Solution, or Another Risk?Into this climate stepped former President Donald Trump, who floated a new idea on Truth Social: 50-year mortgages.Supporters call it an affordability boost. Critics are calling it a “lifetime mortgage.”The Upside: Lower PaymentsLower payments could help more people qualify, especially first-time buyers who fail debt-to-income checks. (TNND)A 50-year mortgage would spread repayment over two extra decades, meaning lower monthly payments.A New York Times analysis found that on a $500,000 home, a borrower could save about $250–$300 a month, around $4,000 a year, with a 50-year loan versus a standard 30-year mortgage.Lower payments could help more people qualify, especially first-time buyers who fail debt-to-income checks.The Downsides: Higher Costs and Bigger RisksThere would be enormous lifetime interest. Using the same NYT example: 30-year mortgage interest: ~$500,00050-year mortgage interest: nearly $900,000You’d pay almost twice the price of the home in interest alone.The National Association of Realtors says the median age of a first-time buyer used to be 36 but is now 40. Add 50 years and they’d be 86 by the time the loan matures.The Bottom LineBuilder-backed mortgages helped more Americans buy homes in a tough market, but often at the cost of pushing them into inflated prices and negative equity. Now, with underwater mortgages spreading across multiple major homebuilders, policymakers are starting to ask whether the industry’s lending incentives need a closer look.Meanwhile, Trump’s 50-year mortgage proposal aims to boost affordability but could introduce new long-term risks: massive interest payments, slower equity, and more households vulnerable to downturns.TrendingShooting at NC Christmas event leaves 3 critically injured, 3 suspects in custodyFour people were shot at around 7:30 p.m. on Union Street S near the intersection with Corban Avenue, where the event was taking place.Is there price-fixing in the beef industry?Beef prices aren't likely to move much after Tyson Foods announced the closure of one of its plants, according to an agricultural economist.BREAKING: 45 arrested after Newton County S.O. raids dogfighting ring A Newton County Sheriff's Office investigation led to a Saturday night raid of a dogfighting ring in the Call community off FM 1004 and the arrest of 45 people,Marsh fire near Cheniere LNG in SW Louisiana sends thick smoke into Port ArthurA significant marsh fire is currently burning across the highway from Cheniere, Louisiana, sending a substantial amount of smoke toward Port Arthur.Local authoExperts share tips for enjoying a heart-healthy Thanksgiving without sacrificing traditionStruggle with making your food heart-healthy? That task may be even more difficult on Thanksgiving.NEWS IN PHOTOS:\"Local\"6Man riding bicycle on Highway 62 arrested for meth possession by Jasper County sheriff3Have you seen them? Beaumont Police release video of suspects in Orleans Street break-in27Family pleads for help after horses stolen from Hardin County pasture3Happening tomorrow: 84th annual St. Mark's Chili Supper & BazaarACCESSIBILITYDownload Our Mobile Apps:Terms & ConditionsCopyright NoticesFCC InfoFCC ApplicationsPublic File AssistanceContactNews TeamContestsNewsWeatherSportsTrafficThe Morning ShowGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1666, "success": true}