{"full_text": "Experts say Trump’s 50-year mortgage plan won’t fix housing affordability crisisFederal housing official’s proposal would save buyers a bit but cost a lot more in interest.Financial experts in Kansas City told KCTV the longer loan terms would cost more than they help, and the real solution is to increase housing inventory.By Betsy WebsterPublished: Nov. 10, 2025 at 10:13 PM CSTEmail This LinkShare on FacebookShare on X (formerly Twitter)Share on PinterestShare on LinkedInKANSAS CITY, Mo. (KCTV) - Federal Housing Finance Agency Director Bill Pulte announced Saturday on X that he is working on a plan to facilitate 50-year mortgages to make home ownership more affordable. He called it a “game changer” and credited President Donald Trump with the idea.But financial experts in Kansas City told KCTV the longer loan terms would cost more than they help, and the real solution is to increase housing inventory.Aubrey Washington, a senior mortgage banker at Flat Branch Home Loans, said the savings are minimal compared to the long-term costs.“The first thing I thought was, it’s a distraction. It’s a distraction from the overall problem, which is affordability in our country,” Washington said. “I think the optics of what people think it’s going to save sounds like a lot more than it is once you actually dive into the numbers.”Washington calculated those numbers for a $300,000 house, assuming a 6.25% interest rate for a 30-year mortgage and a 6.75% rate for a 50-year mortgage. In that scenario, the 50-year mortgage results in a monthly payment that is about $100 less. But it also results in paying nearly $400,000 more in interest over the life of the loan.Washington said potential buyers are wiser to cut $100 out of their spending if the only barrier is $100 per month.“It’s like the cost of a nitro brew at Starbucks a day. That is the equivalent of what this is going to save you per month,” Washington said.Housing supply remains the core issueWashington said a better solution would be to create incentives for builders to address the housing shortage.“We’re years behind in inventory,” she said. “It’s like a gridlock in housing.”Without increasing supply, adding more potential buyers to the same housing market would likely drive prices higher.Mike Decker, a fiduciary advisor at Kedrec Wealth in Overland Park and author of “How to Retire on Time,” said 50-year mortgages are not a solution for the market or buyers.“It just kind of exacerbates the underlying issue,” Decker said.He said the extended loan terms mean buyers would essentially rent from the bank for decades before building equity.“Another way to look at a 50-year mortgage, because you’re mostly paying interest, is basically you’re renting from the bank for probably 20 or 30 years, and then you start paying down the mortgage. I mean, it’s really not in your favor,” Decker said.Budget considerations for potential buyersDecker said buyers who need that $100 monthly savings to afford a house may have budgets too tight for homeownership until they earn more or spend less.“You can’t just force affordability. It doesn’t work that way. So, you have to figure out what you have control over and work within those parameters,” he said.Washington advises clients to review six months or credit or debit card statements to see how much spending is unnecessary.“Your Amazon purchases, your smoothies, your coffee. All these little things add up,” she said.For buyers priced out by small amounts, Decker and Washington suggest researching federal and state first-time homebuyer assistance programs that can help with down payments. They are typically dependent on income and credit score.Decker also suggested looking at more than just interest rates but all costs. He said sometimes buyers can come out ahead by picking a slightly higher interest rate with lower closing costs.Copyright 2025 KCTV. All rights reserved.", "extraction_method": "beautifulsoup", "word_count": 626, "success": true}