{"full_text": "The sweeping economic interventions launched during the Covid-19 pandemic may have made American homes less attainable for millions—a reality the housing market will need years, if not decades, to correct, warns top real-estate executive Sean Dobson. The Amherst Group CEO, whose subsidiary Main Street Renewal is one of the country’s largest institutional landlords, told ResiClub‘s Lance Lambert that he believes the aftershocks of loose lending in the run-up to the Great Financial Crisis, and massive stimulus and abrupt policy pivots in the years since, have fundamentally altered the homeownership landscape for an entire generation.​Recommended VideoDobson, in conversation at the residential real-estate conference ResiDay, reflected on the question of what the U.S. is going to do for the family out there that wants to buy a home. “We think the unfortunate part … really the cost of economic policy response to COVID is that we’ve probably made housing unaffordable for a whole generation of Americans.”Dobson estimated that it will probably take 10 or 15 years of steady income growth to get affordability back to something approaching fairness, referencing postwar to pre-2006 norms. He placed the blame squarely on a combination of pandemic-era monetary policy, describing economic policy as “reckless” as well as surging asset prices and stagnant wage growth. “Affordability has probably never been as bad as it is today, the way that we measure it,” Dobson said—worse, even, than the feverish markets of 2006.​ “You’ve got to be very, very careful.”On the sidelines of the conference, Dobson told Fortune that “rental is going to have to become a part of the solution,” not just because he’s invested in the success of his firm but for the health of the country. “What are our goals?” Dobson asked hypothetically. “Is our goal to get everyone long real estate? Or is our goal to get everybody to live where their kids can go [to a good school] and be successful?” He said the housing industry is facing a big, obvious problem. “In reality, the problem is that homeownership is too difficult to reach, and there aren’t enough homes – across all types and price points – to meet consumer needs.” A representative for Amherst said this is “the least affordable period in modern history” for housing, noting that the PITI (Principal, Interest, Taxes and Insurance) on an FHA-insurance mortgage with a 97% loan-to-value ratio currently consumes about 42.9% of median income. That is slightly higher than 2006 averages of 41.5%, and well above the longer-term 25%-35% range.The Price of Economic FirefightingWhat was so reckless about U.S. economic policy, according to Dobson? A brief refresher on the last decade-plus and the era of quantitative easing is required.The onset of Covid-19 triggered trillions in government spending and ultralow interest rates as the Federal Reserve returned to the playbook that was improvised in the crisis of 2008. While meant to stave off recession and mass unemployment, this “easy money” era sent home prices and rents skyrocketing.Dobson told Lambert that this set of government and Fed policies, though well-intended, created new winners and losers in the housing market. “There’s a tax on the U.S. economy that’s almost 200 basis points because of the shoot-up that occurred. And the Fed needs to get rid of that tax,” he said, pointing to persistently high mortgage rates and nominal rates that are “probably 1 [percent] higher than they’re supposed to be given the rate of inflation that we have.”Amherst’s own analytics show just how far out of reach the average home has become. Right now, “you’re so far away from fair value,” he said, that “you can only reach affordability one of three ways: by changing the price of the home, the price of the money, or the income of the family.” An Amherst Group representative provided internal estimates projecting that, for housing affordability in the U.S. to get back in line with 2019 levels, the price of the home would need to go down 35.3%, interest rates to go down 4.6%, or income to go up by about half (55%). None of these is plausible on their own, Dobson told Lambert, and only incremental progress is likely as incomes, prices, and rates gradually realign over many years.​Credit constraints are another culprit: while post-crisis regulations have shored up mortgage lending standards, they have also squeezed out borrowers with lower credit scores—historically, a large swath of would-be first-time buyers. “Subprime mortgages were serving millions of Americans to get them to buy homes … when Dodd-Frank was passed, there was a maximum credit risk allowed on the table. That only serves the top 25% of the consumer base,” Dobson explained. As a result, lending criteria systematically exclude half the market, leaving many Americans as permanent renters despite wanting homeownership.​The reason these were called subprime wasn’t because they were junk, he added, they were simply mortgages for people with below-average credit scores. He asked the crowd if they knew what it took to go from a 745 FICO score to a 645 FICO score: “Two missed payments. You can go from prime to subprime in two months.” After that, it takes five years to get back to prime status, he added. “This whole system of how we decide who gets credit and who gets to decide, and then what we do when the mortgage defaults, is something built in the ’40s.”Institutional Owners and the Rental ShiftDobson also addressed the growing role of institutional landlords like Amherst. Despite public criticism that firms like his crowd out homeowners, he maintains they instead fill a void left by tighter credit and lower homebuilding. Amherst’s residents often have modest incomes and below-prime credit but aspire to the benefits of suburban homes—yards, schools, and community—even if they rent, not own.​ “We got involved simply because … the nation is not going to finance [our customers] to live in the home.”In conversation with Fortune, Dobson argued that Amherst’s rise fills a vacuum and his residents are not served by the current mortgage industry. He said many Amherst residents have credit scores around 650 and a small percentage — fewer than 10% — have inconsistent payment histories: “If that was a mortgage pool, it would be a disaster.” Dobson said the model is a needed adaptation to post-pandemic American realities: it finances and upgrades homes at scale and offers housing stability when the government and traditional lenders have retreated.As for solutions, Dobson told Lambert he was skeptical of quick fixes from Washington. He advocated for expanding credit access—potentially through innovative financing or careful relaxation of lending standards—but notes that such ideas can be “the fastest way to end a meeting with a politician.”In conversation with Fortune, Dobson looked out on the future for the economy, his residents and the pursuit of a good life. On the subject of artificial intelligence, he said he thinks its impact on jobs will be most acute for frontline and service professionals, which make up a large chunk of Amherst’s residents. Dobson told Fortune that his average new resident makes slightly over $100,000 (Amherst said the median annual income of new residents is\n$108,000). And if these residents are working a job “pushing paper and part of the workflow process,” then they could be in trouble, he said.When asked about the recent election of Zohran Mamdani as mayor of New York, framed by The New York Times as “the revenge of the struggling yuppie,” making about $120,000 and struggling to afford the city, Dobson declined to comment, except to say that many people seem to feel like they’ve done what they were told “and then they didn’t get what they were promised.”", "extraction_method": "beautifulsoup", "word_count": 1267, "success": true}