{"full_text": "Many of us remember the episode of The Office in which Michael Scott plans to purchase a new house. He excitedly gives Dwight a tour and fantasizes about his future there, until he realizes that the mortgage contract he is about to sign has a 30-year term. Michael immediately panics and starts finding issues with the house.What Michael’s real estate agent fails to explain is that the vast majority of home buyers don’t keep the same 30-year mortgage from start to finish. In fact, the average 30-year loan only lasts around 7–12 years, since people move and sell their homes, refinance with a new mortgage or pay it off early.\nSo why don’t mortgages have 7-12 year terms? Because most people can’t afford them.\nThe 30-year mortgage was created during the New Deal to replace much shorter, unaffordable loans that most buyers couldn’t sustain. It expanded access to homeownership at a time when the major barrier was the structure of mortgages themselves.\nThe 50-year mortgage idea recently floated by the Trump administration grows out of the same motivation of the 30-year mortgage of the 1930s—to make home ownership more accessible to people who would otherwise be renters.\nBut today, the main barrier is not how we finance homes—it’s that we don’t build enough of them.\nLike the 30-year mortgage, the 50-year mortgage, if implemented, would almost never actually be held for 50 years. The real issue is that this proposal attempts to solve a supply-side problem with a demand-side solution. Longer mortgage terms treat the symptom—high monthly payments—but not the cause, which is an under supply of housing.\nThat problem isn’t going to be solved by a 30-year, 50-year or 100-year mortgage.\nIn fact, 50-year mortgages will further increase housing prices. Why? Because as terms lengthen, monthly payments will fall—allowing buyers to qualify for larger loans. These buyers can then bid more for the same limited number of homes.\nSo, what’s the solution to the housing supply problem? We need to make it simpler to build.\nGeorgia illustrates the problem clearly. The state has added more than a million new residents each decade, but construction has lagged behind. A recent analysis found that 94 of Georgia’s 159 counties now face a housing shortage.\nWhy aren’t we building enough?\nOne major reason is increased regulation, which results in delays and uncertainty in the permitting process. Builders can only break ground when a building permit is issued, which is after zoning and land-use decisions have been made. When those permits are slow or unpredictable, each month of delay adds carrying costs for land, labor and financing; those costs are eventually baked into the sale price. Regulatory costs now account for roughly 27% of the price of a new home.\nPermit reform would be far more impactful than a 50-year mortgage. Luckily, the state is already looking into this. Proposed legislation would require local governments to approve or deny a building permit within 45 days. If a permit is denied and the builder fixes the issues and resubmits, the local government would have 14 days to respond and any denial would have to include a written explanation citing the specific rules behind it. These guardrails don’t weaken safety or quality standards; they simply make the process timely and predictable so builders know what to expect.\nWe also know this kind of reform works.\nArizona recently adopted a similar “permit freedom” policy. There, the average time to close out a residential building permit fell from about 200 days in 2022 to 126 days in 2024. Analysts at Common Sense Institute Arizona estimate that this change alone will allow roughly 3,800 additional homes to be built each year and could reduce housing prices by as much as 5%.\nStreamlining permits and trimming unnecessary fees would do more to help first-time buyers than tacking 20 extra years onto their mortgage. The goal is not to maximize the amount of debt a household can carry; it is to make it possible for more families to buy reasonably priced homes in the first place.\nMichael Scott’s panic was played for laughs, but his reaction is understandable. The mortgage is one of the most visible parts of the home-buying process, so it’s easy to assume that changing the loan is the key to affordability. But as the data show, if policymakers want to help people become homeowners, they should spend less time dreaming up longer mortgage terms and more time making it faster, cheaper and simpler to build the homes Americans need.", "extraction_method": "beautifulsoup", "word_count": 753, "success": true}