{"full_text": "News\n\n\n\nNews\n\nRegional Drug Task Force launched to combat narcotics in eastern North Carolina\nRegional Drug Task Force Formed to Combat Illegal Narcotics in Eastern North CarolinaCraven County, N.C. &mdash; The Craven County Sheriff’s Office, Pamlico County Sh\n\nSuspect in Arlington Blvd pedestrian death released on bond, court date set for February\nA suspect has been arrested in relation to a vehicular collision that occurred on Sunday, November 16, that led to the death of a pedestrian.\n\nCarteret board to escalate election protest over misconduct and irregularities claims\nAn evidentiary hearing is underway at the Carteret County Board of Commissioners regarding the Morehead City mayoral race.Voters from Morehead City are testify\n\nGreenville woman arrested for assault with deadly weapon\nYorling Valdez-Medina, 33, was arrested on Friday, November 21 at 11:44 a.m. by Greenville police at the 2400 block of Charles Blvd. in Greenville, N.C. She fac\n\nLocalState NewsNation & WorldEntertainmentOffbeatLocal CrimeEast Carolina UniversityGas PricesHappeningsAmazing AmericaConnect to CongressArmstrong Army StrongInside Your WorldClosingsSoarSites in the NewsENC HeroesBack to SchoolQuestion of the DaySpotlight on AmericaBig RockElectionBusinessHealthy HomeFull Measure with Sharyl AttkissonDid You Know?Addicted North CarolinaHealthNews 12 InvestigatesCrisis in the classroom\nWeather\n\n\n\nCurrent Weather\n\nNew Bern\nSunny\n\n64F\n\n\n65/\n45\n\n\nToday\n\n\n65/\n45\n\nTuesday\n\n\n73/\n62\n\nWednesday\n\n\n76/\n44\n\nLatest Weathercast\nLatest Weathercast\n\nMapsRadarHurricane CenterNext Weather MakerWeather-Ready AmbassadorClosings\nHome of the Brave\n\n\n\nHome of the Brave\n\nRetired Army veteran Norbert Miller reflects on 30 years of service and dedication\nRetired Army veteran Norbert Miller, who dedicated 30 years to military service, shared his journey and experiences in an interview. \"I'm an American soldier, o\n\nChris Bispham honors late brother with helmet initials as Rams gear up for playoff battle\nHigh school football teams hit the practice field today getting ready for the second round of the playoffs. For schools in military towns like Havelock Veteran\n\nVeterans share stories of heroism and camaraderie in Eastern North Carolina\nIn honor of Veterans Day, stories of heroism and camaraderie from veterans across Eastern Carolina are being shared, highlighting the sacrifices and experiences\n\nCake cutting ceremony at Camp Lejeune honors Marine Corps' 250-year legacy of service\nMarines on Camp Lejeune marked a major milestone: the 250th birthday of the United States Marine Corps.\n\nBags for the brave\nStation\n\n\n\nStation\n\nHOLIDAY TRIVIA OFFICIAL CONTEST RULES\nHOLIDAY TRIVIA OFFICIAL CONTEST RULESContest: HOLIDAY TRIVIAMarket(s)/Station(s): Abilene, TX (KTXS), Albany/Schenectady/Troy, NY (WCWN,WRGB), Amarillo, TX (KVI\n\nSinclair Cares: Fill the Food Banks\nSinclair is partnering with Feeding America this holiday season for Sinclair Cares: Fill the Food Banks to help provide meals to families across the U.S. \n\nTrick or Treat Trivia\nTRICK OR TREAT TRIVIA OFFICIAL CONTEST RULESContest: TRICK OR TREAT TRIVIAMarket(s)/Station(s): Abilene, TX (KTXS), Albany/Schenectady/Troy, NY (WCWN,WRGB), Ama\n\nSinclair Cares: Help Drive Out Cancer\nSinclair is partnering with the American Cancer Society for Sinclair Cares: Help Drive Out Cancer.\n\nPeopleContactScheduleContestEEO ReportTerms and ConditionsCopyrightPrivacyCareersNewsletter Sign Up\nGame Center\n\n\n\nGame Center\n\n\n\n\n\n\n\n\n\n\n\n\n\nDaily Crossword Guess Word Jewel Block Micro CrosswordClassic Sudoku Word Search\nWatch\nLive\n\n\n\nNow\n64°\n\n\nTue\n72°\n\n\nWed\n78°\n\n\n\n\n\n\n\n\nWatch\n\n\n\n\n\n\n\nNews\n\n\nLocal\nState News\nNation & World\nEntertainment\nOffbeat\nLocal Crime\nEast Carolina University\nGas Prices\nHappenings\nAmazing America\nConnect to Congress\nArmstrong Army Strong\nInside Your World\nClosings\nSoar\nSites in the News\nENC Heroes\nBack to School\nQuestion of the Day\nSpotlight on America\nBig Rock\nElection\n\nBeyond the Podium\nYour Vote\nBusiness\nHealthy Home\nFull Measure with Sharyl Attkisson\nDid You Know?\nAddicted North Carolina\nHealth\nNews 12 Investigates\nCrisis in the classroom\n\n\nWeather\n\n\nWeather Home\nMaps\nRadar\nHurricane Center\nNext Weather Maker\nWeather-Ready Ambassador\nClosings\n\n\nHome of the Brave\n\n\nHome of the Brave Home\nBags for the brave\n\n\nStation\n\n\nStation Home\nPeople\nContact\nSchedule\nContest\nEEO Report\nTerms and Conditions\nCopyright\nPrivacy\nCareers\nNewsletter Sign Up\n\n\nGame Center\n\n\nGame Center Home\nDaily Crossword \nGuess Word \nJewel Block \nMicro Crossword\nClassic Sudoku \nWord Search\nNewsletter Sign Up\n\n\nMoney\n\n\nMoney Home\nDeposits\nInvesting\nMortgages\nLoans\nCredit Cards\nChime In\n\n\nTraffic\n\n\nTraffic Home\nRoad Work\n\n\nFox Eastern Carolina\n\n\nFox Eastern Carolina Home\nEEO\nWYDO FCC Info\nMemorials\n\n\nSports\n\n\nSports Home\nMore Sports\nThe Blitz\nScoreboard\nHigh School Sports\nTICKETS \nCity Guide\n\n\nFeatures\n\n\nFeatures Home\nTo The Rescue\nSinclair Cares\nPartner Spotlight \nFor Pet's Sake\nBlack History Honors\nSouper Bowl of Caring\n\n\nLegal\n\n\nTerms & Conditions\nCopyright Notices\nEEO Public File Report\nWCTI FCC Info\nWCTI FCC Applications\nWYDO FCC Info\nWYDO FCC Applications\nContact\nPublic File Assistance\nCareers\nContests\n\n\n\n\n\nACCESSIBILITY\n\n\n\n\n\n\n\n\nENC Holiday Events\nIt might feel like we just turned the calendar to 2025, but we've blinked a few times and entered the 2025 holiday season.\n\n\n\n\n\n11\n\nPlease ensure Javascript is enabled for purposes of website accessibility\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTrump administration tries to break through lock-in effect with 'portable mortgages'\n\n\nby AUSTIN DENEAN | The National News DeskFri, November 14, 2025 at 12:47 PM\n\n\n\n\n\n4VIEW ALL PHOTOS\n\nFILE - A for sale sign stands outside a home on the market in the Alamo Placita neighborhood Tuesday, Aug. 27, 2024, in central Denver. (AP Photo/David Zalubowski, File)\n\n\n\n\n\n0Comment\n\nShare\n\n\n\ntopics: \nMortgage rates\nPortable mortgages\nHousing affordability\nLock-in effect\nHomeownership\nHousing supply\nMortgage-backed securities\nTariffs\n\n\n\nWASHINGTON (TNND) — The Trump administration is considering another method to bring down soaring housing costs through mortgage rates that are pricing people out of homeownership and keeping homes from coming onto the market.\nFederal Housing Finance Agency director Bill Pulte said the administration is “actively evaluating “portable mortgages,” which would allow homebuyers to take their mortgage rate with them when they decide to move. The proposal is a direct bid to confront the so-called “lock-in effect,” where homeowners are unwilling or unable to part with their lower mortgage rate and keeping their home off the market.\nMany homeowners were able to buy or refinance during the pandemic for ultra-low rates at or below 3%, which cuts hundreds of dollars off a monthly mortgage payment. Rates have been stuck between 6 to 7% for the last several years, creating a barrier for homeowners to put their homes up for sale as they don’t want to take up a new loan at higher rates. More than half of homeowners with a mortgage have a rate below 4%, according to Redfin.\n\n\n\nHomes are changing hands at the lowest rate in decades in 2025 in a market that has been in a standstill for years as mortgage rates climbed and economic uncertainty set in. A Redfin analysis found only 2.8% of homes in the U.S. have turned over to a new owner in 2025.\n\n\n\n“Buyers are walking away from deals more often, sometimes due to affordability issues and sometimes because they’re re-evaluating whether now is the right moment to commit,” Redfin head of economic research Chen Zhao said in a release. “Others aren’t even shopping, waiting instead for prices or mortgage rates to come down. On the other side, many sellers are staying put—either because they’re locked into low rates or unwilling to accept offers below expectations.”\n\n\n\nAllowing people to take their mortgage rate with them to a new property could help boost the supply of existing homes on the market if more homeowners are willing to move with their lower rate.\nBut it could also come with higher list prices as more people enter a market with a limited pool of homes available to buy. Homeowners would also have an advantage on bidding compared to a new buyer who is working with today’s rates with more wiggle room in their budgets.\n“Anyone able to ‘port’ a 3% mortgage into a new purchase would effectively be bidding with cheap financing in a 6% world. That added purchasing power would push prices up, while renters and mortgage-free owners would still face today’s higher rates—only now with even higher list prices,” Jake Krimmel, a senior economist at Realtor.com, wrote in an analysis.\nPortable mortgages could also disrupt the U.S. mortgage system and lead to higher rates. Mortgage-backed securities, groups of mortgages that lenders sell to investors, would have their pricing models blown up and create more risk for investors as less loans are paid off early with more homeowners taking them with them when they move.\nPulte has also said officials are evaluating a plan to offer 50-year mortgages and how to make mortgages assumable, where homebuyers could take over a seller’s preexisting loan. Assumable mortgages are already available in the U.S. but are rarely used because they require a large cash payment or a second mortgage at current rates.\nThe 50-year mortgage could lower monthly payments by stretching out the term of the loan but would also likely come with higher rates and would ultimately cost buyers more in interest over the life of the loan and make it take longer to build equity.\n\n\n\nThe administration’s efforts to lower housing costs come as an increasing slice of Americans are being priced out of the market altogether with elevated mortgage rates and consistently growing list prices. Home values have climbed significantly compared to before the pandemic for both new and existing homes amid a lack of sufficient supply.\nA shortage of homes is widely seen as the biggest issue when it comes to tackling housing affordability in the United States. Construction cratered in the aftermath of the 2008 financial crisis and has struggled to recover to a sufficient level to meet the demand.\nHousing starts have slumped in 2025 as builders confront cost challenges and a stalled market. Higher rates are also a challenge for construction, which is also impacted by the rising cost of labor and materials.\nTariffs have been a double blow for builders, as the uncertainty around them has chilled activity in the housing market and broader economy. Import taxes have also increased the cost of materials used to build homes, making it more expensive for builders to start and complete projects.\nTariffs that went into effect last month imposed a 10% tax on all timber and lumber imports, along with a 25% tariff on kitchen cabinet and furniture. The U.S. imports about one-third of its lumber, primarily from Canada, that are also subject to further tariffs.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTrending\n\n\nKinston police ask public for help identifying woman in stolen credit card investigation\nThe Kinston Police Department is seeking the public's assistance in identifying a woman connected to a stolen credit card case.Anyone with information is urged\n\nGreenville woman arrested for assault with deadly weapon\nYorling Valdez-Medina, 33, was arrested on Friday, November 21 at 11:44 a.m. by Greenville police at the 2400 block of Charles Blvd. in Greenville, N.C. She fac\n\nCraven County arrests: Two charged in fentanyl and meth trafficking operation\nThe Craven County Sheriff's Office Special Investigation Bureau executed a search warrant at a motel in New Bern, on Wednesday, November 19, as part of an ongoi\n\n\n\n\n\nFootball star Demetrius Jones to give away free turkeys in Jacksonville \nJACKSONVILLE, Onslow County &mdash; Families in Jacksonville can pick up a free turkey on Monday, Nov. 24, thanks to former Northside High School and Charleston South\n\nSuspect identified in Speedway parking lot shooting; warrants issued for arrest\nGreenville Police have identified a suspect in a shooting Saturday night.According to a News Release, Greenville Police responded to a report of shots fired ar\n\n\n\n\n\n\n\nNEWS IN PHOTOS:\"Local\"\n\n\n11\n11 arrested in latest phase of Operation Find Out, totaling 39 arrests\n\n4\nSubtropical jet stream aligns with temperature line, bringing cloud cover to the northeast\n\n4\nFire breaks out at Sanuki Restaurant in New Bern\n\n3\nAmerican bully mix BamBam seeks loving home in Newport\n\n\n\n\n\n\nACCESSIBILITY\n\n\n\n\n\nDownload Our Mobile Apps:\n\n\n\n\nTerms & Conditions\nCopyright Notices\nEEO Public File Report\nWCTI FCC Info\nWCTI FCC Applications\nWYDO FCC Info\nWYDO FCC Applications\nContact\nPublic File Assistance\nCareers\nContests\n\n\nNews\nSports\nWeather\nStation\nContests\nGame Center\n\nPrivacy Policy\nCookie Policy\nDo Not Sell or Share\n\nCookie Preferences\n\n\n\n\n\n 2025 Sinclair, Inc.", "extraction_method": "jina", "word_count": 1950, "success": true}