{"full_text": "Trump on Saturday posted an image on social that seemed to suggest he would be proposing 50-year mortgages, something FHFA Director Bill Pulte confirmed shortly after on X.\nThe image Trump posted on Truth Social features a head shot of President Franklin Delano Roosevelt under the title 30-year mortgage, and his own head shot under a title of 50-year mortgage. Pulte then replied: “Thanks to President Trump, we are indeed working on The 50 year Mortgage – a complete game changer.”\nAs with other official announcements on social posts, there wasn’t a lot of detail provided and nothing has been posted on the White House press page as of this writing.\nThe president has been focused on the issue of housing affordability throughout his term, leading off on inauguration day with an executive order for emergency price relief in housing. He has also pressured Federal Reserve Chair Jerome Powell to lower interest rates and launched investigations against Fed members and tried to fire them to try to achieve lower rates.\nA longer fixed-rate amortization on mortgage loans would lower monthly payments. Using Fannie Mae‘s mortgage loan calculator with a 20% down payment and a mortgage rate of 6.575%, the breakdown below shows payments at different home prices and mortgage terms. This is just for principal and interest and doesn’t include property taxes or insurance. It also assumes the same interest rate for a longer-term loan, which is not a given.\n$300,00030-year fixed: $1,529 principal and interest 40-year fixed: $1,418 principal and interest50-year fixed: $1,366 principal and interest\n$400,00030-year fixed: $2,038 principal and interest40-year fixed: $1,891 principal and interest 50-year fixed: $1,822 principal and interest\n$500,00030-year fixed: $2,548 principal and interest40-year fixed: $2,363 principal and interest50-year fixed: $2,277 principal and interest\nWhile the longer mortgage term does reduce the monthly payment, it also reduces the amount of equity homeowners build and at some point, the savings are minimal — as you see between the 40- and 50-year terms above.\nThere is also a legal obstacle to a 50-year mortgage. After the great financial crisis, Congress passed the Dodd-Frank Wall Street Consumer Protection Act which made mortgage underwriting stricter. The Qualified Mortgage (QM) rule is part of that legislation and does not currently allow a 40- or 50-year mortgage, so that would have to be changed for this proposal to get widespread adoption. It’s possible that a 50-year mortgage could be offered by lenders as a non-QM mortgage, which typically comes with higher mortgage rates to balance out the risk.\nThe drop in equity is one reason HousingWire Lead Analyst Logan Mohtashami doesn’t like the idea.\n“I understand that we have housing affordability challenges in America, but subsidizing more demand from 30- to 50-year mortgages is not the policy we want to take now. Housing has to balance itself out through slowing home-price growth and wages increasing — as it has for many decades. To add another subsidization to the market just prevents that healing process from occurring, which also prevents less equity build out as well. So I am not a fan of any increasing in the amortization, the 30-year fixed is perfectly fine as is.\n“Additionally, a 50-year mortgage is currently illegal under the qualified mortgage law, so that would have to change as well,” Mohtashami said.\nRelated\nMore:\n30-Year Fixed Mortgage\nDonald Trump\nFederal Reserve", "extraction_method": "beautifulsoup", "word_count": 556, "success": true}