{"full_text": "Trump administration tries to break through lock-in effect with 'portable mortgages'NewsNewsSouthcentral California enjoys dry and sunny spell through Thanksgiving as fog lingersFOG PATTERN THIS WEEKSouthcentral California is looking at a much quieter weather pattern for most of this week, as a ridge of high pressure gradually builds inBakersfield police seek public's help to find missing 15-year-old boyThe Bakersfield Police Department is asking for the community’s help in finding a missing 15-year-old boy.Police said Jakai Phillips was last seen on November 2Two people rescued from vault in downtown BakersfieldThe Bakersfield Fire Department responded to a call around 1:25 a.m. Sunday Morning regarding two people found in a dumbwaiter-type vault at 1918 20th St.Toys for Tots event offers family fun at Cherry AcresCherry Acres in Bakersfield is hosting a Toys for Tots event on Saturday, Dec. 6, from 10 a.m. to 2 p.m.LocalNation & WorldEntertainmentOffbeatInvestigationsARC BakersfieldVideosTrafficHealth AlertAmazing AmericaConnect to CongressInside Your WorldBeyond The PodiumQuestion of the DaySpotlight on AmericaNews TeamNewsletter Sign-UpHealthy HomeFull Measure with Sharyl AttkissonDid You Know?Crisis in the ClassroomWeatherCurrent WeatherBakersfieldSunny57F62/46Today62/46Tuesday58/45Wednesday61/45Latest WeathercastLatest WeathercastRadarMapsSchool DelaysCamerasFeaturesFeaturesUS ready to launch more operations against VenezuelaThe U.S. is ready to launch more operations against Venezuela this week, Reuters reported over the weekend.Lizzo reveals she was 'suicidal' at the beginning of her weight loss journeyLizzo was in a low place at the start of her weight loss journey, feeling \"suicidal\" after a public scandal, all of which she channeled into healthier habits.Trump to visit Beijing in April, China's Xi invited for state visit next yearThe phone call came nearly one month after the two men met in person for the first time in six years.Jessica Simpson reveals Ashton Kutcher’s one-word response to her being a virgin at 22There’s one thing Jessica Simpson will never forget Ashton Kutcher’s response to her virginity. Back to SchoolHoliday Gift GuideMotor City MondaysSinclair CaresPartner SpotlightFor Pet's SakeOne Classroom at a TimeContestsSoarCommunity CalendarHometown SportsRetiring in AmericaMotivate Your MondaysMore Healthcare AdvicePet of the WeekJob AlertDrug Free KernWater SafetyEyewitness MorningsEyewitness MorningsTehachapi Valley Horse Rescue seeks community support for equine care missionThe Tehachapi Valley Horse Rescue, a nonprofit organization in Kern County, is calling on the community for support to continue its mission of caring for horsesTehachaPIE offering a homey feel and a wide selection of both sweet and savory optionsTehachapi's beloved bakery, TehachaPIE at Mill Kitchen, serves Kern County year round with a wide array of treats. But now that holiday season is knocking at thBakersfield Comic Con brings stars to Kern CountyBakersfield Comic Con returns to the Kern County FairCelebrate Hanukkah at the 8th Annual Eight Krazy Kilometers Walk and RunIn celebration of Hanukkah, the Bakersfield community is invited to the 8th Annual Eight Krazy Kilometers Walk and Run.The event is taking place at the PanoramaGame CenterGame CenterDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord Search WatchLiveNow57°Tue61°Wed64°SearchSearchUser IconWatchSearchNewsDown ArrowLocalNation & WorldEntertainmentOffbeatInvestigationsARC BakersfieldVideosTrafficHealth AlertAmazing AmericaConnect to CongressInside Your WorldBeyond The PodiumQuestion of the DaySpotlight on AmericaNews TeamNewsletter Sign-UpHealthy HomeFull Measure with Sharyl AttkissonDid You Know?Crisis in the ClassroomWeatherDown ArrowWeather HomeRadarMapsSchool DelaysCamerasFeaturesDown ArrowFeatures HomeBack to SchoolHoliday Gift GuideMotor City MondaysSinclair CaresPartner SpotlightFor Pet's SakeOne Classroom at a TimeContestsSoarCommunity CalendarHometown SportsRetiring in AmericaMotivate Your MondaysMore Healthcare AdvicePet of the WeekJob AlertDrug Free KernWater SafetyEyewitness MorningsGame CenterDown ArrowGame Center HomeDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic SudokuWord Search MoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsChime InObituariesNewsletter Sign UpKBAK-CBSDown ArrowKBAK-CBS HomeShowsScheduleNewsletter Sign UpFOX58Down ArrowFOX58 HomeScheduleShowsContactDown ArrowContactCareersScholarshipsSportsDown ArrowSports HomeHometown SportsCountdown to HometownHometown HerosTICKETSCity GuideLegalDown ArrowTerms & ConditionsCopyright NoticesEEO Public File ReportKBAK FCC InfoKBAK FCC ApplicationsKBFX FCC InfoKBFX FCC ApplicationsPublic File AssistanceContactNews TeamCareersConteststwitter iconfacebook iconACCESSIBILITYPlease ensure Javascript is enabled for purposes of website accessibilityTrump administration tries to break through lock-in effect with 'portable mortgages'by AUSTIN DENEAN | The National News DeskFri, November 14, 2025 at 9:47 AM4VIEW ALL PHOTOSFILE - A for sale sign stands outside a home on the market in the Alamo Placita neighborhood Tuesday, Aug. 27, 2024, in central Denver. (AP Photo/David Zalubowski, File)Comment on this story0CommentShare storySharetopics: Mortgage ratesPortable mortgagesHousing affordabilityLock-in effectHomeownershipHousing supplyMortgage-backed securitiesTariffsWASHINGTON (TNND) — The Trump administration is considering another method to bring down soaring housing costs through mortgage rates that are pricing people out of homeownership and keeping homes from coming onto the market.Federal Housing Finance Agency director Bill Pulte said the administration is “actively evaluating “portable mortgages,” which would allow homebuyers to take their mortgage rate with them when they decide to move. The proposal is a direct bid to confront the so-called “lock-in effect,” where homeowners are unwilling or unable to part with their lower mortgage rate and keeping their home off the market.Many homeowners were able to buy or refinance during the pandemic for ultra-low rates at or below 3%, which cuts hundreds of dollars off a monthly mortgage payment. Rates have been stuck between 6 to 7% for the last several years, creating a barrier for homeowners to put their homes up for sale as they don’t want to take up a new loan at higher rates. More than half of homeowners with a mortgage have a rate below 4%, according to Redfin.Homes are changing hands at the lowest rate in decades in 2025 in a market that has been in a standstill for years as mortgage rates climbed and economic uncertainty set in. A Redfin analysis found only 2.8% of homes in the U.S. have turned over to a new owner in 2025.“Buyers are walking away from deals more often, sometimes due to affordability issues and sometimes because they’re re-evaluating whether now is the right moment to commit,” Redfin head of economic research Chen Zhao said in a release. “Others aren’t even shopping, waiting instead for prices or mortgage rates to come down. On the other side, many sellers are staying put—either because they’re locked into low rates or unwilling to accept offers below expectations.”Allowing people to take their mortgage rate with them to a new property could help boost the supply of existing homes on the market if more homeowners are willing to move with their lower rate.But it could also come with higher list prices as more people enter a market with a limited pool of homes available to buy. Homeowners would also have an advantage on bidding compared to a new buyer who is working with today’s rates with more wiggle room in their budgets.“Anyone able to ‘port’ a 3% mortgage into a new purchase would effectively be bidding with cheap financing in a 6% world. That added purchasing power would push prices up, while renters and mortgage-free owners would still face today’s higher rates—only now with even higher list prices,” Jake Krimmel, a senior economist at Realtor.com, wrote in an analysis.Portable mortgages could also disrupt the U.S. mortgage system and lead to higher rates. Mortgage-backed securities, groups of mortgages that lenders sell to investors, would have their pricing models blown up and create more risk for investors as less loans are paid off early with more homeowners taking them with them when they move.Pulte has also said officials are evaluating a plan to offer 50-year mortgages and how to make mortgages assumable, where homebuyers could take over a seller’s preexisting loan. Assumable mortgages are already available in the U.S. but are rarely used because they require a large cash payment or a second mortgage at current rates.The 50-year mortgage could lower monthly payments by stretching out the term of the loan but would also likely come with higher rates and would ultimately cost buyers more in interest over the life of the loan and make it take longer to build equity.The administration’s efforts to lower housing costs come as an increasing slice of Americans are being priced out of the market altogether with elevated mortgage rates and consistently growing list prices. Home values have climbed significantly compared to before the pandemic for both new and existing homes amid a lack of sufficient supply.A shortage of homes is widely seen as the biggest issue when it comes to tackling housing affordability in the United States. Construction cratered in the aftermath of the 2008 financial crisis and has struggled to recover to a sufficient level to meet the demand.Housing starts have slumped in 2025 as builders confront cost challenges and a stalled market. Higher rates are also a challenge for construction, which is also impacted by the rising cost of labor and materials.Tariffs have been a double blow for builders, as the uncertainty around them has chilled activity in the housing market and broader economy. Import taxes have also increased the cost of materials used to build homes, making it more expensive for builders to start and complete projects.Tariffs that went into effect last month imposed a 10% tax on all timber and lumber imports, along with a 25% tariff on kitchen cabinet and furniture. The U.S. imports about one-third of its lumber, primarily from Canada, that are also subject to further tariffs.TrendingTwo people rescued from vault in downtown BakersfieldThe Bakersfield Fire Department responded to a call around 1:25 a.m. Sunday Morning regarding two people found in a dumbwaiter-type vault at 1918 20th St.Kern County prepares for an extended dry spell as Pacific ridging deflects storm tracksFor the first time since the first half of this month, Kern County is expecting an extended period of dry weather - lasting more than several hours!Pacific ridgMan found shot and killed inside east Bakersfield homeThere is significant presence of Kern County Sheriff's deputies at 2743 Center St. in east Bakersfield.The reason for the heavy law enforcement activity remainOff-roading crash near Arvin leaves one dead, another hospitalizedOne passenger died, and a driver is hospitalized after a solo-vehicle crash with an off-road vehicle in Arvin, Saturday afternoon.The California Highway Patrol Hard Rock Casino Tejon celebrates two major jackpots totaling over $260,000The winning streak at Hard Rock Casino Tejon continued Saturday night as two guests hit life-changing jackpots totaling more than $260,000.NEWS IN PHOTOS:\"Local\"3Toys for Tots event offers family fun at Cherry Acres3Hard Rock Casino Tejon celebrates two major jackpots totaling over $260,0004Man found shot and killed inside east Bakersfield home5Off-roading crash near Arvin leaves one dead, another hospitalizedACCESSIBILITYDownload Our Mobile Apps:Terms & ConditionsCopyright NoticesEEO Public File ReportKBAK FCC InfoKBAK FCC ApplicationsKBFX FCC InfoKBFX FCC ApplicationsPublic File AssistanceContactNews TeamCareersContestsNewsWeatherSportsGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1692, "success": true}