{"full_text": "Featured\nSan Francisco mayor proposes denser housing to tackle affordability crisis\nBy JANIE HAR Associated Press\nOct 30, 2025\nOct 30, 2025\nUpdated\nOct 30, 2025\n0\nFacebook\nTwitter\nWhatsApp\nSMS\nEmail\nLinkedin\nAn aerial view of the San Francisco.\nReuters\nFacebook\nTwitter\nWhatsApp\nSMS\nEmail\nPrint\nCopy article link\nSave\nLinkedin\nSAN FRANCISCO (AP) — San Francisco Mayor Daniel Lurie is trying to get more homes built for people like Liam Murphy: a fifth-generation city kid who found himself repeatedly outbid for tiny two-bedroom houses that wound up selling for $1.6 million.Murphy, 39, now lives about an hour's drive away from his job as a San Francisco firefighter. He says it's too late for his family to move back, but he hopes others can stay in a city where the average monthly rent for a one-bedroom is $3,500.\"That would just make for a better city overall,\" said Murphy, \"and the reason is because city kids just grow up being exposed to more. They're exposed to all the cultures of San Francisco, which makes a more well-rounded person.\"Tiny, colorful San Francisco — just seven miles squared — embraces its image as a city that welcomes all. But its inability to build more housing has made it one of the world's toughest places to find a home, risking the diversity it prides itself on.Epithets are hurled at the mayorLurie hopes to change that, with a plan to allow for denser and taller buildings throughout much of the city, including the west side Sunset neighborhood of single-family homes and the tourist friendly Haight-Ashbury, which is studded with classic Victorian and Edwardian homes.The issue has roiled the city, and threats of recall loom over San Francisco supervisors who go along with Lurie. At a recent housing rally, the mayor who won a rare reprieve from President Donald Trump's threats to send in federal forces struggled to be heard over angry chants of \"shame!\" and \"liar.\"Protesters demanded the city invest in 100% below-market rate housing and accused him of being a gentrifier and a Republican.\"I truly believe that this has San Franciscans' best interests at heart. Are some people going to be fearful? Absolutely. I get it. Change is scary,\" said Lurie, who is a centrist Democrat. \"But the status quo is not working. There's an affordability crisis right now.\"Democrats vs DemocratsThe city's estimated 830,000 residents are passionate over both land use and equity. Housing projects have died as pressure to create more affordable units made potential developments unprofitable. Residents also want their stunning views.But San Francisco is under pressure from the state to adopt a new zoning plan allowing for 36,000 more homes by 2031 — or else the state will decide what gets built where — and the mayor likely has the votes to pass his \"Family Zoning Plan.\"Supporters say it's a matter of supply and demand, and that more homes will bring down the overall cost of housing.Critics say such trickle-down economics will not work in a city like San Francisco, which is in such global demand that some foreign investors buy properties sight-unseen. They say developers will only build luxury housing that's too costly for most workers, while displacing tenants and destroying the character of entire neighborhoods.\"There's a herd of elephants in the room that no one will address,\" says Eric Jaye, a Democratic political consultant who opposes the plan.A city 'for people who didn't love cities'Much of the housing push has come from Democrats, including a former city mayor, Gov. Gavin Newsom, who signed into law a proposal by San Francisco state Sen. Scott Wiener to build more homes near transit.\nRecommended for you\nThe city has made enormous strides in recent years, with whole districts of tall condo buildings cropping up around downtown, says Rafael Mandelman, president of the Board of Supervisors. But he acknowledges that people come to San Francisco for its more intimate neighborhoods and access to green space.\"San Francisco, historically, was the city for people who didn't love cities,\" Mandelman said.Katherine Roberts, 72, initially welcomed construction of an affordable housing complex near the three-story Edwardian she labored to buy in the Haight-Ashbury neighborhood two decades ago.But at 160 units and eight stories high, the massive building has shattered her peace of mind, dominating her view.\"I'm looking out and it's like I'm living in East Germany. How can you build something this inappropriate in a historic neighborhood like the Haight-Ashbury?\" Roberts said. \"What about all the people who already live here? What are we supposed to do?\"Proposal calls for denser homesFor the most part, the new zoning plan allows for more housing to be packed into the space of a single-family home — say a duplex with a studio — without exceeding the city's height limit of roughly four stories for such properties. At least 15% of new housing must be below-market rate.Buildings on neighborhood commercial corridors could double to eight stories. Busier thoroughfares could see high-rises of 10 stories and more, and in a few spots, on Van Ness Avenue, heights could hit 650 feet (200 meters), rivaling some downtown skyscrapers.Passage of Lurie's proposal won't necessarily lead to more homes in a city with high labor and construction costs and \"notoriously complex and cumbersome\" approval processes, as the state said in a scathing 2023 review.And so city dwellers make do with overcrowded — and sometimes awkward — living situations.Laura Foote, executive director of \"yes in my backyard\" YIMBY Action, wound up living with the man who is now her husband — and the woman he was divorcing — in a one-bedroom apartment for about six months, until his ex could find another rental.\"We didn't kill each other,\" Foote said, \"but it went on longer than it would have in a well-functioning housing market.\"Mayor's plan is likely to passSupervisors are still negotiating amendments to the zoning plan, which could be voted out of committee on Monday for consideration by the full board. Some supervisors want to exempt historic properties, or all buildings currently used for housing. The mayor agreed to exempt buildings with at least three rent-controlled units.The compromise was a major relief for Phyllis Nabhan, 78, who lives in the Richmond neighborhood, between the Golden Gate Bridge and Golden Gate Park. She fears becoming homeless if a developer scoops up the property she's called home for 47 years, starting with a rent of just $350 a month.But Nabhan still objects to the proposal. She says it would ruin her neighborhood's \"cozy and wonderful\" feel, and blames the state for forcing the city to change.\"I think that this mayor is trying,\" she said. \"It's a horrible job, I wouldn't want to be mayor.\"\nFacebook\nTwitter\nWhatsApp\nSMS\nEmail\nPrint\nCopy article link\nSave\nLinkedin\nTags\nSan Francisco\nRafael Mandelman\nHaight-ashbury\nDemocratic Party (united States)\nAffordable Housing\nPolitics\nScott Wiener\nRecommended for you\n×\nPost a comment as Guest\nEmoticons\n[smile]\n[beam]\n[wink]\n[sad]\n[cool]\n[innocent]\n[rolleyes]\n[whistling]\n[lol]\n[huh]\n[tongue]\n[love]\n[sleeping]\n[yawn]\n[unsure]\n[angry]\n[blink]\n[crying]\n[ohmy]\n[scared]\n[sleep]\n[sneaky]\n[tongue_smile]\n[thumbdown]\n[thumbup]\n[censored]\n[happybirthday]\n[ban]\n[spam]\n[offtopic]\n[batman]\n[ninja]\n[pirate]\n[alien]\nComment Text\nCancel\nPost comment\n×\nReport\nCancel\nReport Abuse\n×\nWatch this discussion.\nStop watching this discussion.\nWatch this discussion\nGet an email notification whenever someone contributes to the discussion\nNotifications from this discussion will be disabled.\nCancel\nStart watching\nStop watching\n(0) comments\nWelcome to the discussion.\nLog In\nKeep the discussion civilized. Absolutely NO\npersonal attacks or insults directed toward writers, nor others who\nmake comments.\nKeep it clean. Please avoid obscene, vulgar, lewd,\nracist or sexually-oriented language.\nDon't threaten. Threats of harming another\nperson will not be tolerated.\nBe truthful. Don't knowingly lie about anyone\nor anything.\nBe proactive. Use the 'Report' link on\neach comment to let us know of abusive posts.\nPLEASE TURN OFF YOUR CAPS LOCK.\nAnyone violating these rules will be issued a\nwarning. After the warning, comment privileges can be\nrevoked.\nPost a comment\nWatch this discussion.\nStop watching this discussion.\nThank you for visiting the Daily Journal.\nPlease purchase a Premium Subscription to continue reading.\nTo continue, please log in, or sign up for a new account.\nWe offer one free story view per month. If you register for an account, you will get two additional story views. After those three total views, we ask that you support us with a subscription.\nA subscription to our digital content is so much more than just access to our valuable content. It means you’re helping to support a local community institution that has, from its very start, supported the betterment of our society. Thank you very much!\nSign Up\nLog In\nPurchase a Subscription\nWant to join the discussion?\nOnly subscribers can view and post comments on articles.\nSubscribe Today\nAlready a subscriber? Login Here\nTrending Stories\nArticles\nImages\nVideos\nCommented\nArticlesSerra can’t deny Riordan’s destinySan Mateo County buys property for affordable housingCapelo’s Barbecue brings Texas flavors to Redwood CitySan Mateo County Sheriff Ken Binder reflects on his 1st few days in officeCollege of San Mateo professor explains the worlds beyond oursMillbrae could be getting T&T SupermarketAlleged drunk driving crash causes Belmont power outagesSequoia volleyball: Nor Cal champs!Brewing with Brothas opens brewery, taproom in BelmontSan Mateo OKs modest tenant protection plan\nImages\nVideos\nCommentedFor God and country (17)Populism is winning on both left and right (11)Trump’s demolition (10)Our community needs the PCE Community Advisory Committee (10)California sees revenue uptick, but not enough to erase its chronic budget deficit (9)Bad idea right? (9)Chaplains of the Empire? (9)Voter-approved countermeasure (8)San Mateo County proposal targets ICE (8)White House has changed over the years (8)Dick Cheney, one of the most powerful and polarizing vice presidents in US history, dies at 84 (7)State Sen. Josh Becker, D-Menlo Park, attends COP30 (7)Who owns White House? It is the people’s house (7)Hillsdale Mall redevelopment: Why San Mateo needs to pay attention now (7)Coming to democracy’s aid (6)Don’t blame Joe Biden (6)The shame is apparent (6)‘It has been an odyssey’ (6)The case for eviction protections now (5)Hope for peace (5)We can build a better outcome (4)Readers deserve clarity (4)Why I voted yes (4)A public servant’s perspective on Congress (4)Local legislators warn of shutdown impacts in San Mateo County (4)Proposition 50 is about consolidating power (4)San Mateo City Council weighs in on Hillsdale redevelopment (4)Transparency (3)Are you eager to hear some positive news about our world? (3)Building a better world (3)Bike lanes generate an endless debate (3)Cyclist, driver collision in Foster City (3)Kindness begets kindness (3)More on Proposition 50 (3)Appointing a new sheriff the right approach (3)King Center cannot take a back seat  (3)Remembering (3)San Mateo County ups immigrant protection (3)E-bike coalition (3)New regional push to reduce gas use (3)Caltrain nixes Clipper discount (3)For whom is this column written? (3)Tony Pereira and the power of a bicycle (3)Interior decorator needed (3)Dangerous honeymoon (3)Who owns the White House? (3)Insanity (3)Facts (3)Why so many redundant car lanes? (3)Strange bedfellows (3)Where did starter homes go in San Mateo County? (3)Notes, quotes and chaos motes (3)San Mateo County Democrats vote no on ending shutdown (2)This spider has found itself a mobile home (2)Acting on impulse (2)All God’s children? (2)Mullin questions data center impact on residential power bills  (2)New senior housing in Burlingame in works (2)How the federal shutdown hurts students seeking financial aid (2)Sneaky sugars leading poor health outcomes (2)Carlos Bolanos (2)Ukraine's allies push back on a US peace plan seen as favoring Moscow (2)The journey of navigating my Taiwanese identity (2)California revokes 17,000 commercial driver's licenses for immigrants (2)Protecting dignity at life’s end: Life Preservation Act (2)San Mateo County Board of Supervisors OK one-time grant toward food aid (2)Belmont OKs controversial development (2)Study finds EVs quickly overcome their energy-intensive build to be cleaner than gas cars (2)South City El Camino Real upgrades may reduce vehicle lanes (2)Why Foster City’s children need e-bike education now (2)Trump threatens to sue BBC over edited speech that sparked resignations by news bosses (2)College enrollment plateaus (1)El Camino Real upgrade could cost $30M-$50M in Millbrae (1)Trump, like Biden before him, finds there's no quick fix on inflation (1)Few Prop 36 offenders in treatment (1)San Mateo should revisit tenant protections (1)Border Patrol is monitoring US drivers and detaining those with 'suspicious' travel patterns (1)Your sign to read more (1)Even California’s iconic industries are cutting back in this sluggish economy (1)That’s me all over (1)Population increase about money (1)Division doesn’t mean wrong (1)The new difficulty of buying a Caltrain ticket (1)At 22, hairstylist opens own salon in San Carlos (1)College of San Mateo professor explains the worlds beyond ours (1)Trump says stopping suspected drug boats doesn't work. But the US reports record cocaine seizures (1)Cal Fire burn of chaparral increases flammability  (1)Government shutdown cancels some events for Veterans Day (1)San Mateo County steps up to help (1)E-bike trainings educate students — and maybe help quell controversy (1)Permits extended for San Carlos townhomes (1)The mall is changing (1)Failure to protect residents (1)SamTrans keeping close eye on structural deficit (1)San Mateo letter-writing campaign keeps connection to 101st Airborne Division (1)Cookie Monster is a phonics fan too (1)ACA cuts lifting costs for 22K in San Mateo County (1)The beauty of 6-7 (1)\nFeatured Events\nCalendar\nContributed free all ages Sponsored\n17th Annual Colony of Coastside Artists (CoCA) Open Studios Tour\nThis event occurred on\nSaturday, November 22nd, 2025\n@ 10:00 am\n–\n5:00 pm\nCoCA Open Studios\nFree\nFacebook\nTwitter\nWhatsApp\nSMS\nEmail\nLinkedin\nThe 17th Annual Colony of Coastside Artists (CoCA) Open Studios tour returns this weekend to… Read more17th Annual Colony of Coastside Artists (CoCA) Open Studios Tour\nCalendar\nContributed family friendly for kids for teens seniors accessible all ages date night Sponsored\nRodger's & Hammerstein's Cinderella\nThursday, December 4th, 2025\n@ 8:00 pm\nHillbarn Theatre\n$32-$62\nFacebook\nTwitter\nWhatsApp\nSMS\nEmail\nLinkedin\n“A dazzling delight for all ages”\nRead moreRodger's & Hammerstein's Cinderella\nLatest News\nBrandon Ingram scores season-high 37 points as Raptors beat Cavaliers 110-99 for 8th straight win\nChychrun scores twice to lift Capitals over Blue Jackets 5-1\nPentagon says it's investigating Mark Kelly over video urging troops to defy 'illegal orders'\nLurie announces $40M federal funding for new hybrid mini-buses in San Francisco\nDefense leads the way for No. 6 Louisville in 87-46 rout of Eastern Michigan\nSharp and Uzan shine in OT as No. 3 Houston outlasts Syracuse 78-74 at Players Era\nIt's a bird! It's a plane! It's a rare Superman comic book! And it fetched $9.12M!\nGramma the Galápagos tortoise, oldest resident of San Diego Zoo, dies at about 141\nRecent Comments on our Stories\neasygerd\nsaid:\nSan Mateo County and its Board of Education owns the richest schools in the country.They could have started offering Universal Preschool for t…\nView more\nMichKosk\nsaid:\nUniversal preschool programs have been failures. Studies will twist data to show benefits, but most gains fade by the 3rd grade. The long term…\nView more\neasygerd\nsaid:\nThese European countries had a contract with the US. For the longest time these European and Asian countries didn't want a strong Germany, Ita…\nView more\nDirk van Ulden\nsaid:\neasygerd - I did not intend to insult you but I do not agree with your premises. The European countries were able to finance their social welf…\nView more\neasygerd\nsaid:\nTBot, the \"stock market\" isn't Capitalism, the Stock Market is a Casino, where unregulated hedge fund managers are running one con job after a…\nView more\nLatest e-Edition\nSan Mateo Daily Journal\nTo view our latest e-Edition click the image on the left.\nThe Daily Journal in your inbox\nSuccess! An email has been sent to\nwith a link to confirm list signup.\nError! There was an error processing your request.\nBreaking News\nIf it breaks, we'll send it to you.\nJoin this email list to be kept abreast of breaking news.\nSign up today!\nDaily Headlines\nWake up to our carefully curated list of headlines with the Daily Journal's daily newsletter.\nAll the top stories -- local news, local sports, lifestyle, opinions, obituaries, entertainment, plus regional/national/global info to keep you informed. Newsletter arrives every morning for your convenience.\nSign up today!\nMarketing and Business Intelligence\nWould you like to receive our Marketing and Business Intelligence newsletter? The Daily Journal is proud to offer a newsletter providing vital information that will benefit your career, your business, and/or your organization.\nDaily Journal Sports\nGet updates on LOCAL SPORTS!\nAll the latest and greatest local sports headlines straight to your inbox. Every Monday, Wednesday and Friday morning, the Daily Journal will send you links to our best local sports stories.\nSign up now!\nYou must select at least one email list.\nPlease enter a valid email address.\nSign up\nManage your lists\nSubmit An Event\nIf you have an event you'd like to list on the site, submit it now!\nGo to form\nCalendar\n​\n​\nBrowse\nToday's events\nSubmit\nLatest Classified Ads\nVintage copper milk can.\n22 \" tall\nPioneer Laser Disc unit, works. And ~20 laser disc movies\nHonda F1 EU7000is Generator\nCHAINEY HAULING Junk & Debris Clean Up\nRICHARD’S HANDYMAN\nMy Junk removal and Cleaning service\nFor sale 4 pairs of skis for sale in excellent condition\nMarco’s Janitorial Services\nBulletin\nStocks\nMarket Data by TradingView", "extraction_method": "beautifulsoup", "word_count": 2862, "success": true}