{"full_text": "Investors purchasing entry-level homes in some markets may be hindering affordability for first-time and entry-level homebuyers, according to a report from Realtor.com released Thursday.\nTo craft its Mid-year Investor Report, Realtor.com examined deed records from January 2000 to July 2025 on a national, state and large metro-level. The report only included single-family homes, condos, townhomes and row houses.\nAccording to the report, 10.8% of all homes purchased in Q2 2025 were bought by real estate investors, up 0.1 percentage point compared to a year prior. However, this is still below the peak of 12.1% reported in Q2 2022. In total, during the first half of 2025, investors purchased roughly 257,000 homes, down 1.8% year-over-year. Overall home sales fell by 3.8% during the same time period.\nReal estate investors are buying more than selling\nOn the sell side, investors sold 9.2% of all homes sold in Q2 2025, the same as a year ago.\nIn total, investors purchased roughly 41, 000 more homes than they sold during the first half of 2025. This gap is 10.8% wider than the first half of 2024, which the report attributes to easing investor selling activity. Overall, since the onset of the COVID-19 pandemic, investors have purchase roughly 726,000 more homes than they have sold, which the report claims has put pressure on the homeownership rate.\nMissouri, Mississippi lead investor activity\nThe state with the highest share of investor buyers was Missouri at 18.9%, followed by Mississippi (17.1%), and Nevada (15.4%). On a metro level-basis, of the 50 largest metros Memphis, TN-MS-AR had the largest share or investor activity at 25.2%, up 4.7% annually. St. Louis, MO-KS came second with 20.6% followed by Kansas City, MO-KS at 19.3%. Of the top-10 metros, Columbus, Ohio saw the largest annual increase in investor purchaser activity at 6.0%.\nIn Michigan (-53.1%), Maryland (-45.4%), and Virginia (-45.0%) investors tend to purchase properties below the median market purchase price, while in Montana (+35.1%), Utah (+33.7%), and California (+23.3%), investors paid the largest premiums.\nOn the metro level, the typical investor purchase price was much lower than the market median in Detroit (-58.0%), Pittsburgh (-52.7%), and Baltimore (-52.0%). In contrast, investors paid the highest home premiums in Los Angeles (+19.8%), San Diego (+9.2%), and New York City (+8.7%).\nAccording to the report, in the states and metros where investors are purchasing homes far below the median price point, they are competing with entry-level homebuyers, which could potentially increase affordability stress on these types of homebuyers\nOverall, during the second quarter of 2025, the typical investor purchased a home for $287,000, more than $80,000 below the national median sale price.\nWhen it comes to investor size, the share of small real estate investors purchasing homes reached its highest level since 2007 during the first half of 2025, with small investors accounting for 62.5% of all investor purchases. Meanwhile, medium investors accounted for 17.6% of all purchases and large investors accounted for 19.8% of purchases. According to the report, this drop off in the share of large investor purchases began in 2022.\nLooking ahead, due to greater economic uncertainty, Realtor.com believes that investors are likely to focus on markets that offer a combination of affordability and steady housing demand.\nRelated\nMore:\nInvestment Properties\nInvestor\nRealtor.com", "extraction_method": "beautifulsoup", "word_count": 542, "success": true}