{"full_text": "Trump administration tries to break through lock-in effect with 'portable mortgages'NewsNewsDA: Human trafficking charges to be filed in Taylor Twp. child sex ring investigationProsecutors in Centre County say more charges are expected to be filed this week in connection to the alleged child sex abuse ring that was uncovered in Taylor PSP: Man killed in two-vehicle, head-on crash in Warriors Mark Twp.State police say one man was killed Saturday afternoon in a two-vehicle crash in Warriors Mark Township, Huntingdon County.According to a crash report, troopersClearfield County unveils new bell ahead of United States' 250th birthdayClearfield County unveils new bell ahead of United States' 250th birthdayCommunity unites at benefit concert to support local food pantry amid growing needCommunity unites at benefit concert to support local food pantry amid growing needLocalNation & WorldEntertainmentOffbeatElectionElection ResultsVideosConnect to CongressStateAmazing AmericaArmstrong Army StrongBeyond The PodiumSky View 6Question of the DaySpotlight on AmericaFull Measure with Sharyl AttkissonOpioid EpidemicAddicted AmericaCrisis in the classroomTown HallWJAC 75th AnniversaryThe Great Johnstown Flood: 135 Years LaterNews AppWeatherCurrent WeatherJohnstownPartly Cloudy49F51/41Today51/41Tuesday48/48Wednesday54/27Latest WeathercastLatest WeathercastRadarMapsHurricane TrackerClosingsSevere Weather Team 6 Weather EyeWeather AppWalker’s Weather WiseSportsSportsWith Aaron Rodgers sidelined, Mason Rudolph & Steelers fall short in ChicagoOn this trip to Chicago, Aaron Rodgers was just a spectator at Soldier Field. Mason Rudolph tried to rally Pittsburgh to a late win, but it didn’t work out.RodgKaytron Allen becomes Penn State’s all-time rushing leader in blowout victory vs HuskersKaytron Allen ran for 160 yards and two touchdowns, and Penn State’s defense played its best game of the season to keep the Nittany Lions’ bowl hopes alive withScores & Highlights | 2025 High School Football Playoffs: Week 142025 HS football playoffs: Week 14Friday, Nov. 21st (all kickoff times set for 7pm, unless otherwise noted)Class 1A quarterfinal:Westinghouse 6 vs Bishop GuilfoIndiana's Fernando Mendoza hears the Heisman hypeIndiana University QB Fernando Mendoza discusses his Heisman Trophy candidacy, remaining focused on the next game and following his brother to the Hoosier stateLocal and Regional SportsSteelersPenn StatePittNational SportsScoreboardFriday Football FinalScholar AthletesFriday Night RivalsTICKETSCity GuideTeacher AppreciationFeaturesFeaturesTrump to visit Beijing in April, China's Xi invited for state visit next yearThe phone call came nearly one month after the two men met in person for the first time in six years.With Aaron Rodgers sidelined, Mason Rudolph & Steelers fall short in ChicagoOn this trip to Chicago, Aaron Rodgers was just a spectator at Soldier Field. Mason Rudolph tried to rally Pittsburgh to a late win, but it didn’t work out.RodgKaytron Allen becomes Penn State’s all-time rushing leader in blowout victory vs HuskersKaytron Allen ran for 160 yards and two touchdowns, and Penn State’s defense played its best game of the season to keep the Nittany Lions’ bowl hopes alive withJessica Simpson reveals Ashton Kutcher’s one-word response to her being a virgin at 22There’s one thing Jessica Simpson will never forget Ashton Kutcher’s response to her virginity. Curb Appeal & CocktailsMonday Health MinuteSinclair CaresPartner SpotlightHealthy LivingFor Pet's SakeFur-ever FriendsContestsTravel with WJAC and Epic Journeys Kindness CountsBreast Cancer AwarenessHospice, Palliative Care, and Home Health MonthBack to Work WednesdayEducation MattersRoad Trippin' PAYour place inside and out Staying AwareClassic Christmas CartoonsMotivate Your MondayMoney CentsOpioid Town HallScholarship OpportunitiesFit FridaysRV LifeSenior LivingFinding ForeverGame CenterGame CenterDaily Crossword Guess Word Jewel Block Micro CrosswordClassic Sudoku Word SearchWatchLiveNow49°Tue47°Wed52°SearchSearchUser IconWatchSearchNewsDown ArrowLocalNation & WorldEntertainmentOffbeatElectionElection ResultsVideosConnect to CongressStateAmazing AmericaArmstrong Army StrongBeyond The PodiumSky View 6Question of the DaySpotlight on AmericaFull Measure with Sharyl AttkissonOpioid EpidemicAddicted AmericaCrisis in the classroomTown HallWJAC 75th AnniversaryThe Great Johnstown Flood: 135 Years LaterNews AppWeatherDown ArrowWeather HomeRadarMapsHurricane TrackerClosingsSevere Weather Team 6 Weather EyeWeather AppWalker’s Weather WiseSportsDown ArrowSports HomeLocal and Regional SportsSteelersPenn StatePittNational SportsScoreboardFriday Football FinalScholar AthletesFriday Night RivalsTICKETSCity GuideTeacher AppreciationFeaturesDown ArrowFeatures HomeCurb Appeal & CocktailsMonday Health MinuteSinclair CaresPartner SpotlightHealthy LivingFor Pet's SakeFur-ever FriendsContestsTravel with WJAC and Epic Journeys Kindness CountsBreast Cancer AwarenessHospice, Palliative Care, and Home Health MonthBack to Work WednesdayEducation MattersRoad Trippin' PAYour place inside and out Staying AwareClassic Christmas CartoonsMotivate Your MondayMoney CentsOpioid Town HallScholarship OpportunitiesFit FridaysRV LifeSenior LivingFinding ForeverGame CenterDown ArrowGame Center HomeDaily Crossword Guess Word Jewel Block Micro CrosswordClassic Sudoku Word SearchMoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsChime InMemorialsStationDown ArrowStation HomeContactPeopleCareersScheduleAdvertiseText AlertsYour TownNewsletter Sign UpSnow DazeBroadcast Diversity ScholarshipMeet the Sales TeamFanZoneDown ArrowFanZone HomeAltoona LionsBald Eagle Bald EaglesBedford BisonsBellefonte RaidersBellwood-Antis Blue DevilsBerlin Brothersvalley MountaineersBishop Carroll HuskiesBishop Guilfoyle MaraudersBishop McCort CrushersBlacklick Valley VikingsBlairsville BobcatsBrockway RoversBrookville RaidersCambria Heights HighlandersCameron County RaidersCentral Cambria Red DevilsCentral Scarlet DragonsChestnut Ridge LionsClaysburg-Kimmel BulldogsClearfield BisonsConemaugh Township IndiansConemaugh Valley BlueJaysCurwensville Golden TideDubois Area BeaversElk County Catholic CrusadersEverett Area WarriorsFerndale Yellow JacketsForest Hills RangersGlendale VikingsGreater Johnstown TrojansHollidaysburg Golden TigersHuntingdon BearcatsJuniata Valley HornetsMeyersdale Red RaidersMoshannon Valley Black KnightsMount Union TrojansNorth Star CougarsNorthern Bedford PanthersNorthern Cambria ColtsPenn Cambria PanthersPenns Valley RamsPhilipsburg-Osceola MountiesPortage Area MustangsPunxsutawney ChucksRichland RamsRidgway/Johnsonburg ElkersSaint Joseph's WolvesShade PanthersSomerset Golden EaglesSouthern Huntingdon RocketsSt. Mary’s Flying DutchState College Little LionsTussey Mountain TitansTyrone Golden EaglesUnited LionsWest Branch WarriorsWestmont Hilltop HilltoppersWilliamsburg Blue PiratesWindber RamblersContestsNewsletter Sign UpLegalDown ArrowTerms & ConditionsCopyright NoticesEEO Public File ReportFCC InfoFCC ApplicationsPublic File AssistanceContactNews TeamCareersConteststwitter iconfacebook iconACCESSIBILITYPlease ensure Javascript is enabled for purposes of website accessibilityTrump administration tries to break through lock-in effect with 'portable mortgages'by AUSTIN DENEAN | The National News DeskFri, November 14, 2025 at 12:47 PM4VIEW ALL PHOTOSFILE - A for sale sign stands outside a home on the market in the Alamo Placita neighborhood Tuesday, Aug. 27, 2024, in central Denver. (AP Photo/David Zalubowski, File)Comment on this story0CommentShare storySharetopics: Mortgage ratesPortable mortgagesHousing affordabilityLock-in effectHomeownershipHousing supplyMortgage-backed securitiesTariffsWASHINGTON (TNND) — The Trump administration is considering another method to bring down soaring housing costs through mortgage rates that are pricing people out of homeownership and keeping homes from coming onto the market.Federal Housing Finance Agency director Bill Pulte said the administration is “actively evaluating “portable mortgages,” which would allow homebuyers to take their mortgage rate with them when they decide to move. The proposal is a direct bid to confront the so-called “lock-in effect,” where homeowners are unwilling or unable to part with their lower mortgage rate and keeping their home off the market.Many homeowners were able to buy or refinance during the pandemic for ultra-low rates at or below 3%, which cuts hundreds of dollars off a monthly mortgage payment. Rates have been stuck between 6 to 7% for the last several years, creating a barrier for homeowners to put their homes up for sale as they don’t want to take up a new loan at higher rates. More than half of homeowners with a mortgage have a rate below 4%, according to Redfin.Homes are changing hands at the lowest rate in decades in 2025 in a market that has been in a standstill for years as mortgage rates climbed and economic uncertainty set in. A Redfin analysis found only 2.8% of homes in the U.S. have turned over to a new owner in 2025.“Buyers are walking away from deals more often, sometimes due to affordability issues and sometimes because they’re re-evaluating whether now is the right moment to commit,” Redfin head of economic research Chen Zhao said in a release. “Others aren’t even shopping, waiting instead for prices or mortgage rates to come down. On the other side, many sellers are staying put—either because they’re locked into low rates or unwilling to accept offers below expectations.”Allowing people to take their mortgage rate with them to a new property could help boost the supply of existing homes on the market if more homeowners are willing to move with their lower rate.But it could also come with higher list prices as more people enter a market with a limited pool of homes available to buy. Homeowners would also have an advantage on bidding compared to a new buyer who is working with today’s rates with more wiggle room in their budgets.“Anyone able to ‘port’ a 3% mortgage into a new purchase would effectively be bidding with cheap financing in a 6% world. That added purchasing power would push prices up, while renters and mortgage-free owners would still face today’s higher rates—only now with even higher list prices,” Jake Krimmel, a senior economist at Realtor.com, wrote in an analysis.Portable mortgages could also disrupt the U.S. mortgage system and lead to higher rates. Mortgage-backed securities, groups of mortgages that lenders sell to investors, would have their pricing models blown up and create more risk for investors as less loans are paid off early with more homeowners taking them with them when they move.Pulte has also said officials are evaluating a plan to offer 50-year mortgages and how to make mortgages assumable, where homebuyers could take over a seller’s preexisting loan. Assumable mortgages are already available in the U.S. but are rarely used because they require a large cash payment or a second mortgage at current rates.The 50-year mortgage could lower monthly payments by stretching out the term of the loan but would also likely come with higher rates and would ultimately cost buyers more in interest over the life of the loan and make it take longer to build equity.The administration’s efforts to lower housing costs come as an increasing slice of Americans are being priced out of the market altogether with elevated mortgage rates and consistently growing list prices. Home values have climbed significantly compared to before the pandemic for both new and existing homes amid a lack of sufficient supply.A shortage of homes is widely seen as the biggest issue when it comes to tackling housing affordability in the United States. Construction cratered in the aftermath of the 2008 financial crisis and has struggled to recover to a sufficient level to meet the demand.Housing starts have slumped in 2025 as builders confront cost challenges and a stalled market. Higher rates are also a challenge for construction, which is also impacted by the rising cost of labor and materials.Tariffs have been a double blow for builders, as the uncertainty around them has chilled activity in the housing market and broader economy. Import taxes have also increased the cost of materials used to build homes, making it more expensive for builders to start and complete projects.Tariffs that went into effect last month imposed a 10% tax on all timber and lumber imports, along with a 25% tariff on kitchen cabinet and furniture. The U.S. imports about one-third of its lumber, primarily from Canada, that are also subject to further tariffs.TrendingInvestigation continues into Taylor Twp. child sex ring as more victims come forwardAs the investigation continues into what's being termed a child sex ring in Centre County, police are trying to determine how many people may have been involvedPSP: Man killed in two-vehicle, head-on crash in Warriors Mark Twp.State police say one man was killed Saturday afternoon in a two-vehicle crash in Warriors Mark Township, Huntingdon County.According to a crash report, troopersJPD: One person hospitalized following stabbing in Dale Borough; suspect known to policeEmergency officials in Cambria County say one person was hospitalized Saturday evening following a stabbing along the 700 block of Bedford Street in Dale BorougPSP: Hyndman man charged for fatal truck vs go-kart crash that killed two peopleState police investigators say a Hyndman man is behind bars following a months-long investigation into a deadly Bedford County crash that claimed the lives of tReport: Tyson to close large meat plant just weeks after Trump's collusion claims Tyson, one of the nation's largest meat packing companies, is planning to close a large meat packing plant in Lexington, Nebraska.NEWS IN PHOTOS:\"Local\"3DA: Human trafficking charges to be filed in Taylor Twp. child sex ring investigation4Investigation continues into Taylor Twp. child sex ring as more victims come forward3Passing driver stops to help 2 trapped after I-83 crash: 'God wanted me to be there'3Warrant: Suspect in Taylor Twp. sex abuse investigation tried to buy victim's babyACCESSIBILITYDownload Our Mobile Apps:Terms & ConditionsCopyright NoticesEEO Public File ReportFCC InfoFCC ApplicationsPublic File AssistanceContactNews TeamCareersContestsNewsWeatherSportsTrafficGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1942, "success": true}