{"full_text": "ColumnsNovember 10, 2025The choice on housing is between affordability and controlNorth Carolina’s struggle with affordable housing pits government control against market solutions, as strict zoning and planning rules often block new development despite rising demand and population growth.By David LarsonStock photo | paulbr75 via PixabayThe Local Government Commission, chaired by Republican State Treasurer Brad Briner, approved over $370 million in bonds around the state for affordable housing and retirement homes last week.In a press release, Briner said, “Affordable housing remains a challenge in North Carolina, and the Local Government Commission continues to fulfill its role in attacking the problem,” while also noting that the LGC “has a statutory duty to approve most debt issued by units of local government and public authorities in the state,” as long as they can show the debt amount is appropriate and the local government unit “can reasonably afford to repay the debt.”Thankfully, these bonds were mostly “conduit revenue bonds” where the financial risks are borne by the private builder and their bondholders, not the government. The builder simply gets access to a lower-cost loan through the local government in exchange for being allowed to carry out a project that local planners want to see. But even if this won’t bankrupt a town or county, it still reveals a misguided approach to “affordable housing.”If officials really want to make housing affordable in their areas, giving up this desire to micromanage the “planning process,” not pressing it further, is what will actually begin to attack the problem.To start with the positive, there really are some good trends. A lot of North Carolina’s more populous areas have loosened the restrictions on “single-family” zoned areas. Rather than just one dwelling per lot, city and county governments have been moving toward allowing things like accessory dwelling units (called ADUs or granny flats) and multi-family “missing middle” housing like duplexes, townhomes and quads.But even if they allow more variety and density in formerly single-family zoned areas, some government planners are not nearly as flexible if you want to build outside of designated urban areas.For a drastic comparison on this front, we can look at two Triangle-area counties, Orange and Wake. Wake has largely allowed building and now has multiple new major municipalities that were small towns at best just one generation ago (Morrisville, Cary, Rolesville, Knightdale, Apex, etc.).Orange County, on the other hand, has such strict local zoning rules that most of the county is locked in time. Chapel Hill had 26,199 people in 1970, while Cary had only 7,686. But the estimated populations for 2025 are 62,043 for Chapel Hill and 181,838 for Cary. So Chapel Hill, which had been the much bigger and more well-known city, basically doubled, while Cary grew 24 times larger — now bigger than not just Chapel Hill, but all of Orange County.And outside city limits, Orange County has grown even less. This is largely due to the county’s obsession with strict planning, as seen in its current “Comprehensive Land Use Plan.”The plan says that “per North Carolina General Statute 153A-121,” the county is authorized to “define, regulate, prohibit or abate acts, omissions or conditions detrimental to the health, safety or welfare of its citizens.”And county leaders take this authority in a very broad sense, saying that “this Comprehensive Plan will strive, in its implementation, to link the economy, the environment and social equity to improve the vitality of all three of these domains.”So, in short, they believe they can determine how all land in the county should be used and why (to achieve certain progressive social and environmental goals). To display just how extreme this is in practice, see the map of the areas where development is allowed and where it is severely limited. That bottom southeastern corner is where Chapel Hill/Carrboro is, and the area along I-85 is where Mebane, Hillsborough and a small portion of Durham are. The planners have decided that everything else should be left (permanently?) rural.Most of this land is designated low-density “rural residential,” while the area between the two largest population centers of Chapel Hill/Carrboro and Hillsborough (inside the yellow lines) is an even stricter “rural buffer,” despite that being the most obvious place to develop in a growing county. So, basically, if you want to build much of anything in the county, unless it’s in one of the approved human-activity zones, you’re probably out of luck.Even if you are a community of progressive artists and musicians who want to use a 90-acre property to create an environmentally conscious communal-living development for those 55-plus, where 60 of those acres are permanently set aside for natural conservation, you can’t — because that would “threaten the character of rural Orange County.” Fiddlehead Corner, the project in question, purchased its land and sought to build everything in as eco-friendly way as possible, but, in March, the developers were still denied.“The Orange County Board of County Commissioners unanimously denied the rezoning requested for H4D that would have allowed us to proceed with our plan to build Fiddlehead Corner as a clustered community on the Morrow Mill property,” said an update on the community’s website. “Several commissioners commented that the master plan was good, even wonderful. But their statements expressed concern that our proposed way of implementing the plan — expanding a rural activity node and siting a community there — sets a precedent that could lead to widespread imitation, which they fear would threaten the character of rural Orange County.”In a recent opinion piece in the Daily Tar Heel defending the “rural buffer” amid Orange County’s plan-updating process, the author noted that when the popular ice cream spot Maple View Farms “was bought out in 2021 by a cast of crooks” who “attempted to bastardize the sacred soil of Maple View Farms” with “a hotel and amphitheater with a capacity rivaling the scale of the Durham Performing Arts Center. The one thing that stopped this project from continuing? The Rural Buffer.”So this “buffer” not only prevents much-needed housing from being built, it also prevents a beloved landmark between Hillsborough and Chapel Hill from expanding and adding more attractions? Victory, I guess (mostly for those who already have the housing they need and don’t like fun).Because of the difficulty and humiliation in having to deal with “the planners,” many make decisions that allow them to avoid them altogether. A couple of years ago, I noticed that a whole stretch of lots in rural Orange County were exactly 10.01 acres and asked a real estate agent friend about why that would be. She explained to me that there is a state law that exempts landowners from most local subdivision and planning requirements if they split the land into lots greater than 10 acres.In growing urban regions like the Triangle, even if some think farms are beautiful to drive by, agriculture is no longer the “highest and best use” of the land. If a farmer sees that his land value has skyrocketed and wants to sell to a developer to build housing, which has become the highest and best use, he can’t, unless he goes to a planning department (who will tell him no, since it would violate rural character).So instead, he chops his 80-acre farm into eight 10-acre “estate” lots. Does it really “preserve rural character” and save farmland to have these eight lots owned by people with no interest in farming and who now have to mow massive lawns? Might it not be better for these aims to allow the farmer to sell off 10 1-acre lots and potentially keep the other 70 acres as a farm?(And a broader question: Would moving that statewide exemption from 10 acres to 1 acre add a lot more buildable land, thereby reducing building costs and increasing housing stock without major negative trade-offs? Somebody else can answer that one.)While my county is fairly extreme on this front, the same principle applies across the state. Officials look out across their jurisdiction like Mufasa from Pride Rock and begin the intoxicating process of planning what should be done with others’ land. “This part of town really should have more woods.” “The lots are too small (or big) on that street.” “A grocery store over there would be kind of an eyesore.” “I like all the farmland I see on my commute. It should stay that way.” And on and on.But they don’t always consider whether this should be their call to make — whether the Fiddlehead Corner community should have to align with their vision for the county, whether a farmer who wants to buy a bigger farm in a cheaper part of the state should be prevented from selling his land to a housing developer.\nYet somehow, these same commissioners frequently bemoan the lack of affordable housing. But a few government-planned “affordable housing” projects cannot make up for all of the private projects that have been blocked. There’s a much easier and cheaper way to make housing affordable: stop trying to control the process and let the market create the housing it needs.David Larson is managing editor of the John Locke Foundation’s Carolina Journal, where this column first appeared.AdvertisementRelatedColumnsNov. 24A $42 million investment in Wilson and its childrenColumnsNov. 2425 things I’m thankful for in 2025ColumnsNov. 24Whatley cheers ICE’s Charlotte invasionColumnsNov. 24Community ties boost social mobility", "extraction_method": "beautifulsoup", "word_count": 1548, "success": true}