{"full_text": "Trump administration tries to break through lock-in effect with 'portable mortgages'NewsNewsNevada AG Aaron Ford joins 20 states in lawsuit against Trump executive orderA federal judge has blocked the Trump administration from dismantling several federal agencies, including those that fund cultural institutions, assist minorityLas Vegas police warn residents of holiday theft with humorous 'opportunity specialist' adThe Las Vegas Metropolitan police are urging the public to remain vigilant during the holiday season to prevent thefts. In a public service announcement posted CCSD reports progress filling special education teacher vacanciesThe Clark County school district is actively addressing the shortage of special education teachers, which began the school year with 163 vacancies. SuperintendReport: up to 95% of Las Vegas hospitality jobs at risk from AILas Vegas, known for its constant reinvention, is facing a new challenge as artificial intelligence and automation threaten to transform the hospitality industrLocalNation & WorldEntertainmentVideosOffbeatSpecial ReportsPoliticsThings To DoPhoto GalleriesAmazing AmericaArmstrong Army StrongInside Your WorldSoarBeyond the PodiumQuestion of the DaySpotlight on AmericaAuto MattersHealthy HomeFull Measure with Sharyl AttkissonDid You Know?Addicted AmericaCrisis in the ClassroomARCFormula VegasWeatherCurrent WeatherLas VegasClear59F68/46Today68/46Tuesday68/45Wednesday69/45Latest WeathercastLatest WeathercastMapsRadarHurricane TrackerWeather News3 Degree GuaranteeFeaturesFeaturesNevada AG Aaron Ford joins 20 states in lawsuit against Trump executive orderA federal judge has blocked the Trump administration from dismantling several federal agencies, including those that fund cultural institutions, assist minorityLas Vegas police warn residents of holiday theft with humorous 'opportunity specialist' adThe Las Vegas Metropolitan police are urging the public to remain vigilant during the holiday season to prevent thefts. In a public service announcement posted CCSD reports progress filling special education teacher vacanciesThe Clark County school district is actively addressing the shortage of special education teachers, which began the school year with 163 vacancies. SuperintendReport: up to 95% of Las Vegas hospitality jobs at risk from AILas Vegas, known for its constant reinvention, is facing a new challenge as artificial intelligence and automation threaten to transform the hospitality industrConsumer ReportsMake A Wish MondayDrive Safe Las VegasSInclair CaresPartner SpotlightAround the WebFor Pet's SakeSpanish Closed CaptioningSmart Money MovesBreaking Down the LawJob ConnectionWho's Hiring?Research SpotlightAsk The ExpertsLocal LivingCooking with Chef JeffMental Health MattersYour Place Inside and OutLocally Owned Small BusinessesAsk the Experts: FinanceSouper Bowl of CaringTrafficTrafficGov. Sisolak, health officials urge those who can help to join Battle Born Medical CorpsNevada Governor Steve Sisolak along with the state health officials urged Nevadas to those who can help to join Battle Born Medical Corps. Nevada Department of Health and Human Services and the Nevada Health Response Center joined to call on health care providers and health care administrations to assist in the state's COVID-19 pandemic response. Gov.CCSD, CCEA announce agreement for educators to 'donate' sick leaveThe Clark County School District and the Clark County Educators Association has reached an agreement for educators to donate sick leave to each other. Thursday's announcement said the two organizations signed a \"memorandum of understanding\" to allow the donation of sick leave to other educators within the district. According to Superintendent Dr. Jesus Jara, the measure covers something not currently covered in the bargaining agreement.Project Neon is complete, so why is there still traffic?The ambitious roadway project known as Project Neon was supposed to alleviate frustrations and shorten commute times. So now that it&rsquo;s done, why is traffic still heavy? The $1 billion construction project started in 2016 and was completed this year. Tony Illia with NDOT tells News 3 that although the project is finished, crews are now working on a punch list of items or loose ends for Project Neon, which is why there is still some construction.Overnight Spaghetti Bowl ramp closure planned for Project Neon workGet ready for some ramp closures on the Spaghetti Bowl for three nights next week. The Nevada Department of Transportation will be closing the ramp connecting southbound U. S. 95 to southbound Interstate 15 starting Monday, Sept. 16. RELATED | Project Neon comes to close, a few final touches remain. The closures will last from 10 p. m. to 5 a. m. for three nights Monday, Tuesday and Wednesday.WazeGame CenterGame CenterDaily Crossword Guess Word Jewel Block Micro CrosswordClassic SudokuWord SearchWatchLiveNow59°Tue66°Wed66°SearchSearchUser IconWatchSearchNewsDown ArrowNews HomeLocalNation & WorldEntertainmentVideosOffbeatSpecial ReportsPoliticsThings To DoPhoto GalleriesAmazing AmericaArmstrong Army StrongInside Your WorldSoarBeyond the PodiumQuestion of the DaySpotlight on AmericaAuto MattersHealthy HomeFull Measure with Sharyl AttkissonDid You Know?Addicted AmericaCrisis in the ClassroomARCFormula VegasWeatherDown ArrowWeather HomeMapsRadarHurricane TrackerWeather News3 Degree GuaranteeFeaturesDown ArrowFeatures HomeConsumer ReportsMake A Wish MondayDrive Safe Las VegasSInclair CaresPartner SpotlightAround the WebFor Pet's SakeSpanish Closed CaptioningSmart Money MovesBreaking Down the LawJob ConnectionWho's Hiring?Research SpotlightAsk The ExpertsLocal LivingCooking with Chef JeffMental Health MattersYour Place Inside and OutLocally Owned Small BusinessesAsk the Experts: FinanceSouper Bowl of CaringTrafficDown ArrowTraffic HomeWazeGame CenterDown ArrowGame Center HomeDaily Crossword Guess Word Jewel Block Micro CrosswordClassic SudokuWord SearchMoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsChime InNewsletter Sign UpStationDown ArrowStation HomePeopleContactContestsScheduleSubmit News TipsNews 3 Sponsored EventsCommunity CalendarEmploymentTour RequestNewsletter Sign UpNextGen TVSt. Jude Home GiveawayThe CW Las VegasDown ArrowThe CW Las Vegas HomeCW NEWS AT TENSportsDown ArrowSports HomeThursday Night LightsExtrasSports Night in Las VegasScoreboardVegas Golden KnightsHenderson Silver KnightsOlympicsTICKETSLas Vegas AcesCity GuideAdvertise With UsLegalDown ArrowTerms & ConditionsCopyright NoticesEEO Public File ReportPublic Inspection FileFCC ApplicationsPublic Inspection File AssistanceContact UsConteststwitter iconfacebook iconACCESSIBILITYArmstrong Williams Town HallArmstrong Williams takes on the news of the week and asks the questions you want answered. Don’t miss our weekly town hall!WATCHClose11Please ensure Javascript is enabled for purposes of website accessibilityTrump administration tries to break through lock-in effect with 'portable mortgages'by AUSTIN DENEAN | The National News DeskFri, November 14, 2025 at 9:47 AM4VIEW ALL PHOTOSFILE - A for sale sign stands outside a home on the market in the Alamo Placita neighborhood Tuesday, Aug. 27, 2024, in central Denver. (AP Photo/David Zalubowski, File)Comment on this story0CommentShare storySharetopics: Mortgage ratesPortable mortgagesHousing affordabilityLock-in effectHomeownershipHousing supplyMortgage-backed securitiesTariffsWASHINGTON (TNND) — The Trump administration is considering another method to bring down soaring housing costs through mortgage rates that are pricing people out of homeownership and keeping homes from coming onto the market.Federal Housing Finance Agency director Bill Pulte said the administration is “actively evaluating “portable mortgages,” which would allow homebuyers to take their mortgage rate with them when they decide to move. The proposal is a direct bid to confront the so-called “lock-in effect,” where homeowners are unwilling or unable to part with their lower mortgage rate and keeping their home off the market.Many homeowners were able to buy or refinance during the pandemic for ultra-low rates at or below 3%, which cuts hundreds of dollars off a monthly mortgage payment. Rates have been stuck between 6 to 7% for the last several years, creating a barrier for homeowners to put their homes up for sale as they don’t want to take up a new loan at higher rates. More than half of homeowners with a mortgage have a rate below 4%, according to Redfin.Homes are changing hands at the lowest rate in decades in 2025 in a market that has been in a standstill for years as mortgage rates climbed and economic uncertainty set in. A Redfin analysis found only 2.8% of homes in the U.S. have turned over to a new owner in 2025.“Buyers are walking away from deals more often, sometimes due to affordability issues and sometimes because they’re re-evaluating whether now is the right moment to commit,” Redfin head of economic research Chen Zhao said in a release. “Others aren’t even shopping, waiting instead for prices or mortgage rates to come down. On the other side, many sellers are staying put—either because they’re locked into low rates or unwilling to accept offers below expectations.”Allowing people to take their mortgage rate with them to a new property could help boost the supply of existing homes on the market if more homeowners are willing to move with their lower rate.But it could also come with higher list prices as more people enter a market with a limited pool of homes available to buy. Homeowners would also have an advantage on bidding compared to a new buyer who is working with today’s rates with more wiggle room in their budgets.“Anyone able to ‘port’ a 3% mortgage into a new purchase would effectively be bidding with cheap financing in a 6% world. That added purchasing power would push prices up, while renters and mortgage-free owners would still face today’s higher rates—only now with even higher list prices,” Jake Krimmel, a senior economist at Realtor.com, wrote in an analysis.Portable mortgages could also disrupt the U.S. mortgage system and lead to higher rates. Mortgage-backed securities, groups of mortgages that lenders sell to investors, would have their pricing models blown up and create more risk for investors as less loans are paid off early with more homeowners taking them with them when they move.Pulte has also said officials are evaluating a plan to offer 50-year mortgages and how to make mortgages assumable, where homebuyers could take over a seller’s preexisting loan. Assumable mortgages are already available in the U.S. but are rarely used because they require a large cash payment or a second mortgage at current rates.The 50-year mortgage could lower monthly payments by stretching out the term of the loan but would also likely come with higher rates and would ultimately cost buyers more in interest over the life of the loan and make it take longer to build equity.The administration’s efforts to lower housing costs come as an increasing slice of Americans are being priced out of the market altogether with elevated mortgage rates and consistently growing list prices. Home values have climbed significantly compared to before the pandemic for both new and existing homes amid a lack of sufficient supply.A shortage of homes is widely seen as the biggest issue when it comes to tackling housing affordability in the United States. Construction cratered in the aftermath of the 2008 financial crisis and has struggled to recover to a sufficient level to meet the demand.Housing starts have slumped in 2025 as builders confront cost challenges and a stalled market. Higher rates are also a challenge for construction, which is also impacted by the rising cost of labor and materials.Tariffs have been a double blow for builders, as the uncertainty around them has chilled activity in the housing market and broader economy. Import taxes have also increased the cost of materials used to build homes, making it more expensive for builders to start and complete projects.Tariffs that went into effect last month imposed a 10% tax on all timber and lumber imports, along with a 25% tariff on kitchen cabinet and furniture. The U.S. imports about one-third of its lumber, primarily from Canada, that are also subject to further tariffs.TrendingAnother milestone reached in Athletics ballpark construction in Las VegasA's team owner John Fisher and other dignitaries held a ceremonial groundbreaking for the ballpark back in June.Local attorney shares why stepfather wasn't charged in 11-year-old boy'sroad rage deathThe community is demanding answers after an 11-year-old boy was shot and killed in a road rage incident in Henderson.The suspect , 22-year-old Tyler Matthew JohFamily of woman killed in 12-car crash hold fundraiser to help with funeral costsThe family of a woman recently killed in a12-vehicle crash held a fundraiser to help with funeral costs.Adeline Duran Rincon was one of the two vicitms identifPolice investigate shots fired in central Las Vegas neighborhoodAuthorities are investigating after a shooting was reported in a central Las Vegas neighborhood Monday morning.Police release body cam video of road-rage shooting that killed 11-year-oldThe Las Vegas Metropolitan Police Department has released body-camera videos showing the aftermath of a road-rage shooting that resulted in the death of 11-yearNEWS IN PHOTOS:\"Local\"9Police: crime down in Spring Valley, but 89103 remains among top zip codes5Federal rule change could limit nursing student loan access4NV Energy warns customers of holiday scam spike3Red Rock to limit Scenic Drive, visitor center hours on Thanksgiving DayACCESSIBILITYTerms & ConditionsCopyright NoticesEEO Public File ReportPublic Inspection FileFCC ApplicationsPublic Inspection File AssistanceContact UsContestsNewsWeatherTrafficSportsStationPoliticsAround the WebGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1970, "success": true}