{"full_text": "El Paso ranks #1 city in U.S. for housing affordability, study findsNewsNewsMother allegedly attacked deputies to prevent arrest of daughter in CanutilloA 64-year-old mother allegedly attacked deputies trying to stop them from arresting her daughter during a domestic assault call in Canutillo.El Paso's downtown deck plaza project advances with $25M recommendationThe plan to build a downtown deck plaza over Interstate 10 in El Paso has taken a step forward as the Metropolitan Planning Organization's Transportation PolicyMan arrested for smuggling out 1,285 machine gun magazines at Santa Teresa borderOne man was arrested after he was reportedly caught trying to smuggle over 1,000 machine gun magazines to Mexico through the Santa Teresa border crossing.Sunland Park annexation proposal raises concerns from Dona Ana CountyA proposal to annex over 2,600 acres of land into the City of Sunland Park is stirring debate in Dona Ana County.LocalNation & WorldEntertainmentOffbeatElectionVideosConnect to CongressKFOX14 InvestigatesCrime NewsAmazing AmericaIn the CourtroomMilitaryLinks MentionedSpecial AssignmentsBack to SchoolInside Your WorldSoarBeyond The PodiumQuestion of the DayImmigrationSpotlight on AmericaEl Paso ShootingHealthy HomeFull Measure with Sharyl AttkissonAddicted AmericaCrisis in the ClassroomWeatherCurrent WeatherEl PasoClear52F68/38Today68/38Tuesday68/38Wednesday67/37Latest WeathercastLatest WeathercastRadarMapsLive Weather CamerasHurricane TrackerCommunityCommunityMother allegedly attacked deputies to prevent arrest of daughter in CanutilloA 64-year-old mother allegedly attacked deputies trying to stop them from arresting her daughter during a domestic assault call in Canutillo.El Paso's downtown deck plaza project advances with $25M recommendationThe plan to build a downtown deck plaza over Interstate 10 in El Paso has taken a step forward as the Metropolitan Planning Organization's Transportation PolicyMan arrested for smuggling out 1,285 machine gun magazines at Santa Teresa borderOne man was arrested after he was reportedly caught trying to smuggle over 1,000 machine gun magazines to Mexico through the Santa Teresa border crossing.Sunland Park annexation proposal raises concerns from Dona Ana CountyA proposal to annex over 2,600 acres of land into the City of Sunland Park is stirring debate in Dona Ana County.Built in the BorderlandPartner SpotlightThe BreakdownOpen MicSenior Healthy LivingBeyond the PlateBecoming the BadgeCommunity ConversationsWellness WatchHope On The SpectrumDo Your JobARC El PasoFaculty SpotlightSchool SpotlightTrafficTrafficTxDOT road closures happening between November 24 through December 5View interactive TxDOT map and cameras here.I-10 Widening WestMonday, November 24 through Wednesday, November 269 a.m. to 4 p.m. (as needed)North- and South DeTxDOT road closures happening between November 17 through November 23EL PASO, Texas (KFOX14/CBS4) &mdash; EL PASO, Texas (KFOX14/CBS4) &mdash; View interactive TxDOT map and cameras here.I-10 Widening WestMonday, November 17 through SaturdayTxDOT road closures happening between November 10 through November 17I-10 Widening West48 Hour Weekend ClosureSaturday, November 8 through Monday, November 105 a.m. to 5 a.m.I-10 westbound at Mesa closedI-10 eastbound at Redd cloMan killed after being hit by a vehicle in Downtown El PasoA 58-year-old man was killed Monday morning after he was hit by a vehicle in Downtown El Paso.Gas TrackerTraffic NewsEl Paso Bridge TimesWhat’s Driving You Crazy?Game CenterGame CenterDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic Sudoku Word SearchWatchLiveNow52°Tue67°Wed67°SearchSearchUser IconWatchSearchNewsDown ArrowLocalNation & WorldEntertainmentOffbeatElectionVideosConnect to CongressKFOX14 InvestigatesCrime NewsAmazing AmericaIn the CourtroomMilitaryLinks MentionedSpecial AssignmentsBack to SchoolInside Your WorldSoarBeyond The PodiumQuestion of the DayImmigrationSpotlight on AmericaEl Paso ShootingHealthy HomeFull Measure with Sharyl AttkissonAddicted AmericaCrisis in the ClassroomWeatherDown ArrowWeather HomeRadarMapsLive Weather CamerasHurricane TrackerCommunityDown ArrowCommunity HomeBuilt in the BorderlandPartner SpotlightThe BreakdownOpen MicSenior Healthy LivingBeyond the PlateBecoming the BadgeCommunity ConversationsWellness WatchHope On The SpectrumDo Your JobARC El PasoFaculty SpotlightSchool SpotlightTrafficDown ArrowTraffic HomeGas TrackerTraffic NewsEl Paso Bridge TimesWhat’s Driving You Crazy?Game CenterDown ArrowGame Center HomeDaily CrosswordGuess WordJewel BlockMicro CrosswordClassic Sudoku Word SearchMoneyDown ArrowMoney HomeDepositsInvestingMortgagesLoansCredit CardsChime InSportsDown ArrowSports HomeContentLocal SportsEl Paso ChihuahuasScoreboardLocomotiveEl Paso RhinosTICKETSCity GuideNewsletter Sign UpStationDown ArrowStation HomeContactPeopleCareersScheduleContestsSinclair CaresFox LoungeNewsletter Sign UpFollow Us On SocialDaytimeDown ArrowDaytime HomeThe TeamPodcastsDown ArrowPodcasts HomeOpen MicThe BreakdownLegalDown ArrowTerms & ConditionsCopyright NoticesEEO Public File ReportFCC InfoFCC ApplicationsPublic File AssistanceContactNews TeamCareersConteststwitter iconfacebook iconACCESSIBILITYArmstrong Williams Town HallArmstrong Williams takes on the news of the week and asks the questions you want answered. Don’t miss our weekly town hall!WATCHClose11Please ensure Javascript is enabled for purposes of website accessibilityEl Paso ranks #1 city in U.S. for housing affordability, study findsby Erika EsquivelThu, October 2, 2025 at 8:33 AMUpdated Thu, October 2, 2025 at 8:34 AMSan AntonioTexas suburban housing development neighborhood - aerial view with houses in rows in middle-class neighborhoodComment on this story2CommentShare storySharetopics: El PasoHousing affordabilityMedian incomeRentersHomeownersSmartAssetHousing costsMiamiEL PASO, Texas (KFOX14/CBS4) — El Paso was ranked as the number one city in the U.S. for housing affordability, according to a study. SmartAsset’s latest study ranked U.S. cities based on housing costs as a portion of the local median income, with costs broken out for both renters and homeowners.El Paso ranked no. 1 overall, with 20.35% of household median income going to putting roofs over heads. According to the study, just 20.35% of household income goes to housing costs in El Paso, where the average monthly cost across both renters and homeowners is $1,016. Renters pay a median $985 per month compared to homeowners at $1,066, with a $59,932 median income across all households. Residents in Louisville, KY (20.38%); Albuquerque, NM (20.38%); Mesa, AZ (20.54%); and Indianapolis, IN (21.82%) also pay some of the lowest portions of their incomes to housing.For Miami residents, more than 36% of gross income goes to housing costs. Miami is the most expensive city for housing studywide, with homeowners paying a median of $2,025 in monthly costs and renters paying $1,975, compared to a median household income of $66,337. Costs for homeowners actually decreased year over year, but rent increases overshadowed this since two thirds of households in Miami rent.Below is the list of the cities with the highest house affordability. Miami, FL Los Angeles, CA Long Beach, CA New York, NY Oakland, CA Boston, MA Detroit, MI Baltimore, MD Tampa, FL San Diego, CA Memphis, TN Houston, TX Atlanta, GA Dallas, TX Austin, TXSee the full study here.RECOMMENDED: El Paso city council reviews progress on 'Envision El Paso' plan for future developmentComment with BubblesREAD THE COMMENTS (2)Sign up to receive the top interesting stories from in and around our community once daily in your inbox.TrendingErika Kirk opens up about wishing for pregnancy after husband's tragic assassinationKirk joined Megyn Kelly for a live interview on the last stop of Kelly's Sirius XM tour in Glendale, Arizona. One airlifted to hospital after serious crash in West El Paso, investigation underwayA crash in West El Paso early Monday morning led to the closure of all lanes on South Desert near Thorn. U.S. Border Patrol hands over drug suspect to Mexican authorities at El Paso crossingThe U.S. Border Patrol in El Paso took to social media Sunday to announce that it had handed a suspect wanted on drug-related charges to Mexican authorities...Teen going 100 mph charged with killing pregnant girlfriend in deadly 12-vehicle crashA teenager, Jose Gutierrez, 19, is facing murder charges after allegedly causing a 12-vehicle crash while driving at 100 mph in a 45 mph zone.Report: Selena Quintanilla's autopsy reveals details of her tragic death 30 years laterThe medical autopsy for Selena Quintanilla was revelaed 30 years after her death according to magazine US Weekly.NEWS IN PHOTOS:\"Local\"3Mother allegedly attacked deputies to prevent arrest of daughter in Canutillo6El Paso's downtown deck plaza project advances with $25M recommendation11El Paso Children's Hospital host annual celebration day for young patients3Man arrested in connection with West El Paso shooting ACCESSIBILITYDownload Our Mobile Apps:Terms & ConditionsCopyright NoticesEEO Public File ReportFCC InfoFCC ApplicationsPublic File AssistanceContactNews TeamCareersContestsNewsWeatherSportsGame CenterPrivacy PolicyCookie PolicyDo Not Sell or ShareCookie Preferencestwitter iconfacebook icon 2025 Sinclair, Inc.", "extraction_method": "beautifulsoup", "word_count": 1215, "success": true}