{"full_text": "Management\nSenior Living Operators Embrace PACE as ‘Missing Link’ for Affordability, Clinical Services\nBy Austin Montgomery | October 27, 2025October 27, 2025\nShare\nFacebook\nTwitter\nLinkedIn\nSend email\nA growing number of senior living providers are expanding Program of All-Inclusive Care for the Elderly (PACE) services to meet the needs of incoming – and potentially cash-strapped older adults.\nRising resident acuity, affordability issues and shifting expectations among older adults are all issues that operators believe PACE can aid.\nWhile such services and partnerships remain relatively niche, senior living providers view PACE services differently in 2025. Greater recognition of PACE services as an operational differentiator began in 2020 during the Covid-19 pandemic as providers worked to extend services and connect with older adults outside their communities.\nAdvertisement\nSenior living providers including Immanuel, EveryAge and Health Dimensions Group (HDG) believe PACE services could be the “missing link” between clinical integration and social support to improve quality of life for older adults outside traditional senior living settings. Currently, HDG is a PACE consulting organization along with serving as a National PACE Association Technical Assistance Center.\n“The PACE center is where people thrive,” said Immanuel CEO Eric Gurley. “They can socialize, be engaged and do activities and it’s important that we remember this forgotten population by and large.”\nThis comes as the National PACE Association reported rapid growth in 2024 when 24 new PACE programs opened, triple the historical annual average, according to National PACE Association CEO Shawn Bloom.\nAdvertisement\n“What we’re seeing is unprecedented interest in PACE, particularly among organizations that want to sponsor PACE as a service delivery model in their communities,” Bloom told SHN.\nEveryAge, a North Carolina-based nonprofit, has seen more seniors who can’t afford private-pay options turn to PACE to access comprehensive services while remaining in their communities.\nOver 11.5 million older Americans aged 75 and up will be unable to afford assisted living in the coming decade, according to the “Forgotten Middle” affordability study by NORC at the University of Chicago.\nIn 2025, seven new PACE programs have opened, with more “on the cusp” of opening soon, Bloom added. But challenges remain in growing PACE partnerships in senior living due to a complex mix of issues, including an uneven patchwork of state-specific regulations, prohibitive startup costs and eligibility factors that make adoption tougher.\nBenefits of PACE\nPACE organizations establish networks of providers to deliver a full continuum of services that meet participants’ healthcare needs. When participants live in or require assisted living care, the PACE organization contracts with an assisted living facility to provide a comprehensive package of services. As part of the partnership, PACE is responsible for payment of all required services in assisted living, Bloom said.\nOmaha, Nebraska-based nonprofit senior living provider Immanuel uses its PACE partnership to “close the clinical gap” and address the clinical, emotional and social needs of residents under a unified model, according to CEO Eric Gurley. He describes PACE as a return to “true continuum thinking,” combining person-centered senior living values with clinical expertise.\n“At the time, it was a novel idea,” Gurley said of launching PACE centers. “Now, as we see systems evolving, it’s clear that taking that step back then was truly courageous.”\nStaff often tailor their approach to meet participants’ preferences — for example, building rapport through small daily gestures that help earn trust before providing in-home services, Gurley said.\nEveryAge, based in North Carolina, operates three PACE centers across the Tar Heel State near affordable housing communities to support low-income seniors’ ability to age in place. EveryAge staff lead extensive community outreach efforts by partnering with local organizations to educate and identify eligible seniors, EveryAge Director of Home- and Community-Based Services Thomas Chang told SHN.\n“Our goal in senior living is to provide a variety of environments for home and health that accommodate older adults in different phases of life,” Chang told SHN.\nThese partnerships have reduced unscheduled hospitalizations and emergency department visits while strengthening ties with local communities, he added. Through PACE’s interdisciplinary care model, assisted living operations benefit from coordinated care, clinical planning and risk management, making PACE a strong partner for assisted living providers, according to Health Dimensions Group Senior Vice President of Consulting Services Tom Stitt.\n“It’s the full continuum of services in one package,” Stitt said. “PACE has a proven track record of improving the mental and physical health of participants. Senior living communities will hopefully see this in their residents enrolled in PACE.”\nClose engagement between PACE and assisted living staff at the community level can help identify PACE-eligible participants, bringing additional scale and more resources for programming and engagement opportunities, Chang said. Through ongoing health monitoring and intervention, PACE partnerships have made a positive clinical impact while improving social ties among residents and more introverted, at-home older adults.\nWhat drives PACE expansion\nState regulation changes, affordability pressures and increased demand for community-based services are pushing senior living providers to align with and host PACE programs. At the national level, PACE advocates are working to reintroduce and pass the Duals Act and the Part D Choice Act, which would allow older adults to maintain Part D Medicaid.\n“While there have been significant improvements in the affordability of Part D… it still costs roughly $4,700 a month,” Bloom said. “I don’t know how long most seniors could afford to do that, even though it is far less than institutional care.”\nCo-location of PACE and senior housing can create significant cost efficiencies for the PACE program and provide much needed care coordination for senior living communities and their low-income residents, Stitt said\nTechnology integration also helps capture better data for social group meetings and program attendance, Gurley said, calling it a chance for operations teams from different backgrounds to build relationships and better understand the communities they serve.\nThe future of senior living as a hub for PACE centers\nAs senior living providers expand their high-acuity care models, PACE partnerships could continue to drive clinical and operational innovation as residents delay entry into senior living and present with higher acuity needs.\n“Incorporating PACE programs into our portfolio has diversified the revenue stream and allowed us to see how other models address the needs of seniors,” Chang said.\nIn the future, Gurley believes that PACE services and partners could serve as a gateway for future Medicare Advantage plans on a capitated risk basis to take on greater risk and advance value-based care efforts in senior living.\n“We have the skill set because we’re the provider, not just the insurer,” Gurley added.\nAs care needs become more complex, Bloom envisions a world where PACE centers and senior living operators work more closely to reach new groups of older adults living at home who need valuable programming, social connection and care delivery.\n“The value added by PACE integration is among the most important improvements we can make to an older individual’s ability to live with dignity and independence,” Bloom said.\nShare\nFacebook\nTwitter\nLinkedIn\nSend email\nCompanies featured in this article:\nEveryAge, Health Dimensions Group, Immanuel, National PACE Association\nAustin Montgomery\nAustin Montgomery is a reporter for Senior Housing News as part of WTWH Media. When he isn't writing, find him at a local disc golf course or at the driving range working on his golf swing.\nEmail\nSubscribe\nReceive industry updates and breaking news from SHN.\nSubscribe\nYou May Also Like", "extraction_method": "beautifulsoup", "word_count": 1226, "success": true}