{"full_text": "San Francisco pushes bold housing plan to tackle affordability crisis\nPlease ensure Javascript is enabled for purposes of website accessibility\nSkip to content\nSelect Region or Brand\nBusiness\nColorado\nIdaho\nLehigh Valley, PA\nLong Island\nNew Orleans, LA\nNew Jersey\nLong Island, NY\nMaryland\nMinnesota\nMecklenburg, NC\nOklahoma City, OK\nRochester, NY\nSouth Carolina\nVirginia\nPet Age\nColor Magazine\nLegal\nMassachusetts\nVirginia\nMissouri\nMinnesota\nNew York\nNorth Carolina\nSouth Carolina\nWisconsin\nMichigan\nRhode Island\nConstruction\nMilwaukee, WI\nOregon\nHome Furnishings\nDesigners Today\nFurniture Today\nGifts & Decorative Accessories\nHome Accents Today\nHome Furnishings News\nHome Textiles Today\nPet Age\nManage Account\nManage Print or Online Subscription\nManage Your Email Subscriptions\nSign In\nUpcoming Event\nMinnesota ICONS\nFree Newsletter\nSubscribe\nNews\nEvents\nWebinars\nPodcast\nPublic Notices\nAbout\nFAQ\nSubscribe\nSubmit a public notice\nPress Releases\nProfessional Announcements\nBTM Business Connect\nBehind the Deal\nContributor Content\nAdvertising\nNews\nNews\nBeyond the Skyline Podcast\nConstruction & Development\nReal Estate\nJust Sold\nOn the Market\nSustainable\nSpotlight on Small Biz\nNation & World\nFinance & Banking\nBusiness calendar\nMost Read\nSections\nTop Projects\nTop Women in Finance\nReader Rankings\nMinnesota AEC 250\nThe Power List Developers\nThe Power List M&A\nThe Power List Construction & Real Estate Law\nEmpowering Women\nIn the Lead\nMinnesota Icon\nRising Young Professionals\nTop Women in Construction\nWomen Who Lead\nExperts Forum\nTrackers\nTwin Cities Apartment Sales Tracker\nTwin Cities Hotel Sales Tracker\nRochester Sales Tracker\nTwin Cities Apartment Development Tracker\nTwin Cities Hotel Development Tracker\nRochester Development Tracker\nPublic Notices\nAbout\nFAQ\nSubscribe\nSubmit a Public Notice\nSubscribe\nSubscribe\nGroup subscriptions\nPress Releases\nProfessional Announcements\nContributor Content\nBTM Business Connect\nBehind the Deal\nAdvertise & Contact\nAdvertising\nAbout Us\nContact Us\nPlaques & Permissions\nEvents\nEvents\nWebinars\nCategory:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display: Category:\n- date_display:\nSan Francisco pushes bold housing plan to tackle affordability crisis\nThe Associated Press//October 30, 2025//\nHomes in the Noe Valley neighborhood of San Francisco are photographed on Oct. 17. San Francisco Mayor Daniel Lurie’s plan to allow taller, denser housing faces backlash as the city struggles with affordability and state housing mandates. (AP File Photo: Godofredo A. Vásquez)\nHome>Business & Economy>San Francisco pushes bold housing plan to tackle affordability crisis\nHomes in the Noe Valley neighborhood of San Francisco are photographed on Oct. 17. San Francisco Mayor Daniel Lurie’s plan to allow taller, denser housing faces backlash as the city struggles with affordability and state housing mandates. (AP File Photo: Godofredo A. Vásquez)\nSan Francisco pushes bold housing plan to tackle affordability crisis\nThe Associated Press//October 30, 2025//\nListen to this article\nThe Blueprint\nMayor Daniel Lurie proposes denser housing to ease San Francisco‘s affordability crisis.\nThe plan would allow taller buildings citywide, including historic areas.\nCritics fear displacement and loss of neighborhood character.\nThe state is pressuring San Francisco to approve 36,000 new homes by 2031.\nSAN FRANCISCO — San Francisco Mayor Daniel Lurie is trying to get more homes built for people like Liam Murphy: a fifth-generation city kid who found himself repeatedly outbid for tiny two-bedroom houses that wound up selling for $1.6 million.\nMurphy, 39, now lives about an hour’s drive away from his job as a San Francisco firefighter. He says it’s too late for his family to move back, but he hopes others can stay in a city where the average monthly rent for a one-bedroom is $3,500.\n“That would just make for a better city overall,” said Murphy, “and the reason is because city kids just grow up being exposed to more. They’re exposed to all the cultures of San Francisco, which makes a more well-rounded person.”\nTiny, colorful San Francisco — just seven miles squared — embraces its image as a city that welcomes all. But its inability to build more housing has made it one of the world’s toughest places to find a home, risking the diversity it prides itself on.\nEpithets are hurled at the mayor\nLurie hopes to change that, with a plan to allow for denser and taller buildings throughout much of the city, including the westside Sunset neighborhood of single-family homes and the tourist friendly Haight-Ashbury, which is studded with classic Victorian and Edwardian homes.\nThe issue has roiled the city, and threats of recall loom over San Francisco supervisors who go along with Lurie. At a recent housing rally, the mayor who won a rare reprieve from President Donald Trump’s threats to send in federal forces struggled to be heard over angry chants of “shame!” and “liar.”\nProtesters demanded the city invest in 100% below-market rate housing and accused him of being a gentrifier and a Republican.\n“I truly believe that this has San Franciscans’ best interests at heart. Are some people going to be fearful? Absolutely. I get it. Change is scary,” said Lurie, who is a centrist Democrat. “But the status quo is not working. There’s an affordability crisis right now.”\nDemocrats vs. Democrats\nThe city’s estimated 830,000 residents are passionate over both land use and equity. Housing projects have died as pressure to create more affordable units made potential developments unprofitable. Residents also want their stunning views.\nBut San Francisco is under pressure from the state to adopt a new zoning plan allowing for 36,000 more homes by 2031 — or else the state will decide what gets built where — and the mayor likely has the votes to pass his “Family Zoning Plan.”\nSupporters say it’s a matter of supply and demand, and that more homes will bring down the overall cost of housing.\nCritics say such trickle-down economics will not work in a city like San Francisco, which is in such global demand that some foreign investors buy properties sight-unseen. They say developers will only build luxury housing that’s too costly for most workers, while displacing tenants and destroying the character of entire neighborhoods.\n“There’s a herd of elephants in the room that no one will address,” says Eric Jaye, a Democratic political consultant who opposes the plan.\nA city ‘for people who didn’t love cities’\nMuch of the housing push has come from Democrats, including a former city mayor, Gov. Gavin Newsom, who signed into law a proposal by San Francisco state Sen. Scott Wiener to build more homes near transit.\nThe city has made enormous strides in recent years, with whole districts of tall condo buildings cropping up around downtown, says Rafael Mandelman, president of the Board of Supervisors. But he acknowledges that people come to San Francisco for its more intimate neighborhoods and access to green space.\n“San Francisco, historically, was the city for people who didn’t love cities,” Mandelman said.\nKatherine Roberts, 72, initially welcomed construction of an affordable housing complex near the three-story Edwardian she labored to buy in the Haight-Ashbury neighborhood two decades ago.\nBut at 160 units and eight stories high, the massive building has shattered her peace of mind, dominating her view.\n“I’m looking out and it’s like I’m living in East Germany. How can you build something this inappropriate in a historic neighborhood like the Haight-Ashbury?” Roberts said. “What about all the people who already live here? What are we supposed to do?”\nProposal calls for denser homes\nFor the most part, the new zoning plan allows for more housing to be packed into the space of a single-family home — say a duplex with a studio — without exceeding the city’s height limit of roughly four stories for such properties. At least 15% of new housing must be below-market rate.\nBuildings on neighborhood commercial corridors could double to eight stories. Busier thoroughfares could see high-rises of 10 stories and more, and in a few spots, on Van Ness Avenue, heights could hit 650 feet, rivaling some downtown skyscrapers.\nPassage of Lurie’s proposal won’t necessarily lead to more homes in a city with high labor and construction costs and “notoriously complex and cumbersome” approval processes, as the state said in a scathing 2023 review.\nAnd so city dwellers make do with overcrowded — and sometimes awkward — living situations.\nLaura Foote, executive director of “yes in my backyard” YIMBY Action, wound up living with the man who is now her husband — and the woman he was divorcing — in a one-bedroom apartment for about six months, until his ex could find another rental.\n“We didn’t kill each other,” Foote said, “but it went on longer than it would have in a well-functioning housing market.”\nMayor’s plan is likely to pass\nSupervisors are still negotiating amendments to the zoning plan, which could be voted out of committee on Monday for consideration by the full board. Some supervisors want to exempt historic properties, or all buildings currently used for housing. The mayor agreed to exempt buildings with at least three rent-controlled units.\nThe compromise was a major relief for Phyllis Nabhan, 78, who lives in the Richmond neighborhood, between the Golden Gate Bridge and Golden Gate Park. She fears becoming homeless if a developer scoops up the property she’s called home for 47 years, starting with a rent of just $350 a month.\nBut Nabhan still objects to the proposal. She says it would ruin her neighborhood’s “cozy and wonderful” feel, and blames the state for forcing the city to change.\n“I think that this mayor is trying,” she said. “It’s a horrible job, I wouldn’t want to be mayor.”\nTags:\ndevelopment, California housing crisis, housing plan, Daniel Lurie, Real Estate, YIMBY, San Francisco, Gavin Newsom, zoning, affordable housing\nRelated Articles\nWellington buys air rights for rentals over Native American clinic\nSt. Paul tackles rezoning for Hamm’s site redevelopment\nRochester buys $2.7M site for new fire station plan\nReport shows economic distress puts affordable homes at risk\nIron District development plan includes soccer stadium\nShare this!\nRelated ContentJO Companies eyes new affordable housing in Brooklyn ParkJO Companies is planning up to 160 affordable units on Brooklyn Boulevard in Brooklyn Park, seeking public fun[...]November 24, 2025Wisconsin bill could make way for sprinklers in older housingA new Wisconsin bill would let local governments mandate sprinklers and fire-prevention upgrades in older hous[...]November 24, 2025Alaska Native villages weight costly relocation optionsStorms, erosion and thawing permafrost are putting Alaska Native villages at risk as communities weigh costly [...]November 24, 2025Supply chain delays, rising prices threaten electricity gridTransformer, circuit breaker, and cable shortages threaten U.S. grid reliability as demand surges from AI, ele[...]November 24, 2025Endeavor plans redevelopment at former Totino’s siteEndeavor Development plans to replace a Fridley bakery with a 250,000-square-foot speculative warehouse, pendi[...]November 21, 2025Q&A: Kim Hofstede steps in as president of Founders PropertiesNew Founders Properties president Kim Hofstede discusses her career path, industrial real estate strategy, mar[...]November 21, 2025\nFinance & Commerce Daily Newsletter\nSign up for your daily digest of Minnesota News.\nBy signing up you agree to our\nPrivacy Policy\nUpcoming business events\nSee the full list of events here\nEditor’s Picks\nJO Companies eyes new affordable housing in Brooklyn Park\n11/24/2025\nEndeavor plans redevelopment at former Totino’s site\n11/21/2025\nQ&A: Kim Hofstede steps in as president of Founders Properties\n11/21/2025\nMakado buys two Richfield apartment properties\n11/20/2025\nMinnesota groups fight HUD cuts to supportive housing\n11/20/2025\nNews\nEden Prairie flex industrial building sells for $14 million\nA 93K-square-foot flex industrial building in Eden Prairie’s Golden Triangle has sold for $14M as [...]\nJO Companies eyes new affordable housing in Brooklyn Park\nJO Companies is planning up to 160 affordable units on Brooklyn Boulevard in Brooklyn Park, seeking [...]\nWisconsin bill could make way for sprinklers in older housing\nA new Wisconsin bill would let local governments mandate sprinklers and fire-prevention upgrades in [...]\nAlaska Native villages weight costly relocation options\nStorms, erosion and thawing permafrost are putting Alaska Native villages at risk as communities wei[...]\nIPO market stalls as shutdown and investor caution rise\nA government shutdown, SEC backlog and investor caution have slowed IPOs, sending recent debuts lowe[...]\nSupply chain delays, rising prices threaten electricity grid\nTransformer, circuit breaker, and cable shortages threaten U.S. grid reliability as demand surges fr[...]\nBattery limits, safety issues pose challenges to flying taxis\nChina’s low-altitude economy is booming as drones and eVTOL flying taxis expand, though battery li[...]\nUN climate deal boosts funding but skips fossil fuel cuts\nCOP30 ends with a funding boost for climate adaptation but no pledge to phase out fossil fuels, prom[...]\nEndeavor plans redevelopment at former Totino’s site\nEndeavor Development plans to replace a Fridley bakery with a 250,000-square-foot speculative wareho[...]\nJust Sold: North Lakes uses apartment sale for new project\nNorth Lakes Property Management sells four Minnesota apartments to three buyers to help finance a ne[...]\nSpecial Publications\nFinance & Commerce’s Top Women in Finance 2025 profiles\n11/14/2025\nRising Young Professionals honorees announced\n10/14/2025\nFinance & Commerce announces Minnesota Icon honorees\n10/14/2025\nIn the Lead: Women-Owned Businesses 2025\n9/30/2025\nBeyond The Skyline Podcast\nBeyond the Skyline is a podcast and video interview about economic development, real estate and construction in Minnesota.\nListen here\nNews\nEvents\nWebinars\nPodcast\nPublic Notices\nAbout\nFAQ\nSubscribe\nSubmit a public notice\nPress Releases\nProfessional Announcements\nBTM Business Connect\nBehind the Deal\nContributor Content\nAdvertising\nABOUT\nFinance & Commerce provides news, analysis and commentary on Minnesota business. We are the only independent daily newspaper dedicated to business reporting.\nMY ACCOUNT\nLogin\nLogout\nSubscriber\nManage Account\nGroup Subscription\nSubscriber Agreement\nContact\nAbout Finance & Commerce\nContact Finance & Commerce\nAccessibility Statement\nAdvertising\nAdvertising\nSolutions\nEditorial Calendar\nMarketing Guide\nNewsletter\nMedia Kit\nCONNECT\nNEWSLETTER\nGet our free e-alerts & breaking news notifications!\nDIGITAL EDITIONS\nSubscribe for access to the latest digital and special editions.\n© 2025 BridgeTower Media. All rights reserved.\nUse of this website is subject to its Terms of Use | Privacy Policy | Your California Privacy Rights/Privacy Policy | Do Not Sell My Info/Cookie Policy\nWe use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept”, you consent to the use of ALL the cookies. Do not sell my personal information.Cookie settingsACCEPTPrivacy & Cookies Policy\nClose\nPrivacy Overview\nThis website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience.\nNecessary\nNecessary\nAlways Enabled\nNecessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information.\nNon-necessary\nNon-necessary\nAny cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website.\nSAVE & ACCEPT", "extraction_method": "beautifulsoup", "word_count": 2559, "success": true}