{"full_text": "Is America in a Housing Crisis? Cultural Anthropologist on Today's Affordability and Access | Newswise\n☰\nAbout\nAbout\nCurious by Nature Podcast\nMember Services\nPricing\nAccessibility Statement\nNewswise Live\nInvoice Lookup\nArchived Wires\nMedia Subscribers\nServices for Journalists\nSample Effectiveness Reports\nTerms of Service\nPrivacy Policy\nOur Staff\nContact Us\nBlog\nFAQ\nHelp\nNews\nLatest News\nCOVID News\nCurrently Embargoed\nResearch News Releases\nResearch Alert\nPreprints\nMarketplace\nNews With Video/Audio\nRSS\nBrowse More Sections\nMedicine\nScience\nLife\nBusiness\nExpert Pitches\nChannels\nMedicine\nScience\nLife\nBusiness\nJournal News\nTrends and Top Stories\nBy Location\nMeeting, Grants & Events\nBiotech\nCancer\nCOVID\nClinical Trials\nDiabetes\nGenetics\nInfectious Disease\nNeuro\nObesity\nWomen's Health\nView all Medicine Channels\nChemistry\nClimate Science\nDinosaurs\nDOE Science News\nEngineering\nMaterials Science\nPhysics\nSpace\nView all Science Channels\nBehavioral Science\nEducation\nGovernment\nHistory\nPolitics\nSocial Media\nView all Life Channels\nEconomics\nWall Street\nIn the Workplace\nWomen in Business\nView all Business Channels\nCell (journal)\nJAMA\nJournal of Experimental Medicine\nNature (journal)\nNEJM\nNeurology (journal)\nPLoS\nView all Journal Channels\nEditor's Picks\nPopular with Readers\nStories Getting News Coverage\nView all Trends and Top Stories\nAfghanistan News\nAfrican News\nChina News\nCuba News\nEurope News\nGermany News\nGulf of Mexico\nIndia/Pakistan News\nIraq News\nView all by Location Channels\nGrant Funded News\nMedical Meetings\nNewswise Live - Event in Progress\nNewswise Live - Expert Spotlight\nNewswise Live - Events\nScientific Meetings\nView all Meeting, Grants & Events Channels\nSign up for the wires and see archived wires\nSign Up Now\nExperts\nExpert Pitch\nBrowse experts available to comment on breaking news\nExpert Query\nRequest an expert contact, get responses directly to your inbox\nExpert Directory\nFind an expert by topic in a comprehensive database\nJournalists\nPricing\n⌕\nRequest a Demo\nLogin\nRegister\nExpert Pitch\nIs America in a Housing Crisis? Cultural Anthropologist on Today's Affordability and Access\n28-Oct-2025 8:00 AM EDT,\nby Wake Forest University\n♡\nCredit: ©2025 Wake Forest University\nDownload\nCredit: Sherri Lawson Clark\nPrevious\nNext\nNewswise — Is America currently in a housing crisis? Wake Forest University's Sherri Lawson Clark says individuals at all economic levels—from homeless populations to middle-income homeowners are struggling with affordability.A contributor to the 2020 national report Displaced in America, Clark’s research examines the intersections of housing policy with health and welfare policies. She is developing a new housing stability measure for use throughout the U.S. in addressing housing affordability and access.Is America facing a housing crisis?Yes. As a cultural anthropologist, I am interested in the ways in which the housing crisis is experienced at the individual level. A homeless person is experiencing a housing crisis as is the middle-income homeowner whose housing costs have risen above their income. Right now, the question is not necessarily are we in a housing crisis, but are we in a place where we are likely to see the next Great Recession. I think we’re at a place where we need to pay attention.How does this moment compare to the 2007 subprime mortgage crisis that led to the Great Recession?In similar ways, the 2007 subprime mortgage crisis did not begin in 2007; it began in the mid-1990s – taking almost a decade before the financial crisis of 2008. Today, many Americans find themselves unable to afford housing. According to the U.S. Department of Housing and Urban Development, the average homeowner or renter should spend no more than 30% of their monthly income on housing. My research shows that individuals are spending up to half of their monthly income on housing costs. This means there is little left over in their budgets for other necessities. According to the National Housing Conference, a non-profit organization dedicated to affordable housing, two issues define America’s new housing crisis: 1) skyrocketing housing costs and 2) the low rate of black homeownership, which is lower today than it was when segregation was legal.What does your research show?My current research study will shed light on the decision-making processes of homeowners and examine housing accessibility in one of East Winston-Salem, North Carolina’s high-poverty census tracts. I expect the findings will greatly aid in a newly created Housing Stability measure for use throughout the U.S. (and beyond) in addressing housing affordability and access.How do housing affordability challenges differ between urban centers, suburbs and rural areas?Available housing differs across urban areas with multi-family housing, suburban areas with single-family homes, and rural areas with more manufactured housing and single-family housing. However, all these areas face housing affordability concerns, which are projected to get worse with the current changes happening at the federal level.Who’s most at risk and what can be done?The most vulnerable across all areas are being displaced. Now is the time to think outside the box to develop alternatives to the traditional housing models. For example, limited equity cooperatives provide long-term affordability to residents who own shares in a development. Reducing zoning restrictions allows for more multi-family and smaller homes to be built on land zoned for single-family homes.Biography :Sherri Lawson Clark is an associate professor in the Department of Anthropology at Wake Forest University, where she has taught since 2009. An applied cultural anthropologist, she has conducted ethnographic fieldwork for more than 30 years with low-income urban and rural African American, Latino and white families across the U.S. Clark’s research focuses on housing instability among poor families and examines the intersections of housing policy with health and welfare policies, marriage initiatives, migration, and the effects of residential mobility on the well-being of poor children and families. At Wake Forest, Clark teaches courses in cultural anthropology and social stratification in America and helps students deconstruct and comprehend conceptual arguments by applying them in real life contexts.She is co-author of “Poverty Law and Advocacy in America” and a contributing editor to “Contemporary African American Families: Achievements, Challenges, and Empowerment Strategies in the Twenty-First Century.”### About Wake Forest UniversityWake Forest University’s motto, Pro Humanitate, reflects a commitment to academic excellence and to using ideas, knowledge and talents on behalf of humanity. The University’s Wake Forest University’s motto, Pro Humanitate, reflects a commitment to academic excellence and to using ideas, knowledge and talents on behalf of humanity. The University’s Winston-Salem, N.C. campus is home to nearly 9,000 students with more studying at Wake Forest locations in Charlotte, N.C., Washington, D.C. and around the world. In addition to the undergraduate College, the University encompasses the Graduate School of Arts and Sciences, as well as Schools of Business, Law, Medicine, Divinity and Professional Studies. Founded in 1834, Wake Forest embraces a University-wide approach to developing leaders of character and integrity. Learn more at www.wfu.edu.\nRequest an Expert\nMEDIA CONTACT\nRegister for reporter access to contact details\nRELATED EXPERTS\nSherri Lawson Clark\nAssociate Professor, Department of Anthropology\nWake Forest University\nTYPE OF ARTICLE\nExpert Pitch\nSECTION\nLIFE\nCHANNELS\nEconomics Government and Law Poverty Rural Issues U.S. Politics\nKEYWORDS\nhousing crisis Housing Instability housing affordability Housing Policy Health Policy welfare policy Homeownership Great Recession Subprime Mortgage\nCOMMENTS | COMMENTING POLICY\n×\n9 AM Daily Wire (click to select custom wire)\n0:00 Eastern Standard Time1:00 Eastern Standard Time2:00 Eastern Standard Time3:00 Eastern Standard Time4:00 Eastern Standard Time5:00 Eastern Standard Time6:00 Eastern Standard Time7:00 Eastern Standard Time8:00 Eastern Standard Time9:00 Eastern Standard Time10:00 Eastern Standard Time11:00 Eastern Standard Time12:00 Eastern Standard Time13:00 Eastern Standard Time14:00 Eastern Standard Time15:00 Eastern Standard Time16:00 Eastern Standard Time17:00 Eastern Standard Time18:00 Eastern Standard Time19:00 Eastern Standard Time20:00 Eastern Standard Time21:00 Eastern Standard Time22:00 Eastern Standard Time23:00 Eastern Standard Time\nName:\nEmail:\nMedia Outlet:\nAccept →\nView All Latest News\nForms\nMedia Press Pass\nUser Registration\nFind My Account\nPay an Invoice\nContact Us\nExperts\nRequest an Expert\nExpert Directory\nEmbargoed News\nSearch Sources\nNewswise\nServices for Journalists\nServices for Communicators\nGet Email Alerts\nDaily Wires\nLatest News\nChannel Index\nAdvanced Search\nSelect Media Database\nLive Events\nGet a Demo\nPricing\nFAQ\nAbout Newswise\nJournalists use Newswise as a source for research news, experts, ready-to-use content and story ideas. Media relations professionals can connect with reporters and share their organization's news with a wider\naudience. Public readers discover the latest research news in science, medicine, social sciences, environment, technology, factchecks and business news from the world's most credible universities and research organizations. More than 7,000 email wires go to journalists from more than 2,400 media outlets around the globe.\nContact Us\nSignup\nSubscribe to Newswise\nFor Journalists\nReceive a Demo\nPrivacy Notice\nTerms of Service\n2025 Newswise, Inc\n⌕\nLogin\nNews\nLatest News\nCOVID News\nCurrently Embargoed News\nResearch News Releases\nResearch Alert\nPreprints\nMarketplace\nNews with Video/Audio\nRSS\nMedicine\nBiotech\nCancer\nCOVID\nClinical Trials\nDiabetes\nGenetics\nInfectious Disease\nNeuro\nObesity\nWomen?s Health\nView all Medicine Channels\nScience\nChemistry\nClimate Science\nDinosaurs\nDOE Science News\nEngineering\nMaterials Science\nPhysics\nSpace\nView all Science Channels\nLife\nBehavioral Science\nEducation\nGovernment\nHistory\nPolitics\nSocial Media\nView all Life Channels\nBusiness\nEconomics\nWall Street\nIn the Workplace\nWomen in Business\nView all Business Channels\nJournal News\nCell (journal)\nJAMA\nJournal of Experimental Medicine\nNature (journal)\nNEJM\nNeurology (journal)\nPLoS\nView all Journal Channels\nTrends and Top Stories\nStaff Picks\nTop Clipped\nStories\nTop Hit Stories\nBy Location\nAfghanistan News\nAfrican News\nChina News\nCuba News\nEurope News\nGermany News\nGulf of Mexico\nIndia/Pakistan News\nIraq News\nView all by Location Channels\nMeetings, Grants, and Events\nGrant Funded News\nMedical Meetings\nNewswise Live - Event in Progress\nNewswise Live - Expert Spotlight\nNewswise Live - Events\nScientific Meetings\nView all Meeting, Grants & Events Channels\nExperts\nExpert Pitch\nExpert Query\nExpert Directory\nJournalists\nPricing\nAbout\nMember Services\nAccessibility Statement\nNewswise Live\nInvoice Lookup\nServices for Journalists\nArchived Wires\nParticipating Institutions\nMedia Subscribers\nSample Effectiveness Reports\nTerms of Service\nPrivacy Policy\nOur Staff\nContact Newswise\nBlog\nFAQ\nHelp\n0.41857", "extraction_method": "beautifulsoup", "word_count": 1616, "success": true}