{"full_text": "Breadcrumb Trail LinksHomeOpinionOp-Ed\nShare this Story : Opinion: Local policies contribute to Metro Vancouver’s housing affordability woes\nCopy Link\nEmail\nX\nReddit\nPinterest\nLinkedIn\nTumblr Opinion: Local policies contribute to Metro Vancouver’s housing affordability woesTegan Hill and Austin Thompson: Builders would build more homes in Metro Vancouver, despite falling prices, if not for lengthy approval processes and costly government fees.Author of the article:By Tegan Hill, Austin Thompson Published Nov 20, 2025Last updated 4 days ago3 minute read\nJoin the conversation\nYou can save this article by registering for free here. Or sign-in if you have an account.According to a new study published by the Fraser Institute, in 2023 (the latest year of comparable data), the annual median after-tax income for a family in Metro Vancouver was $64,660 while the price of a typical home was $1.17 million. Photo by NICK PROCAYLO /10107351AArticle contentMetro Vancouver’s housing market is cooling — but not by nearly enough to help many families priced out of home ownership. After peaking at around $1.25 million in mid-2022, the price of a typical home has fallen to roughly $1.14 million (as of September).THIS CONTENT IS RESERVED FOR SUBSCRIBERS ONLYSubscribe now to read the latest news in your city and across Canada.Unlimited online access to articles from across Canada with one account.Get exclusive access to the Vancouver Sun ePaper, an electronic replica of the print edition that you can share, download and comment on.Enjoy insights and behind-the-scenes analysis from our award-winning journalists.Support local journalists and the next generation of journalists.Daily puzzles including the New York Times Crossword.SUBSCRIBE TO UNLOCK MORE ARTICLESSubscribe now to read the latest news in your city and across Canada.Unlimited online access to articles from across Canada with one account.Get exclusive access to the Vancouver Sun ePaper, an electronic replica of the print edition that you can share, download and comment on.Enjoy insights and behind-the-scenes analysis from our award-winning journalists.Support local journalists and the next generation of journalists.Daily puzzles including the New York Times Crossword.REGISTER / SIGN IN TO UNLOCK MORE ARTICLESCreate an account or sign in to continue with your reading experience.Access articles from across Canada with one account.Share your thoughts and join the conversation in the comments.Enjoy additional articles per month.Get email updates from your favourite authors.THIS ARTICLE IS FREE TO READ REGISTER TO UNLOCK.Create an account or sign in to continue with your reading experience.Access articles from across Canada with one accountShare your thoughts and join the conversation in the commentsEnjoy additional articles per monthGet email updates from your favourite authorsSign In or Create an AccountEmail AddressContinueor View more offersIf you are a Home delivery print subscriber, online access is included in your subscription.\nActivate your Online Access NowArticle contentThat’s a meaningful drop, yet homes still cost far more than what many families can afford. Without reforms that reduce costs and delays for homebuilders, Metro’s housing crisis will continue.Article contentArticle contentArticle contentTo illustrate the scale of the problem, consider what buying a home in Metro looks like for a middle-income family. According to a new study published by the Fraser Institute, in 2023 (the latest year of comparable data), the annual median after-tax income for a family in Metro was $64,660 while the price of a typical home —  meaning a home of any type (detached, townhouse, condo, etc.) with common characteristics and amenities — was $1.17 million.Article contentThere was an error, please provide a valid email address.Sign UpThanks for signing up!A welcome email is on its way. If you don't see it, please check your junk folder.The next issue of will soon be in your inbox.We encountered an issue signing you up. Please try againInterested in more newsletters? Browse here.Article contentThat means a family had to save $238,240 — equal to more than 3 1/2 years of its after-tax income — for a 20 per cent down payment on a typical home.Article contentBut even after this massive down payment, the monthly mortgage payment ($6,052) would cost more than the family’s entire monthly after-tax income.Article contentObviously, for many families, buying a typical home is impossible.Article contentFor those priced out of home ownership, renting has offered little relief. Metro was Canada’s second least-affordable area for renters in 2023 (again, the latest year of comparable data), with the median rental unit costing $1,715 per month — or 31.8 per cent of the median after-tax family income — up from $1,035 (26.3 per cent) a decade earlier in 2014.Article contentArticle contentAnd there’s more bad news. While the recent decline in house prices hasn’t been enough to meaningfully improve affordability, it has made it harder for builders to cover their costs, prompting a steep contraction in homebuilding at a time when the city needs more new homes.Article contentRead More\nMost Vancouverites believe the city’s 'brand' is in decline. Why is that?\nGranville Street social housing, subject of countless complaints and emergency calls, will close by June 2026 Advertisement 1Story continues belowThis advertisement has not loaded yet, but your article continues below.Article contentThis unhealthy dynamic, where price declines weigh heavily on housing construction, is made worse by government policy. Despite hundreds of millions of taxpayer dollars spent on housing initiatives by the federal government, the Eby government and Metro municipalities, including the City of Vancouver, provincial and municipal policies continue to impose needless costs, delays and restrictions on homebuilding.Article contentFor example, municipal approvals for new housing projects take twice as long in Vancouver (7.7 months) as they do in Edmonton (3.4 months) or Regina (3.2 months), owing to a complex and time-consuming permitting process.Advertisement 1This advertisement has not loaded yet.Trending Saskatchewan firm's plan to export through Washington state instead of B.C. has David Eby fuming\nColumnists\nVancouver couple's Dungeons and Dragons invention hits viral success\nNews\nAdvertisement 2Story continues belowThis advertisement has not loaded yet, but your article continues below. Two bears captured as search for three bears involved in Bella Coola field trip attack continues\nNews\n'Shocked and sad': B.C. man issues warning after dad scammed out of more than $40,000 in life savings\nNews\nCanadian actor Spencer Lofranco dies in B.C. at age 33\nNews\nAdvertisement 2AdvertisementThis advertisement has not loaded yet, but your article continues below.Article contentNew highrise developments in Vancouver face municipal fees of $30,900 per unit — compared with $9,300 in Edmonton and $9,000 in Regina. These policies add costs and delays that deter homebuilding, especially when falling prices are already squeezing developer margins.Article contentOf course, some factors remain beyond the control of local policy-makers.Article contentFor example, federal immigration policy, particularly over the last five years, has greatly increased demand for homes in the Lower Mainland and across Canada.Article contentBut here’s a fact — builders would build more homes in Metro, despite falling prices, if not for lengthy approval processes and costly government fees. To help improve housing affordability in Metro, municipalities in the district must remove unnecessary barriers to development.Article contentTegan Hill and Austin Thompson are analysts at the Fraser Institute.Article contentShare this article in your social network\nShare this Story : Opinion: Local policies contribute to Metro Vancouver’s housing affordability woes\nCopy Link\nEmail\nX\nReddit\nPinterest\nLinkedIn\nTumblr CommentsYou must be logged in to join the discussion or read more comments.Create an AccountSign in\nJoin the Conversation Postmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information.Featured Local Savings", "extraction_method": "beautifulsoup", "word_count": 1264, "success": true}