{"full_text": "Kate Keefer is a resident of the Riverton Community in Portland.\nPortland has a housing crisis, but we need to be precise about what that crisis actually is. The problem isn’t housing quantity — it’s housing affordability. According to Zillow, Portland currently has 271 rental units available. Yet only 28 of those units — slightly more than 10% — rent for under $1,800 per month.\nTo understand why this matters, consider the economics: Maine’s median hourly wage is $24.19. A full-time worker at that wage can afford roughly $1,262 in monthly rent under thefederal standard established by the U.S. Department of Housing and Urban Development that housing costs should not exceed 30% of income.\nA minimum wage worker earning $14.65/hour can afford just $762 per month. According to the National Low Income Housing Coalition’s 2025 Out of Reach report, a worker would need to earn $28.42 per hour — well above Maine’s median wage — just to afford a two-bedroom apartment at fair market rent.\nThe result is that 53% of Maine renters are now cost-burdened, paying more than 30% of their income on housing — up from 32% just five years ago. There are only 52 affordable units available for every 100 extremely low-income households statewide. Yet the Portland Planning Board continues approving developments that barely address this reality.\nThe recently approved Belfort Landing project exemplifies the disconnect: 50 new units, with only 13 designated as “affordable” — just 25%. When nearly 90% of our rental housing need is for truly affordable units, building developments that are 75% market-rate doesn’t solve the problem.Advertisement\nThis pattern isn’t unique to Belfort Landing. Across Portland, market-rate and luxury housing dominates new construction because they are more profitable. The Planning Board approves these projects in the name of “adding housing supply,” while Portland’s low- and middle-income families continue to be priced out.\nThe data are clear: we’re not experiencing a housing shortage. We’re experiencing an affordable housing shortage. Adding more expensive units to our inventory doesn’t help the librarian, the barista, the electrician or the cop who can’t find housing they can afford.\nThe Planning Board and City Council have tools to demand better. They can require substantially higher percentages of affordable units in new developments.\nThey can prioritize projects that serve demonstrated community needs over developer profit margins. They can ensure that “adding housing” actually means adding housing that working Portlanders can afford.\nUntil our city officials make this distinction and act on it, we’ll continue building the wrong thing — adding units to our inventory while families leave Portland because they simply can’t afford to stay.\nPortland deserves responsible development that serves its residents, not just its real estate market.\nCopy the Story Link\nTagged: columns", "extraction_method": "beautifulsoup", "word_count": 455, "success": true}