{"full_text": "Angelita Ellison, 42, splits housing expenses with her sister and pays about $900 per month for rent and utilities.Read moreElizabeth Robertson / Staff Photographerby Michaelle Bond and Lizzie Mulvey Published Oct. 13, 2025, 5:00 a.m. ETThe number of Philadelphians who spend more than a third of their income on rent is growing.Almost half of renters spent 35% or more on housing costs in 2024, a four percentage point increase over the previous year, according to Census Bureau data. It’s the only category of renters that grew by percentage.AdvertisementThe U.S. Department of Housing and Urban Development calls any renter who spends more than 30% of their income “cost burdened.”Kadeem Morris, comanaging attorney of the housing unit at Community Legal Services of Philadelphia, a legal aid nonprofit, sees renters struggling with cost burdens every day.Recently, a man in his 70s asked for help after his landlord of two decades sold the property and the new owner said his rent would double to $1,200. The man receives about that much per month from the Social Security Administration and has been using half to pay his rent since his wife died six months ago. Now, he’ll need to find a new place to live.Morris said he’ll qualify for some help to pay his bills. “Still, a large chunk of his check will be going toward keeping himself housed. Hopefully, it’s not more than 60[%] to 70%, which is extremely high.”In 2024, more than 148,900 households in Philadelphia were spending 35% or more of their income to rent their homes. Cost-burdened households have less money to pay for other essentials such as food and healthcare and to save for emergencies and future goals.The Joint Center for Housing Studies at Harvard University found that nationally, two-thirds of working-age renters don’t have enough money left over after paying rent to cover other necessities, according to a paper published last month. That’s more than the 50% of renters who are considered cost burdened under the traditional definition.“It’s definitely an all too common scenario that our seniors in particular are facing,” Morris said. Where many cost-burdened renters liveResearchers at Reinvestment Fund, a Philadelphia-based community investment nonprofit, have seen the highest increases in housing cost burdens across outer West Philadelphia, the Germantown area, upper North Philadelphia, and lower Northeast Philadelphia, said Emily Dowdall, president of policy solutions. That aligns with the latest Census Bureau data.In neighborhoods such as Hunting Park in North Philadelphia and Cobbs Creek in West Philadelphia, where residents largely have low to moderate incomes and are largely people of color, costs to rent or own are on the rise.The makeup of these neighborhoods has stayed roughly the same in recent years, which indicates that established communities haven’t been displaced with people who can pay more, but “the same people are now paying more for the same homes,” Dowdall said.A ‘balancing act’Seniors’ fixed incomes are “just not keeping up with the rental market,” said Rita Eichman, tenant rights staff attorney at the nonprofit SeniorLAW Center. “They have to stretch the little money they have. A lot of them are scraping by.”When they need grab bars or other modifications to make homes accessible, “a lot of times, seniors have to come out of their own pocket to make those updates for themselves,” she said.SeniorLAW Center helps connect older Philadelphians with resources, including food pantries and utility assistance programs. But renters can’t benefit from those programs when their names aren’t on the utility accounts, as often happens for water and gas, Eichman said.She often works with seniors who have little to no income or assets who are eligible to receive monthly payments through the Social Security Administration’s Supplemental Security Income (SSI) program. But the timing of payments depends on the recipient’s last name. So renters may not get paid by their rent deadline.“They’re in a situation where they’re constantly juggling their finances,” Eichman said. “It’s hard to convince a landlord, ‘Can they just pay you on the 15th?’”Fees for late rent can be costly. “Then that throws them totally off,” she said. “And it’s hard for them to come back from that.”Some of her clients have worked out deals with landlords to pay in two installments during the month, timed to SSI, pension, or other payments.“It is very much a balancing act,” Eichman said.Making it workMany renters share the rent burden by renting with friends and family.Angelita Ellison, her 19-year-old son, and her sister live in a rowhouse with three bedrooms and one bathroom in the Sharswood area of North Philadelphia.Ellison, 42, splits housing expenses with her sister and pays about $900 per month for rent and utilities.She recently got a raise, so before taxes, she makes a little less than $3,200 per month. But she has a seasonal job working for the state for the Low-Income Home Energy Assistance Program. So for about three months of the year, she relies on unemployment benefits. With housing costs, student loan payments, and other expenses, during those months, “I try to be strategic about what gets paid,” Ellison said.“Especially right when rent is due, it feels like I have the least amount of money,” she said.With her raise, she thinks she could move into a home with just her son, but her sister would struggle to afford her own place. And if Ellison had to pay $1,800 for housing costs herself, she’d be spending more than half her income.“It’s difficult for me,” she said, “but I feel like I’m in a much better position than a lot of other people.”Rising rentsRents in Philadelphia have risen for a variety of reasons.Some of the increase comes from inflation and the rising costs of owning and maintaining rental properties. Home values have jumped up across the city in recent years, so buyers of rental properties are paying more and charging tenants more to cover costs and make a profit.Homes in Philadelphia have appreciated more than 92% over the past 10 years, according to a Lindy Institute for Urban Innovation analysis of Federal Housing Finance Agency data. In the last year alone, home values have increased by 3.4%. Demand for rentals is high, so landlords can charge more. This summer, there were 10 prospective renters for each available apartment in Philadelphia, according to a report by RentCafe, a nationwide apartment search website. That’s up from eight renters a year ago.Some of the rent uptick comes from the city’s changing rental landscape.Philadelphia has historically been a place with a lot of small landlords who own a few homes or less. But since the pandemic, more larger-scale corporate investors have moved in, said Dowdall at Reinvestment Fund, “and they’ve become really interested in the lowest-cost housing stock.”These regional and national rental property owners profit when they buy homes for low prices and raise rents. Institutional investors, such as those associated with banks and private equity groups, are responsible for bringing in revenue for their shareholders.“Once you make housing a commodity, you’re gonna see those rents go up,” she said.Lagging incomesIn Philadelphia, low incomes are the main reason why people can’t afford homes — more than high housing prices.The average income of housing clients at Community Legal Services is about $13,000. Morris estimates that most are spending half of their income on housing costs.Monthly rent in Philadelphia increased from a median of $1,390 in 2023 to $1,500 in 2024, according to American Community Survey data. So last year, the typical renter had to pay about $1,320 more over a 12-month period.But annual incomes have decreased. The household median went from $62,100 in 2023 to $60,500 in 2024 after adjusting for inflation. And that’s the median, so half of households were making less.Pennsylvania’s minimum wage is one of the lowest in the country at $7.25. The Massachusetts Institute of Technology found in February that an hourly living wage for a one-person household in Pennsylvania was $22.91.“Raising that minimum would help a lot of people be better able to pay for basic things like housing, medical costs, etcetera,” Dowdall said.Some Philadelphians have incomes that just aren’t enough to cover housing costs, and the complex housing affordability problem requires a variety of solutions, she said.“It’s essential that we’re helping people raise their wages, that we’re helping people supplement their incomes with things like subsidies, and that we’re lowering the cost of housing,” she said.", "extraction_method": "beautifulsoup", "word_count": 1382, "success": true}