{"full_text": "Menu  \n \n \n \nHome \nInternational \nBusiness \nCaribbean \nWire \nSearch \nWeather \nNetwork    \n VOLUME NO. 0205/16     \n \n \n \n \n \nCharlotte to Host Inaugural Housing Innovation Challenge to Tackle the National Affordability Crisis \nACCESS Newswire \n18 Nov 2025, 20:20 GMT+10  \n \n \nCHARLOTTE, NC / ACCESS Newswire / November 18, 2025 / The Housing Innovation Alliance, in partnership with the City of Charlotte, Meritage Homes and Home Technology Ventures, is calling on leading housing innovators to reimagine how America designs and delivers the next generation of homes.\nThe Housing Innovation Challenge (Challenge) is uniting students, builders, and innovators to deliver new housing solutions. It's not just another competition, it's a national call to action - an invitation to roll up our sleeves and tackle one of the greatest challenges of our time: making quality housing more attainable.\nReducing the Total Cost of Housing\nPeople are priced out of the dream of homeownership. Nearly 75% of households across the country are unable to afford the median-priced new home and more than 50% of Gen Z renters believe winning the lottery is their only ticket to buying their first home.\nConstruction costs keep rising. Productivity and innovation haven't kept pace. Traditional methods can't deliver the speed or affordability needed to solve this growing problem. This Challenge aims to change that; bringing together the best minds in design, engineering, construction, technology, and business to rethink the entire process of how homes are designed, built and utilized for long-term value. Building on the 20-year legacy of the U.S. Department of Energy's Solar Decathlon, the Challenge expands the conversation from energy performance to total cost of housing - focusing beyond what price the home can be delivered to include its cost of maintenance, utilities, insurance and the other hidden, growing costs of homes.\nCharlotte Mayor Vi Lyles praised the initiative,'We are proud to host the Housing Innovation Challenge. Affordable housing is a critical area of investment that remains a priority for the City of Charlotte. This competition has a meaningful purpose which is to create more affordable housing not just in our city, but in every city across the country. The Challenge shines a spotlight on the incredible talent we have right here in Charlotte and across the Carolinas - architects, engineers, builders, and entrepreneurs who can lead the nation in housing innovation.\nThe Competition\nThe Challenge is a two-phase design and build competition open to universities, colleges, and vocational schools across North America. Through the Housing Innovation Alliance's national network, the teams will partner with industry veterans to operationalize their ideas and introduce the next generation of housing solutions.\nPhase 1: Design + Planning (December 2025 - May 2026)\nPhase 1 pushes teams to rethink housing industry norms - advancing conceptual and schematic designs that explore new approaches to design, materials, systems, construction, and long-term performance. 'This first phase is about bold ideas,' says Bobby Vance, Competition Co-Director and Assistant Professor at Virginia Tech. 'We want proposals that challenge entrenched norms, demonstrate innovation in industrialized or hybrid off-site construction, and show how homes can be built faster, more affordably, and with lower future operating costs.'\nWorking within (while also challenging) existing Charlotte zoning parameters and affordability targets for households earning ≤ 80% AMI, teams may submit up to three design proposals, each envisioning a home that is beautiful, attainable, and replicable. Land is provided, allowing each proposal to focus on optimizing construction cost and long term operational performance.\nAll submissions are due March 20, 2026, and will be evaluated through the H.O.M.E. Framework - a proprietary framework for a holistic view of affordability contemplating the costs of Home Delivery, Occupancy, Maintenance, and the benefits of increased Equity - by a committee of national experts, industry leaders, and City of Charlotte partners.\nUp to ten Finalist teams will be selected to move on to Phase 2. Each Finalist will receive $10,000 in travel support and be invited to the Housing Innovation Summit in Charlotte (May 19-21, 2026), where they will be officially announced to the public.\nPhase 2: Build + Showcase (May 2026 - October 2027)\nIn Phase 2, the finalist teams transition from concept to construction, working hand-in-hand with leading national builders and industry partners to transform their schematic ideas into full-scale homes built in Charlotte. Each home will be delivered using an industrialized approach incorporating off-site construction methods where possible, emphasizing speed, precision, and cost-effectiveness.\nAcademic teams will continue to lead design development and actively participate in the fabrication and assembly, contributing labor, documentation, and technical coordination to gain hands-on experience throughout the project. Build partners and material sponsors will provide expertise, construction leadership, and product support to ensure every home reflects the Challenge's core goals.\nHomes will be built ahead of the October 2027 public exhibition, when Charlotte will host the inaugural Housing Innovation Challenge showcase. 'This is where it gets really exciting. During the exhibition period, these homes will serve as living laboratories - open for public tours, industry workshops, research activities, and policy discussions. This is a unique opportunity for the teams to see their work in the wild,' emphasized Challenge Co-Director and industry competition veteran Richard King. Following the Challenge, each home is intended for delivery to local residents, leaving a permanent affordability legacy in Charlotte while forming the foundation for a national catalog of replicable, industrialized housing solutions.\nBuilding a National Ecosystem for Change\nThis initiative is a catalyst for systemic transformation in housing. Dennis Steigerwalt, President of the Housing Innovation Alliance, underscores the foundation of this effort, 'Participating teams are decoding signals at the intersection of lifestyle aspirations and economic realities shaping today's housing market. These insights will inform actionable strategies to enhance housing performance, elevate consumer value, and strengthen margins across the value chain.'\nIndustry leaders echo that sentiment, emphasizing the human impact behind the work. Brett Welch, Senior Director of Building Science and Innovation at Meritage Homes, frames the Challenge as an investment in people: 'We believe every family deserves to live better, at a price they can afford,' Welch said. 'The Challenge gives us a chance to engage people with new ideas and empower students and tradespeople to redefine how homes are made.'\nJoin the Challenge\nWhether you're a student, builder, manufacturer, or community partner, you can play a role in the Challenge.\n'I'm calling on city leaders, state partners, and local industry to rise to the occasion - to support our students, sponsor our teams, and help us build a future where every individual and family can afford a place to call home,' added Mayor Lyles.\nThat spirit of collaboration and innovation resonates with Chris Langford, Managing Partner of Home Technology Ventures, who sees Charlotte as the ideal stage for this national conversation: 'Innovation is an important part of the solution to the housing crisis today,' said Langford. 'As a Charlottean and one of the original investors in housing-related innovation, I am incredibly proud to bring this Challenge to the city and, further, to the benefit of the country as a whole. This is a groundbreaking catalyst for showcasing what the best and brightest minds can accomplish when focused on the biggest issue of our time.'\nVisit www.hic.live to learn more and register to participate.\nAbout the Team\nHousing Innovation Alliance - A national crowd-accelerated innovation platform dedicated to shaping the future of housing. By fostering collaboration across the production homebuilding value chain, the Housing Innovation Alliance prioritizes emerging trends and turns vision into reality, sharing strategies that drive measurable change in the industry and frameworks that ensure the industry is ready for what's next.\nCity of Charlotte - Known as the Queen City, it is one of the fastest-growing metropolitan areas in the United States and a leading hub for finance, technology, and innovation. As the second-largest banking center in the nation and a gateway to the Southeast, the city offers a thriving economy, world-class amenities, and a collaborative spirit that makes it an ideal location for national initiatives and forward-thinking conversations\nMeritage Homes Corporation (NYSE: MTH) - A leading U.S. homebuilder recognized for pioneering energy-efficient construction and innovative design, Meritage builds single-family homes across fast-growing markets nationwide, with a focus on affordability, sustainability, and quality.\nHome Technology Ventures - An early-stage investment firm focused on transforming the home industry. Based in Charlotte, Home Technology Ventures backs innovative technologies and business models that improve affordability, sustainability, and simplicity in housing. With deep domain expertise and strong industry connections, the team helps founders build category-defining companies that shape the future of how we live.\nContact Information\nBobby Vance \nCompetition Co-Director\n[email protected]\n\n \nSOURCE: Housing Innovation Challenge\n\nView the original press release on ACCESS Newswire\n\n  \n      \n \n \n      \n \n \n \n  Share article:   \n\n   Shares  \n  Share \n  Tweet \n  Share \n  Flip \n  Email     \n   \n \n \nWatch latest videos  \n \n \n    \n \n    \n \n    \n \n       \n \n \n Subscribe and Follow  \n Get a daily dose of Trinidad Times news through our daily email, its complimentary and keeps you fully up to date with world and business news as well.   \n  \nSubscribe Now   \n \n \n     \n     \n     \n        \n \n      \n \n \n \n News RELEASES  \n Publish news of your business, community or sports group, personnel appointments, major event and more by submitting a news release to Trinidad Times.  More Information     \n  \n \n \n     \n \n \nInternational Section  \n \n \n Kyiv officials under pressure amid embezzlement probe at nuclear firm  \n   \n \nKYIV, Ukraine: As Russia's renewed strikes on Ukraine's energy system trigger rolling blackouts ahead of winter, a major embezzlement...     \n \n \n Washington targets ‘violent Antifa groups’ in Germany, Italy, Greece  \n   \n \nWASHINGTON, D.C.: The United States on November 13 designated four groups in Germany, Italy, and Greece as global terrorists, accusing...     \n \n \n Delhi air emergency: Supreme Court urges lawyers to go virtual  \n   \n \nNEW DELHI, India: With air pollution choking New Delhi this week, India's Supreme Court has advised lawyers to avoid in-person appearances...     \n \n \n 'No Palestinian state west of Jordan River,' vows Netanyahu  \n   \n \nJERUSALEM - Israeli Prime Minister Benjamin Netanyahu, facing an election year, has doubled down on his decades-long opposition to...     \n \n \n US trade deal gives Seoul nuclear sub rights, slashes tariffs  \n   \n \nSEOUL/WASHINGTON, D.C.: South Korea will invest US$350 billion in U.S. industry and receive approval to build nuclear-powered submarines,...     \n \n \n ATM explosions in Germany drop sharply after police crackdown  \n   \n \nFRANKFURT, Germany: An aggressive crackdown by the German police has led to just 115 ATM explosions so far this year, compared with...      \n \n     \n \n \nCaribbean  Section  \n \n \n UK halts some intelligence from US amid fears of unlawful US attacks  \n   \n \nLONDON, U.K.: The U.K. has stopped sharing some intelligence with the U.S. on suspected drug trafficking boats in the Caribbean following...     \n \n \n Aaron Rai replaces Justin Thomas in Hero World Challenge field  \n   \n \n(Photo credit: Allison Lawhon-Imagn Images) England's Aaron Rai will replace Justin Thomas in next month's Hero World Challenge field....     \n \n \n New Zealand lose Daryl Mitchell to injury for West Indies series  \n   \n \nWellington [New Zealand], November 18 (ANI): New Zealand's Daryl Mitchell to sit out the rest of the ODI series against the West Indies...     \n \n \n \"Build yourself some flat wickets\": Alyssa Healy tips India after harrowing 30-run defeat against South Africa at Eden Gardens  \n   \n \nNew Delhi [India], November 17 (ANI): After the Indian team failed to chase 124 runs against South Africa in the first Test at Kolkata,...     \n \n \n Unprecedented record made during Kolkata Test: First fixture with both teams bowled out below 200 in India  \n   \n \nNew Delhi [India], November 17 (ANI): The first Test between India and South Africa, which concluded in just three days at Eden Gardens,...     \n \n \n Ousting Maduro would tie US down for years CNN  \n   \n \nAny Washington-installed replacement in Venezuela would require sustained support, according to analysts cited by the outlet A US-backed...      \n \n \nMovie Review  \n    \n \n Souleymane&#039;s Story (L???Histoire de Souleymane) [Blu-Ray]  \n       \n \n \n \n \n \nAbout us \nContact us \nNews Releases \nPrivacy Policy \nTerms & Conditions \nArchives \nSitemap \nWeather \nNetwork   \n \n \n   \n    \n    \n       \n \n© Copyright 1999-2025 Trinidad Times. All rights reserved.", "extraction_method": "jina", "word_count": 1919, "success": true}